{"transcript":"frosty: Hi there! This is Frosty. How can I help you today?\ncaller: Hi Frosty, I want to make my holiday wish.\nfrosty: Of course! May I know your name, please?\ncaller: I'm Alex.\nfrosty: Hi Alex! Where are you calling from?\ncaller: From Houston.\nfrosty: Wonderful! Now, what's your holiday wish?\ncaller: I want the barbie science doll set and pokemon plushie.\nfrosty: Awesome choices, Alex! Your list has been added. Thanks for calling and have a jolly Holiday!","name":"Alex","location":"Houston","toy_list":["Barbie Science Lab Playset","Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Hello, happy holiday! How can I help you today?\ncaller: I'm Amber. I want to give my wish list.\nfrosty: Of course, Amber! What's on your wish list?\ncaller: robot dog and the fox plushie.\nfrosty: Brilliant choices, Amber! And where are you calling from? \ncaller: From London.\nfrosty: Alright, Amber from London. Your list has been recorded. Have a fantastic holiday!","name":"Amber","location":"London","toy_list":["Dog-E","2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"frosty: Hi! I'm Frosty, how can I assist you today?\ncaller: Hi, I'm Bella from San Francisco. \nfrosty: Wonderful, Bella! How can I assist you today?\ncaller: I wish for trasformers bumblebee and the new barbie dreamhouse.\nfrosty: Those are fantastic wishes, Bella! I've added these to your list. Enjoy your holidays!","name":"Bella","location":"San Francisco","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Hello! This is Frosty. How can I help you?\ncaller: Hi, I'm Luke. \nfrosty: Hi Luke! Where are you calling from?\ncaller: I'm calling from Melbourne.\nfrosty: Great! What would you like to wish for, Luke?\ncaller: I wish for magic microscope and spiderman playset.\nfrosty: Good choices, Luke! Your wish list has been recorded. Happy Holidays!","name":"Luke","location":"Melbourne","toy_list":["LeapFrog Magic Adventures Microscope","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Hi, happy holidays! How can I assist you?\ncaller: Hi, I'm Owen from Toronto.\nfrosty: Hello, Owen! What are your holiday wishes?\ncaller: I wish for lola droid and mickey playset.\nfrosty: Brilliant! Your wishes have been noted, Owen. Have a fantastic holiday!","name":"Owen","location":"Toronto","toy_list":["Star Wars LOLA animatronic droid","Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Hi there! Frosty here. How may I assist you today?\ncaller: Hi, I'm Lily. I want to give you my holiday wishes.\nfrosty: Hello, Lily! I'm eager to hear your wishes. What are they?\ncaller: My wishes are furby and bluey car.\nfrosty: Sure thing, Lily! Where are you calling from?\ncaller: From Vancouver.\nfrosty: Thanks, Lily from Vancouver. Your wishes have been added. Enjoy your holidays!","name":"Lily","location":"Vancouver","toy_list":["Furby interactive plush toy","Bluey Convertible and Figures"]}
{"transcript":"frosty: Hello! How may I assist you today?\ncaller: Hi, I'm Jake from Dublin.\nfrosty: Hello, Jake! What's your holiday wish?\ncaller: My holiday wish is gabby dollhouse.\nfrosty: That's a fun wish, Jake! Your wish has been added. Have a joyful holiday!","name":"Jake","location":"Dublin","toy_list":["Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Hello, I'm Frosty! How can I help you?\ncaller: Hi Frosty, I'm Grace.\nfrosty: Hi Grace! Where are you calling from?\ncaller: From Auckland.\nfrosty: Wonderful, Grace! What is your holiday wish?\ncaller: bluey playhouse is my wish.\nfrosty: Excellent! Your wish has been added, Grace. Have a wonderful holiday!","name":"Grace","location":"Auckland","toy_list":["Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"frosty: Hi! Hoping you're having a joyful day. How can I help you?\ncaller: Hi, I'm Adam from Sydney.\nfrosty: Hello Adam! What would you like to wish for this holiday?\ncaller: My wish is lego olivia's space set.\nfrosty: That's a wonderful wish, Adam! Your wish has been sent. Have a fantastic holiday!","name":"Adam","location":"Sydney","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Hello there! How may I assist you?\ncaller: Hi, I'm Ava.\nfrosty: Hi Ava! Where are you calling from?\ncaller: I'm calling from Manchester.\nfrosty: Great Ava! What's your holiday wish?\ncaller: fingerlings monkey, please.\nfrosty: Awesome choice, Ava! Your wish list has been recorded. Have a joyous holiday!","name":"Ava","location":"Manchester","toy_list":["Fingerlings"]}
{"transcript":"frosty: Hello there, lovely child! What's your name?\ncaller: I'm Billy.\nfrosty: Nice to meet you, Billy! Where are you from?\ncaller: Sydney.\nfrosty: That's a great city, Billy from Sydney! What can Frosty gift you this holiday?\ncaller: I want the furby and the bluey car.","name":"Billy","location":"Sydney","toy_list":["Furby interactive plush toy","Bluey Convertible and Figures"]}
{"transcript":"frosty: Hi there, little one! May I know your name?\ncaller: Hi Frosty, I'm Emma and I live in Houston.\nfrosty: Lovely to hear from you, Emma from Houston! Have you thought about your holiday wish list?\ncaller: Yes, I want the spiderman playset.","name":"Emma","location":"Houston","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Ho Ho Ho! What's your name, dear friend?\ncaller: Hi, I'm Oliver. \nfrosty: Hello, Oliver! Where are you calling from?\ncaller: I'm from Auckland.\nfrosty: A wonderful place, Oliver! What would make this holiday merrier for you?\ncaller: I wish for the lola droid and the ninja turtles delivery van.","name":"Oliver","location":"Auckland","toy_list":["Star Wars LOLA animatronic droid","Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Hello my little friend, what's your name?\ncaller: I'm Leah from Toronto.\nfrosty: Hello there Leah from Toronto! What would make your holidays joyful?\ncaller: I hope to get the baby bee doll and the playfoam letters.","name":"Leah","location":"Toronto","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Playfoam Naturals Shape & Learn Letters & Numbers"]}
{"transcript":"frosty: Greetings! Can I have your lovely name?\ncaller: My name is Michael. I'm from London.\nfrosty: Nice to meet you, Michael from London! What do you want for this holiday season?\ncaller: I want the jurassic world dinosaur.","name":"Michael","location":"London","toy_list":["Jurassic World Dominion Super Colossal Giganotosaurus"]}
{"transcript":"frosty: Merry Greetings! What's your name, little one?\ncaller: I am Amy.\nfrosty: Lovely to have you here, Amy! Where is home for you?\ncaller: From Melbourne.\nfrosty: Oh, beautiful place, Amy! What's on your holiday wish list?\ncaller: I want the lego olivia's space set and the mickey playset.","name":"Amy","location":"Melbourne","toy_list":["Lego Friends Olivia's Space Academy","Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Hi there! Who do I have the pleasure of talking to?\ncaller: My name is Jake, and I am from Birmingham.\nfrosty: Nice to meet you, Jake from Birmingham! What are we hoping for this holiday?\ncaller: I hope for the trasformers bumblebee.","name":"Jake","location":"Birmingham","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Ho Ho Ho! What's your name, dear friend?\ncaller: I'm Chloe.\nfrosty: Hello Chloe, where are you calling from?\ncaller: From Christchurch.\nfrosty: A wonderful place, Chloe! What would make your holidays brighter?\ncaller: I wish for the gabby dollhouse and the pony’s hair salon.","name":"Chloe","location":"Christchurch","toy_list":["Gabbys Dollhouse Cruise Ship","Calico Critters Pony's Stylish Hair Salon"]}
{"transcript":"frosty: Season's greetings! What's your name?\ncaller: I’m Mia and I want the barbie science doll set.\nfrosty: That's a great choice, Mia! But can I know where you are calling from?\ncaller: Oh, I am from Sydney.","name":"Mia","location":"Sydney","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Hello, dear child! I'm Frosty, may I have your name please?\ncaller: Hi Frosty, I'm Ethan and I am from Auckland.\nfrosty: That's great to know, Ethan from Auckland! What would you like to receive this holiday?\ncaller: I would like to have the snap circuit set.","name":"Ethan","location":"Auckland","toy_list":["Snap Circuits: Junior"]}
{"transcript":"frosty: Hello there! This is Frosty, are you ready to share some Christmas magic?\ncaller: Hi Frosty, my name is Jamie.\nfrosty: Hi Jamie! Where are you calling from?\ncaller: I am calling you from New York. \nfrosty: Wonderful! Now, what's on your holiday wish list?\ncaller: I want a furby and barbie science doll set.\nfrosty: That sounds great! I hope you've been good this year. Merry Christmas!","name":"Jamie","location":"New York","toy_list":["Furby interactive plush toy","Barbie Science Lab Playset"]}
{"transcript":"frosty: Ho-ho-ho! Frosty at your service! Who am I speaking with?\ncaller: Hey Frosty, my name is Tom from Sydney.\nfrosty: Hi Tom from Sydney! What's on your wish list?\ncaller: I'd like a lola droid and a spiderman playset! \nfrosty: Excellent choices, Tom! I'll pass this on to Santa. Ho-ho-ho!","name":"Tom","location":"Sydney","toy_list":["Star Wars LOLA animatronic droid","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Hello, it's Frosty! What's your name, little one?\ncaller: Hi Frosty, I'm Emma.\nfrosty: Nice to meet you, Emma! What's your location?\ncaller: I'm in London, Frosty.\nfrosty: What would be your wished toy?\ncaller: I would like the new barbie dreamhouse and a bluey car, Frosty.\nfrosty: Noted! I hope you have a magical Christmas Emma!","name":"Emma","location":"London","toy_list":["Barbie Dreamhouse 2023","Bluey Convertible and Figures"]}
{"transcript":"frosty: Hello! What's your name and what's on your wish list?\ncaller: Hi Frosty! I'm Eli from Toronto and I want an elmo plushie.\nfrosty: Nice to meet you, Eli! Elmo plushie, got it! Have a wonderful holiday!","name":"Eli","location":"Toronto","toy_list":["Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Merry Christmas! Who's ready to give me their wish list?\ncaller: Hi Frosty, I'm Mia!\nfrosty: Hi Mia! Where are you calling from?\ncaller: I'm calling from Los Angeles.\nfrosty: What wonderful toys are you wishing for?\ncaller: I'm hoping for the gabby dollhouse.\nfrosty: That sounds fun! Keep up the good work and Merry Christmas Mia!","name":"Mia","location":"Los Angeles","toy_list":["Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Ho-ho-ho! Who is calling the North Pole?\ncaller: My name is Ethan and I live in Wellington. \nfrosty: Hi Ethan! And what would you like Santa to bring you this year?\ncaller: I would love a pokemon plushie!\nfrosty: That's a great choice! Keep being good Ethan!","name":"Ethan","location":"Wellington","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Frosty here! Who's excited for Christmas?\ncaller: Hi Frosty, I am Ava.\nfrosty: Hi Ava! Where are you sharing the Christmas joy?\ncaller: From Auckland, New Zealand.\nfrosty: Neat! So, what can I jot down for your wish?\ncaller: I'm hoping for a robot dog.\nfrosty: Good choice Ava, fingers crossed for you!","name":"Ava","location":"Auckland","toy_list":["Dog-E"]}
{"transcript":"frosty: Ho-ho-ho! Frosty speaking! What's your name, kiddo?\ncaller: Hi Frosty! I'm Jack and I want magic microscope.\nfrosty: Hi Jack! That sounds educational! Where are you calling from?\ncaller: I'm from Cape Town.\nfrosty: As you wish! Stay wonderful Jack!","name":"Jack","location":"Cape Town","toy_list":["LeapFrog Magic Adventures Microscope"]}
{"transcript":"frosty: Frosty here to take wish lists! What's your name?\ncaller: Hi Frosty, I'm Lucy!\nfrosty: Well hello there, Lucy! Where are you ringing from?\ncaller: I'm from Vancouver, Frosty.\nfrosty: What toys would you like to see under the tree?\ncaller: Well, I'm hoping for a lego olivia's space set.\nfrosty: What a wonderful choice, Lucy! I hope Santa heard that! Merry Christmas!","name":"Lucy","location":"Vancouver","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Hi, it's Frosty! Can I have your name and holiday wish?\ncaller: Hello, Frosty! I'm Oliver and I would love to have a fingerlings monkey.\nfrosty: Hi Oliver! That's an adorable choice! Where are you calling from?\ncaller: I'm calling from Dublin.\nfrosty: Noted, Oliver! Keep waiting for the Christmas magic!","name":"Oliver","location":"Dublin","toy_list":["Fingerlings"]}
{"transcript":"frosty: Hi there! I'm Frosty. What's your name?\ncaller: I'm Lucy.\nfrosty: Hi, Lucy! Where are you calling from?\ncaller: I'm calling from London.\nfrosty: Wow, London! Great to meet you, Lucy. What present can I add to your wish list?\ncaller: I would like a pokemon plushie and little pets surprise.\nfrosty: Perfect choices, Lucy! I have added a Pokémon 8-Inch Plush First Partner Three-Pack and a Little Live Pets Mama Surprise to your wish list. You'll have so much fun when they arrive! Thanks for your call Lucy, and keep your fingers crossed!","name":"Lucy","location":"London","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Little Live Pets Mama Surprise"]}
{"transcript":"frosty: Hello there, young friend! What's your name?\ncaller: Hi Frosty, I'm Max and I live in Sydney.\nfrosty: Hi Max from Sydney! What fantastic gifts can I add to your wish list?\ncaller: I would like the new barbie dreamhouse.\nfrosty: The Barbie Dreamhouse 2023! Amazing choice Max! Hopefully, we can make that dream come true. Have a great day!","name":"Max","location":"Sydney","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Ho Ho Ho! Who am I speaking with today?\ncaller: My name is Harry.\nfrosty: It's lovely to meet you, Harry! Where are you calling from?\ncaller: I'm calling from Toronto.\nfrosty: Exciting! And, what is on your wish list this holiday Harry?\ncaller: I want a bluey car and transformers bumblebee.\nfrosty: Bluey Convertible and Figures, and Transformers Rise of the Beasts Beast-Mode Bumblebee! Fantastic choices, Harry! I'll add those to your wish list straight away. Keep being good!","name":"Harry","location":"Toronto","toy_list":["Bluey Convertible and Figures","Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Merry greetings! Who's spreading holiday cheer with me today?\ncaller: Hi, my name is Isabella and I want fingerlings monkey.\nfrosty: Hello, Isabella! Where are you calling from?\ncaller: I am from New York.\nfrosty: New York, amazing! I have added Fingerlings to your wish list. Keep wishing and believe Isabella!","name":"Isabella","location":"New York","toy_list":["Fingerlings"]}
{"transcript":"frosty: Hello dear child! What's your name?\ncaller: I'm Oliver, from Auckland.\nfrosty: Hello Oliver, from Auckland! What would you like for the holidays?\ncaller: Can I have the gabby dollhouse, please?\nfrosty: Gabbys Dollhouse Cruise Ship, what a grand choice Oliver! I've added that to your wish list. Keep hoping!","name":"Oliver","location":"Auckland","toy_list":["Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Hi there! Who am I speaking with today?\ncaller: My name is Charlotte.\nfrosty: Hi Charlotte! Where are you calling from?\ncaller: I'm in Melbourne.\nfrosty: Marvelous Melbourne! So, Charlotte, what's on your wish list?\ncaller: I would like the elmo plushie for Christmas.\nfrosty: Sesame Street Monster Meditation Elmo it is, Charlotte! I hope your wishes come true!","name":"Charlotte","location":"Melbourne","toy_list":["Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Hello my friend! What is your name?\ncaller: I'm Sophia. I would like the mickey playset.\nfrosty: Hi Sophia! Where are you calling from?\ncaller: I'm from Ottawa.\nfrosty: Ottawa! Got it. I'm adding the Fisher-Price Little People Mickey and Friends Playset to your wish list. Keep dreaming positively, Sophia!","name":"Sophia","location":"Ottawa","toy_list":["Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Hello! What's your name, young friend?\ncaller: My name is Noah and I live in Dublin.\nfrosty: Hi Noah! Great to have you on the line! What is your holiday wish?\ncaller: I would like the jurassic world dinosaur, please!\nfrosty: Jurassic World Dominion Super Colossal Giganotosaurus, wow! I've added it to your wish list Noah. Keep believing in magic!","name":"Noah","location":"Dublin","toy_list":["Jurassic World Dominion Super Colossal Giganotosaurus"]}
{"transcript":"frosty: Ho Ho Ho! Who am I speaking with today?\ncaller: You're speaking with Mia!\nfrosty: Hello Mia! And where are you calling from?\ncaller: From Wellington. Can I have the lego olivia's space set?\nfrosty: Wellington! How wonderful. Lego Friends Olivia's Space Academy has now been added to your wish list, Mia! Keep your hopes high and fingers crossed!","name":"Mia","location":"Wellington","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Hi there! What's your name?\ncaller: I'm Liam from Cardiff and I want the furby.\nfrosty: Hello Liam from Cardiff! I've added Furby interactive plush toy to your wish list. May all your wishes come true!","name":"Liam","location":"Cardiff","toy_list":["Furby interactive plush toy"]}
{"transcript":"frosty: Ho Ho Ho! Hello there, young caller! How may Frosty assist you today? caller: Hi Frosty, I'm John from New York and I want the furby. frosty: Hello, John from New York. A furby, oh how splendid! Is there anything else on your wish list? caller: No, that's it! frosty: Thank you, John! Have a magical festive season.","name":"John","location":"New York","toy_list":["Furby interactive plush toy"]}
{"transcript":"frosty: Merry greetings! What can Frosty do for you? caller: Hi, I'm Lucy. frosty: Hi Lucy! It's lovely to meet you. Where are you calling from? caller: I'm calling from London. frosty: Lovely, Lucy! What would you like for the holidays? caller: Can I have the bitzee pet? frosty: Absolutely, Lucy! Bitzee pet it is. Merry Christmas!","name":"Lucy","location":"London","toy_list":["Bitzee interactive pet"]}
{"transcript":"frosty: Season's greetings! Who do we have here today? caller: I'm Tom, and I live in Sydney. Can I get the bluey playhouse, please? frosty: Nice to meet you, Tom from Sydney! The bluey playhouse is a great choice! Wish you a snowy Christmas!","name":"Tom","location":"Sydney","toy_list":["Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"frosty: Ho Ho Ho! Who's excited for Christmas? caller: I am! It's Emily here. frosty: Hi Emily! Where are you calling from? caller: From Brisbane. frosty: Beautiful Brisbane! Emily, what do you want this Christmas? caller: I want a baby bee doll and a gabby dollhouse. frosty: Very well, Emily! Your wish is my command. Merry Christmas, and may your dreams come true!","name":"Emily","location":"Brisbane","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Hello! Frosty wishes you a Merry Christmas! Who's calling? caller: My name's Ryan. frosty: Hey, Ryan! And where are you calling from? caller: I'm from Toronto. frosty: Beautiful Toronto! So, Ryan, what do you want for Christmas? caller: Can I get the lego olivia's space set and the transformers bumblebee? frosty: Of course, Ryan! Your wish has been heard. Have a magical Christmas!","name":"Ryan","location":"Toronto","toy_list":["Lego Friends Olivia's Space Academy","Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Welcome to Frosty's North Pole! Who am I talking to? caller: Hey Frosty, it's Lily from Auckland. I'd love the fox plushie this year. frosty: Wonderful to hear from you, Lily from Auckland. The 2023 Holiday Fox 12-Inch Plush is an excellent choice! Have a jolly Christmas!","name":"Lily","location":"Auckland","toy_list":["2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"frosty: Ho Ho Ho! Frosty's listening! Who's sharing their Christmas wish today? caller: Hi Frosty, I'm Jack from Wellington. I would like to have the spiderman playset. frosty: Hello, Jack from Wellington! The Marvel's Spidey and His Amazing Friends Web Spinners playset it is! Have a magical Christmas!","name":"Jack","location":"Wellington","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Season's greetings! What delightful child do we have here? caller: Hello, I'm Zoe. frosty: Hi Zoe! Where are you calling from? caller: I'm calling from Edinburgh. frosty: Lovely, Zoe! What will make your Christmas more magical? caller: Can I have the magna tiles set, please? frosty: Absolutely, Zoe! Your wish is my command! Merry Christmas!","name":"Zoe","location":"Edinburgh","toy_list":["Magna-Tiles 32-piece set"]}
{"transcript":"frosty: Hello there, my young friend! How can I make your Christmas special this year? caller: Hi Frosty, I'm Ethan from Dublin. frosty: Hi Ethan! What would you like this Christmas? caller: I would like the robot dog and the candy vending machine. frosty: Wonderful choices, Ethan! Merry Christmas, and may your wishes come true!","name":"Ethan","location":"Dublin","toy_list":["Dog-E","Thames & Kosmos Candy Vending Machine STEM experiment kit"]}
{"transcript":"frosty: Ho! Ho! Ho! Who's next on the magical list? caller: Hi Frosty, I'm Bella from Liverpool. Can I have the dinosaur and the furby, please? frosty: Hi Bella from Liverpool! A Jurassic World Dominion Super Colossal Giganotosaurus and a Furby, splendid choices! Have a wonderfully merry Christmas!","name":"Bella","location":"Liverpool","toy_list":["Jurassic World Dominion Super Colossal Giganotosaurus","Furby interactive plush toy"]}
{"transcript":"frosty: Ho, ho, ho, hello little buddy! How can Frosty the voice bot assist with your holiday wish this year? \ncaller: Hi Frosty! I’m Sam. \nfrosty: Hey Sam! Where are you joining us from? \ncaller: From Dallas, Texas. \nfrosty: Oh, that's way down south! What would you like for Christmas, Sam? \ncaller: Can I get a trasformers bumblebee please? \nfrosty: A Transformers Rise of the Beasts Beast-Mode Bumblebee, that sounds wonderfully festive! Surely, Santa will look into it. Don’t forget to be good, Sam! Bye, and happy holidays!","name":"Sam","location":"Dallas, Texas","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Hi there, who's ready to spread some holiday cheer? \ncaller: Hello Frosty, I’m Lily from New York City. \nfrosty: Hi Lily from the big apple! What's on your holiday wish list? \ncaller: This year I want the new barbie dreamhouse and a furby. \nfrosty: Barbie Dreamhouse 2023 and a Furby interactive plush toy, very merry choices! I’m sure Santa will be excited to hear. Stay cheerful, Lily!","name":"Lily","location":"New York City","toy_list":["Barbie Dreamhouse 2023","Furby interactive plush toy"]}
{"transcript":"frosty: Ho ho ho! Who am I speaking with today? \ncaller: Hi Frosty! I'm Jake, and I would like a bluey car and a gabby dollhouse. \nfrosty: Hi Jake! Are you calling from afar or close by? \ncaller: I’m calling from Sydney. \nfrosty: Wow, Sydney! Your Bluey Convertible and Figures and Gabbys Dollhouse Cruise Ship will travel a long way! Santa will make note. Stay jolly, Jake!","name":"Jake","location":"Sydney","toy_list":["Bluey Convertible and Figures","Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Merry greetings! Who's excited for Christmas? \ncaller: Hi Frosty, I’m Sarah. \nfrosty: Well, hello Sarah! Where are you celebrating Christmas? \ncaller: I’m in San Francisco. \nfrosty: Beautiful city! So, Sarah what do you wish for this Christmas? \ncaller: Please can I have the spiderman playset? \nfrosty: A Marvel's Spidey and His Amazing Friends Web Spinners playset. What an awesome choice! Santa will be informed. Be good, Sarah!","name":"Sarah","location":"San Francisco","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Hello, who will I be helping with their holiday wish list today? \ncaller: My name is Benjamin from Birmingham. \nfrosty: Wonderful to speak to you, Benjamin! What gifts are you hoping for? \ncaller: Can I get the snap circuit set and bitzee pet? \nfrosty: Snap Circuits: Junior and Bitzee interactive pet, fantastic! Santa will appreciate your thoughtful choices. Seasons greetings, Benjamin!","name":"Benjamin","location":"Birmingham","toy_list":["Snap Circuits: Junior","Bitzee interactive pet"]}
{"transcript":"frosty: Hello, wonderful child, ready to make your Christmas wish? \ncaller: Yes, Frosty, I am. I’m Ava. \nfrosty: Ava, that's a lovely name! Where are you calling from Ava? \ncaller: I'm calling from Vancouver. \nfrosty: That's cool! What gifts are you hoping for Ava? \ncaller: I'd love to get a fingerlings monkey. \nfrosty: A Fingerlings, what a delightful choice! Santa will be notified. Best holiday wishes Ava!","name":"Ava","location":"Vancouver","toy_list":["Fingerlings"]}
{"transcript":"frosty: Ho ho ho! Who's looking forward to a holly jolly Christmas?  \ncaller: Frosty, it’s Jack. I need the magic microscope. \nfrosty: Jack, great to hear from you! Where are you calling from?  \ncaller: Melbourne, Frosty. \nfrosty: Fantastic, Melbourne! LeapFrog Magic Adventures Microscope it is, Jack! Santa will make a note. Happy holidays!","name":"Jack","location":"Melbourne","toy_list":["LeapFrog Magic Adventures Microscope"]}
{"transcript":"frosty: Hello, who's ready to share their Christmas wish? \ncaller: Hi, I’m Grace from Seattle. \nfrosty: Hi Grace! What's on your wish list this year? \ncaller: I’d love a pokemon plushie and the elmo plushie. \nfrosty: Pokémon 8-Inch Plush First Partner Three-Pack and Sesame Street Monster Meditation Elmo, fun and cuddly. Santa will do his best, Grace! Merry Christmas!","name":"Grace","location":"Seattle","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Merry greetings! Who’s calling Frosty today? \ncaller: It’s Mia, and I’m hoping for the candy vending machine and jurassic world dinosaur. \nfrosty: Mia, hello! Where is Santa delivering these gifts to? \ncaller: To Phoenix, Arizona!<br>frosty: That's great, Mia! Thames & Kosmos Candy Vending Machine STEM experiment kit and Jurassic World Dominion Super Colossal Giganotosaurus will be noted down. Have a magical Christmas!","name":"Mia","location":"Phoenix, Arizona","toy_list":["Thames & Kosmos Candy Vending Machine STEM experiment kit","Jurassic World Dominion Super Colossal Giganotosaurus"]}
{"transcript":"frosty: Ho ho ho! What's your name, little one? \ncaller: I'm Noah. \nfrosty: Nice to meet you, Noah! Where are you calling from? \ncaller: I'm calling from Toronto, Frosty. \nfrosty: How splendid! Toronto! What would you like this Christmas, Noah? \ncaller: I would like a robot dog. \nfrosty: A Dog-E, what a neat choice! Santa has been notified, Noah! Enjoy the festive season!","name":"Noah","location":"Toronto","toy_list":["Dog-E"]}
{"transcript":"Frosty: Hello! I'm Frosty, your cheerful voice bot. How can I assist you this lovely holiday season?\nCaller: Hi Frosty, I'm Emma. I live in Sydney.\nFrosty: Nice to meet you Emma from Sydney. How can I brighten your holidays?\nCaller: Can I have the new barbie dreamhouse and a furby please?\nFrosty: Of course, Emma! We've got both the Barbie Dreamhouse 2023 and the Furby interactive plush toy on your list. That's going to be a fantastic holiday package for you, Emma.","name":"Emma","location":"Sydney","toy_list":["Barbie Dreamhouse 2023","Furby interactive plush toy"]}
{"transcript":"Frosty: Merry Holiday! I'm Frosty. May I know who I'm speaking with?\nCaller: I'm Adam.\nFrosty: Nice to meet you, Adam. Where are you calling from?\nCaller: From Toronto.\nFrosty: Great! What would you like for the holidays, Adam?\nCaller: I want the pokemon plushie and bluey car.\nFrosty: Wonderful, Adam. We'll note down the Pokémon 8-Inch Plush First Partner Three-Pack and the Bluey Convertible and Figures for you! They are fantastic choices!","name":"Adam","location":"Toronto","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Bluey Convertible and Figures"]}
{"transcript":"Frosty: Seasons greetings! I'm Frosty, your friendly voice bot. What's your name?\nCaller: I'm Jacob.\nFrosty: Hello, Jacob! Where are you calling from?\nCaller: I'm calling from Los Angeles.\nFrosty: That's wonderful! How may I assist you, Jacob?\nCaller: I was wondering if I could get the spiderman playset.\nFrosty: Absolutely, Jacob! We've got the Marvel's Spidey and His Amazing Friends Web Spinners playset waiting for you. Have a fantastic holiday ahead, Jacob.","name":"Jacob","location":"Los Angeles","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"Frosty: Hey there, happy holidays! I'm Frosty. May I know your name?\nCaller: I'm Lucy from Manchester.\nFrosty: Wonderful, Lucy from Manchester! What would you like for the holidays?\nCaller: furby would be great, thank you.\nFrosty: Noted, Lucy. The Furby interactive plush toy will be on your holiday list. Have the most amazing holidays ahead!","name":"Lucy","location":"Manchester","toy_list":["Furby interactive plush toy"]}
{"transcript":"Frosty: Hello! I'm Frosty. Who do I have the pleasure of speaking with today?\nCaller: My name's Oliver. I would like the lego olivia's space set for my gift. \nFrosty: Oliver, that's a top-notch choice! The Lego Friends Olivia's Space Academy will be under your tree! Can you tell me where you're calling from?\nCaller: I'm calling from Wellington, New Zealand.\nFrosty: Great, thank you, Oliver. Wishing you out-of-this-world holidays with your new Lego set!","name":"Oliver","location":"Wellington","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"Frosty: Merry Holiday! I'm Frosty. Who's there with me in this delightful holiday mood?\nCaller: I'm Sophia. \nFrosty: Hi Sophia! How can I help you this holiday season? \nCaller: I want furby and candy vending machine. \nFrosty: Sophia, we have your Furby interactive plush toy and your Thames & Kosmos Candy Vending Machine STEM experiment kit on the list. Wishing you a sweet holiday adventure ahead!","name":"Sophia","location":"","toy_list":["Furby interactive plush toy","Thames & Kosmos Candy Vending Machine STEM experiment kit"]}
{"transcript":"Frosty: Seasons greetings! This is Frosty. May I have your name, please?\nCaller: I'm Leo from New York, and I want the jurassic world dinosaur and fox plushie as my gifts. \nFrosty: That's great, Leo from New York! You'll get the Jurassic World Dominion Super Colossal Giganotosaurus and the 2023 Holiday Fox 12-Inch Plush. These will surely add a fun twist to your holidays!","name":"Leo","location":"New York","toy_list":["Jurassic World Dominion Super Colossal Giganotosaurus","2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"Frosty: Hello, happy holidays! I'm Frosty, your voice bot. May I know your name?\nCaller: I'm Alice.\nFrosty: Nice to meet you, Alice. Where are you calling from?\nCaller: From Birmingham.\nFrosty: Great, Alice from Birmingham. What would be on your holiday wish list?\nCaller: I want baby bee doll.\nFrosty: That's a sweet choice, Alice! The Orijin Bees Lovey Coiley Baby Bee makes for a perfect holiday gift! Enjoy your holidays!","name":"Alice","location":"Birmingham","toy_list":["Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"Frosty: Hi! You're speaking with Frosty. What's your name?\nCaller: I'm Mia, and I love Magna Tiles. Can I have the magna tiles set, please?\nFrosty: Certainly, Mia! Where are you calling from?\nCaller: I'm from Sydney.\nFrosty: Terrific! We've got the Magna-Tiles 32-piece set ready for you, Mia from Sydney. Wishing you a bright and creative holiday season!","name":"Mia","location":"Sydney","toy_list":["Magna-Tiles 32-piece set"]}
{"transcript":"Frosty: Hi there, holiday greetings! This is Frosty. Could you tell me your name?\nCaller: I'm Noah, from Vancouver.\nFrosty: Hi Noah, from Vancouver! How can I brighten up your holiday?\nCaller: Can I get the transformers bumblebee, please?\nFrosty: Of course, Noah! We'll have the Transformers Rise of the Beasts Beast-Mode Bumblebee ready for you. It's going to buzz up your holidays!","name":"Noah","location":"Vancouver","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Ho ho ho! Hello there, who am I speaking with today?\ncaller: Hi Frosty! My name is Emma and I am from Seattle.\nfrosty: Wonderful, Emma from Seattle! How old are you?\ncaller: I'm 7.\nfrosty: What marvelous things would you like for the holidays, Emma?\ncaller: I want a furby and a pokemon plushie.\nfrosty: Excellent choices, Emma! Have a merry holiday!","name":"Emma","location":"Seattle","toy_list":["Furby interactive plush toy","Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Ho ho ho! Who's ready to share their holiday wishes with Frosty?\ncaller: I am! My name is Ethan.\nfrosty: Pleasure to meet you, Ethan! Where are you calling from?\ncaller: I'm calling from Glasgow.\nfrosty: Perfect, Ethan! What would you like for the holidays?\ncaller: Can I have a spiderman playset?\nfrosty: Certainly, Ethan! Keep being good! Happy holidays!","name":"Ethan","location":"Glasgow","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Ho ho ho! Who's excited for the holidays?\ncaller: Me! I'm Lucy, and I'm from Houston.\nfrosty: Lovely Lucy from Houston! What's your holiday wish?\ncaller: I want a barbie science doll set!\nfrosty: A wonderful choice, Lucy! Have a joyful holiday!","name":"Lucy","location":"Houston","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Ho ho ho! Who am I chatting to today?\ncaller: Hey Frosty, it's Jackson.\nfrosty: Hello, Jackson! Where are you calling from?\ncaller: I'm from Ottawa.\nfrosty: Great to hear from you, Jackson! What's on your holiday wish list?\ncaller: I'd like a lego olivia's space set, please.\nfrosty: You've got it, Jackson! Have a lovely holiday!","name":"Jackson","location":"Ottawa","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Ho ho ho! Who's ready to tell Frosty their holiday wishes?\ncaller: Hi Frosty, I'm Amelia.\nfrosty: Wonderful to meet you, Amelia! Where are you calling from?\ncaller: I'm in Auckland, New Zealand.\nfrosty: Fantastic, Amelia! What's your holiday wish?\ncaller: I want the new barbie dreamhouse and a baby bee doll.\nfrosty: We got it, Amelia! Have a fantastic holiday!","name":"Amelia","location":"Auckland","toy_list":["Barbie Dreamhouse 2023","Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"frosty: Ho ho ho! Who's next to share their holiday wishes with Frosty?\ncaller: Me, I'm Liam.\nfrosty: Pleased to meet you, Liam! From where are you calling?\ncaller: From Toronto, Canada.\nfrosty: Fantastic, Liam! What's on your holiday wish list?\ncaller: I would love a transformers bumblebee.\nfrosty: Noted! Have a splendid holiday, Liam!","name":"Liam","location":"Toronto","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Ho ho ho! Who is excited to share their holiday wishes?\ncaller: Frosty, it's Amelia, I am from London.\nfrosty: Hello again, Amelia in London! What is your wish this time?\ncaller: I would love a bluey car.\nfrosty: Excellent choice, Amelia! Have a merry holiday!","name":"Amelia","location":"London","toy_list":["Bluey Convertible and Figures"]}
{"transcript":"frosty: Ho ho ho! Who wants to tell Frosty their holiday wishes?\ncaller: Me! My name's Ethan, and I want a mickey playset.\nfrosty: Hello again, Ethan! Where are you calling from?\ncaller: I'm from Dublin, Ireland.\nfrosty: Wonderful, Ethan! Your wish is noted. Happy holidays!","name":"Ethan","location":"Dublin","toy_list":["Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Ho ho ho! Who's next to share their holiday wishes with me?\ncaller: Hello Frosty, I'm Charlotte. I'm calling you from Brisbane.\nfrosty: Delighted to meet you, Charlotte! What's your holiday wish?\ncaller: I want a baby bee doll and a fingerlings monkey.\nfrosty: Noted, Charlotte! Have a delightful holiday!","name":"Charlotte","location":"Brisbane","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Fingerlings"]}
{"transcript":"frosty: Ho ho ho! Who am I speaking with today?\ncaller: Hi Frosty! My name is Benjamin.\nfrosty: Nice to meet you, Benjamin! Where are you calling from?\ncaller: I'm calling from Melbourne, Australia.\nfrosty: Great, Benjamin! And what would you like for the holidays?\ncaller: Can I have a fort building kit?\nfrosty: Certainly, Benjamin! Keep being good! Happy holidays!","name":"Benjamin","location":"Melbourne","toy_list":["Tiny Land kids fort building kit"]}
{"transcript":"Frosty: Hi there, little one! It's your friendly Frosty on the line. Who am I talking to? \nCaller: Hi Frosty, it's Sarah.\nFrosty: Nice to meet you, Sarah! Where are you calling from, sweetie?\nCaller: I'm from New York.\nFrosty: Wow, New York! Now, what's on your holiday wish list this year, Sarah?\nCaller: I want the lola droid and the magnetics set.\nFrosty: Star Wars LOLA animatronic droid and Magna-Tiles 32-piece set, you got it. Thank you!","name":"Sarah","location":"New York","toy_list":["Star Wars LOLA animatronic droid","Magna-Tiles 32-piece set"]}
{"transcript":"Frosty: Hi there, little buddy! I'm your jolly friend Frosty. What's your name?\nCaller: Hi, I'm Timmy.\nFrosty: Hi, Timmy! Can I know where you are calling from today?\nCaller: I'm from Sydney.\nFrosty: Sydney, that's a great city! Tell me, Timmy, what holiday gifts are you hoping for?\nCaller: I want trasformers bumblebee, please.\nFrosty: Transformers Rise of the Beasts Beast-Mode Bumblebee, sure thing Timmy! Can't wait to see you on Christmas Eve!","name":"Timmy","location":"Sydney","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"Frosty: Hello! This is Frosty speaking. May I know who's excited for gifts?\nCaller: Hi, Frosty! I'm Lily.\nFrosty: Lovely Lily, where are you from?\nCaller: I'm from Toronto, Canada.\nFrosty: Oh, Canada! So Lily, ready to share your holiday wish?\nCaller: I want the bluey car and elmo plushie.\nFrosty: Bluey Convertible and Figures and Sesame Street Monster Meditation Elmo it is. Thanks for calling, Lily!","name":"Lily","location":"Toronto, Canada","toy_list":["Bluey Convertible and Figures","Sesame Street Monster Meditation Elmo"]}
{"transcript":"Frosty: Hi, kiddo! Frosty here, who do I have the pleasure of talking to?\nCaller: Hi Frosty, I'm Benny.\nFrosty: Hello, Benny! Where should Frosty send your gifts to?\nCaller: I'm from London, England.\nFrosty: Oh, London! Benny, what gifts from Frosty are you looking forward to this year?\nCaller: I would like the baby bee doll, please!\nFrosty: Orijin Bees Lovey Coiley Baby Bee, noted Benny. Keep an eye on your socks, okay? Ho! Ho! Ho!","name":"Benny","location":"London, England","toy_list":["Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"Frosty: Hello, who do I have on the line? Frosty wants to know your name!\nCaller: It's Olivia.\nFrosty: Olivia, great! Where are you located, Olivia?\nCaller: I'm from Wellington, New Zealand.\nFrosty: Oh, New Zealand. That's exciting! Olivia, let's hear your toy wish list! \nCaller: I want the fox plushie.\nFrosty: 2023 Holiday Fox 12-Inch Plush, you got it! Thank you, Olivia!","name":"Olivia","location":"Wellington, New Zealand","toy_list":["2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"Frosty: Ho, ho, ho! It's Frosty. Could I have your name, please?\nCaller: My name is Henry.\nFrosty: Henry, right! Now, Henry, where are you calling from?\nCaller: I'm in Dublin, Ireland.\nFrosty: All the way in Ireland! That's far. Henry, share with Frosty your Christmas wish list.\nCaller: I want the ninja turtles delivery van.\nFrosty: Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van coming up, Henry. Merry Christmas!","name":"Henry","location":"Dublin, Ireland","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"Frosty: Hi, friend! It's your ol' pal Frosty. What's your name?\nCaller: This is Bella, Frosty.\nFrosty: Bella, wonderful! Could you tell Frosty where you're from?\nCaller: I'm calling from Los Angeles.\nFrosty: Oh, sunny LA! Bella, what are you looking forward to this Christmas, any toy wishes?\nCaller: I want the barbie dreamhouse and barbie science doll set.\nFrosty: Barbie Dreamhouse 2023 and Barbie Science Lab Playset, got it! Keep being a good girl, Bella!","name":"Bella","location":"Los Angeles","toy_list":["Barbie Dreamhouse 2023","Barbie Science Lab Playset"]}
{"transcript":"Frosty: Hello! Frosty here. What's your name, darling?\nCaller: Hi Frosty! I'm Millie.\nFrosty: Millie... got it! Millie, could you share where you are this lovely day?\nCaller: I'm in San Francisco.\nFrosty: Sweet! Millie from San Francisco. What's your toy wish this holiday season?\nCaller: I want the furby and bitzee pet.\nFrosty: A Furby interactive plush toy, and a Bitzee interactive pet coming your way, Millie! Merry Christmas!","name":"Millie","location":"San Francisco","toy_list":["Furby interactive plush toy","Bitzee interactive pet"]}
{"transcript":"Frosty: Hi, kiddo! Who's talking to Frosty today? \nCaller: It's Jake.\nFrosty: Hi, Jake! Where are you this jolly time, Jake?\nCaller: I'm in Chicago.\nFrosty: Chicago, got it! So, Jake, what gifts are you hoping for this holiday season?\nCaller: May I have the slime kit, please?\nFrosty: National Geographic Mega Slime Kit & Putty Lab coming up! Make sure to clean up your mess, alright, Jake?","name":"Jake","location":"Chicago","toy_list":["National Geographic Mega Slime Kit & Putty Lab"]}
{"transcript":"Frosty: Hello, little one! Frosty's here. Who am I talking to?\nCaller: I’m Hannah, Frosty.\nFrosty: Beloved Hannah, where do you live?\nCaller: I'm from Edinburgh.\nFrosty: Hannah from Edinburgh, perfect! And what does Hannah want for Christmas?\nCaller: I want the new barbie dreamhouse!\nFrosty: Barbie Dreamhouse 2023 it is, Hannah. Happy Holidays, dear!","name":"Hannah","location":"Edinburgh","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Hello there! Merry Christmas! May I know who I'm chatting with today?\ncaller: Hi, I'm Alexander from New York.\nfrosty: Nice to meet you, Alexander from New York! What age are you turning this year?\ncaller: I'm 8 years old.\nfrosty: That's fantastic! Now, would you tell me what you have on your wish list for this holiday season?\ncaller: I want the trasformers bumblebee and fox plushie.\nfrosty: That's amazing! Transformers Rise of the Beasts Beast-Mode Bumblebee and 2023 Holiday Fox 12-Inch Plush. They are really cool! Happy holidays, Alexander. Stay hopeful, and keep believing in magic!","name":"Alexander","location":"New York","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"frosty: Ho Ho Ho! Merry Christmas! Who am I speaking to today?\ncaller: Hi frosty, I'm Lucy.\nfrosty: Hello, Lucy! Which city are you calling from?\ncaller: London.\nfrosty: Jolly good, Lucy from London! How old are you?\ncaller: I'm 6!\nfrosty: Splendid! What's on your wish list?\ncaller: I would like furby and magna tiles set.\nfrosty: Furby interactive plush toy and Magna-Tiles 32-piece set! That sounds exciting. Wish you a merry Christmas, Lucy! Santa will hear about your wishes.","name":"Lucy","location":"London","toy_list":["Furby interactive plush toy","Magna-Tiles 32-piece set"]}
{"transcript":"frosty: Greetings and merry Christmas! May I know your name?\ncaller: Hey, I'm Jack.\nfrosty: Howdy, Jack! From where are you calling?\ncaller: I'm from Sydney.\nfrosty: Jack from Sydney, nice! How old you will be on your next birthday?\ncaller: I will be 9.\nfrosty: Great! What's in your toy wish list this Christmas?\ncaller: I want lego olivia's space set and spiderman playset.\nfrosty: Lego Friends Olivia's Space Academy and Marvel's Spidey and His Amazing Friends Web Spinners playset, excellent choices, Jack! Merry Christmas, and may your wishes come true!","name":"Jack","location":"Sydney","toy_list":["Lego Friends Olivia's Space Academy","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Ho Ho Ho! May I ask who's there?\ncaller: Hey, I'm Emily and I want the elmo plushie.\nfrosty: Hello, Emily! Sesame Street Monster Meditation Elmo is a great choice. Can you tell me where are you from?\ncaller: I'm from Toronto.\nfrosty: Emily from Toronto who loves Elmo, noted! How old are you?\ncaller: I'm 7 years old.\nfrosty: Sweet Emily, you're growing up so fast! Merry Christmas and stay excited for your Sesame Street Monster Meditation Elmo!","name":"Emily","location":"Toronto","toy_list":["Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Merry Christmas! Who am I speaking with?\ncaller: I'm George from Los Angeles.\nfrosty: Hello George, how old are you my friend?\ncaller: This year, I'll turn 10!\nfrosty: That's a golden age! George, what festive surprises would you like?\ncaller: Well, I think I'd like the new barbie dreamhouse and fingerlings monkey.\nfrosty: Noted! A Barbie Dreamhouse 2023 and Fingerlings. Brilliant choices! Merry Christmas, George. Remember, holidays are a time filled with warmth and joy!","name":"George","location":"Los Angeles","toy_list":["Barbie Dreamhouse 2023","Fingerlings"]}
{"transcript":"frosty: Ho Ho Ho! Who's spreading the Christmas cheer?\ncaller: It's Charlie from London, I would like tiny land kids fort building kit.\nfrosty: Hello there, Charlie! Tiny Land kids fort building kit, yeah? Can you tell me how old are you?\ncaller: I'm 8 years old.\nfrosty: Sounds perfect, Charlie! Hope you have a joyful holiday and plenty of fun building with your Tiny Land kids fort building kit!","name":"Charlie","location":"London","toy_list":["Tiny Land kids fort building kit"]}
{"transcript":"frosty: Merry Christmas! Who do I have the pleasure of speaking to?\ncaller: Hi Frosty, I'm Olivia from Dublin.\nfrosty: Hello, Olivia from Dublin! How old are you?\ncaller: I'm 9 years old.\nfrosty: Fantastic! And what gifts are you hoping for this year?\ncaller: I would like the baby bee doll and snap circuit set.\nfrosty: So, you'd like an Orijin Bees Lovey Coiley Baby Bee and a Snap Circuits: Junior. Amazing choices, Olivia! Keep believing in the magic of Christmas, and your wishes may come true!","name":"Olivia","location":"Dublin","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Snap Circuits: Junior"]}
{"transcript":"frosty: Hi! Who's excited for Christmas?\ncaller: Hello, I'm Amelia from Ottawa.\nfrosty: Lovely to meet you, Amelia from Ottawa! How old might you be?\ncaller: I'm turning 7 this year.\nfrosty: What a great age! So, Amelia, what are you dreaming of finding under the tree this year?\ncaller: I would love to have the pokemon plushie.\nfrosty: Pokémon 8-Inch Plush First Partner Three-Pack! That's an exceptional choice! Santa will be sure to know about this. Have a fantastic Christmas, Amelia!","name":"Amelia","location":"Ottawa","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Ho Ho Ho! Who's ready to share their Christmas wish?\ncaller: My name is Ethan and I would like barbie science doll set.\nfrosty: Wonderful, Ethan! A Barbie Science Lab Playset is an excellent choice. Where are you calling from?\ncaller: I'm calling from Vancouver.\nfrosty: Oh, Ethan from Vancouver, exciting! How old are you?\ncaller: I'm 10 years old.\nfrosty: Barbie Science Lab Playset for our bright 10-year-old from Vancouver. Your wish is heard, Ethan. Always remember, the joy of Christmas is the joy of giving!","name":"Ethan","location":"Vancouver","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Hello! Who's calling into Frosty's Christmas Line?\ncaller: Hi, I'm Sophia from San Francisco.\nfrosty: Nice to meet you Sophia from San Francisco! Can I ask how old you are?\ncaller: I'm 7 years old.\nfrosty: That's wonderful! Sophia, what are your Christmas toy wishes?\ncaller: I want bluey car and mickey playset.\nfrosty: So, that's Bluey Convertible and Figures, and Fisher-Price Little People Mickey and Friends Playset. Fantastic choices, Sophia! Keep the holiday spirit alive and stay excited for a magical Christmas!","name":"Sophia","location":"San Francisco","toy_list":["Bluey Convertible and Figures","Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Hi there! This is Frosty. What's your name? \ncaller: My name is Timmy. \nfrosty: Nice to meet you, Timmy. Where are you calling from? \ncaller: I'm calling from New York City. \nfrosty: That's fantastic, Timmy! Now, what's on your holiday wish list? \ncaller: I want a furby and a baby bee doll. \nfrosty: A Furby interactive plush toy and an Orijin Bees Lovey Coiley Baby Bee, got it! Wishes noted, Timmy. Keep being good! Happy holidays!","name":"Timmy","location":"New York City","toy_list":["Furby interactive plush toy","Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"frosty: Hello! Frosty here. What's your name? \ncaller: I'm Lily. And I want barbie science doll set. \nfrosty: Nice to meet you, Lily. Where are you calling from? \ncaller: From London. \nfrosty: Barbie Science Lab Playset from London, noted. Happy holidays, Lily!","name":"Lily","location":"London","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Hi! Frosty speaking. May I know your name? \ncaller: Hello, I'm Billy. I live in Sydney and I want the trasformers bumblebee. \nfrosty: How lovely, Billy! Transformers Rise of the Beasts Beast-Mode Bumblebee for you. Happy holidays!","name":"Billy","location":"Sydney","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Good day! You're speaking to Frosty. What's your name? \ncaller: I'm Sarah from Toronto. \nfrosty: Hello Sarah! What's your Christmas wish? \ncaller: I'd like the bluey car. \nfrosty: A Bluey Convertible and Figures coming your way. Merry Christmas!","name":"Sarah","location":"Toronto","toy_list":["Bluey Convertible and Figures"]}
{"transcript":"frosty: Hello there! This is Frosty. What's your name? \ncaller: My name is Jonah. \nfrosty: Hello Jonah! Where are you from? \ncaller: I'm from Los Angeles and I want the spiderman playset. \nfrosty: Marvel's Spidey and His Amazing Friends Web Spinners playset for Jonah from LA. Got it! Happy holidays!","name":"Jonah","location":"Los Angeles","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Hi! Frosty here. What's your name? \ncaller: Hi, my name is Ruby. I am calling from Manchester. \nfrosty: Nice to meet you, Ruby! And what's on your holiday wish list? \ncaller: I wish for a lola droid. \nfrosty: Star Wars LOLA animatronic droid it is! Wish granted, Ruby. Happy holidays!","name":"Ruby","location":"Manchester","toy_list":["Star Wars LOLA animatronic droid"]}
{"transcript":"frosty: Good day! This is Frosty. May I know your name? \ncaller: Hey, I'm Matt from Melbourne. I want the furby. \nfrosty: How fantastic, Matt! A Furby interactive plush toy is noted down for you. Merry Christmas!","name":"Matt","location":"Melbourne","toy_list":["Furby interactive plush toy"]}
{"transcript":"frosty: Hi there! It's Frosty, who's speaking? \ncaller: This is Sophie from Boston. \nfrosty: Lovely Sophie, what's your Christmas wish? \ncaller: I want an elmo plushie. \nfrosty: Sesame Street Monster Meditation Elmo for Sophie from Boston, noted! Happy holidays!","name":"Sophie","location":"Boston","toy_list":["Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Hi! Frosty here. What's your name? \ncaller: Hi, I'm Owen. \nfrosty: Pleased to meet you, Owen! Where are you calling from? \ncaller: From Dublin! I would like the new barbie dreamhouse. \nfrosty: Barbie Dreamhouse 2023 for Owen from Dublin. Wishes noted, Merry Christmas!","name":"Owen","location":"Dublin","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Hello! This is Frosty. Who's this? \ncaller: It's Chloe from Vancouver. I want the lego olivia's space set. \nfrosty: Lego Friends Olivia's Space Academy for Chloe from Vancouver, written down! Happy holidays!","name":"Chloe","location":"Vancouver","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"Frosty: Hello there, happy holidays! Could you tell Frosty your name, please?\nCaller: I'm Sammy!\nFrosty: Hi, Sammy! Could I also know where you're calling from?\nCaller: From Toronto!\nFrosty: Brilliant! Now what would you like Santa to bring you this year?\nCaller: A trasformers bumblebee!\nFrosty: A marvelous Transformers Rise of the Beasts Beast-Mode Bumblebee, it is then! I'm sure Santa will be thrilled to hear it.","name":"Sammy","location":"Toronto","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"Frosty: Season's greetings! May I get your name, kiddo?\nCaller: Hi, I'm Lily from Birmingham and I want a barbie science doll set.\nFrosty: Barbie Science Lab Playset, good choice Lily! I bet you'll have tons of fun with that. Keep the holiday spirits high!","name":"Lily","location":"Birmingham","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"Frosty: Ho Ho Ho, Merry Christmas! What's your name, young friend?\nCaller: I'm Noah.\nFrosty: Hello, Noah! Where are you calling from?\nCaller: From Auckland!\nFrosty: Lovely, Noah! So, what's on your wish list this year?\nCaller: I want the bluey playhouse!\nFrosty: The Bluey Ultimate Lights and Sounds playhouse, an excellent pick! I hope Santa brings it to you.","name":"Noah","location":"Auckland","toy_list":["Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"Frosty: Warm holiday wishes! Can you tell me your name, darling?\nCaller: Hi, I'm Molly from Sydney and I wish for the new barbie dreamhouse.\nFrosty: The Barbie Dreamhouse 2023, fantastic choice Molly! You're going to find it under the tree for sure!","name":"Molly","location":"Sydney","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"Frosty: Yoo-hoo, Season's greetings! Who do I have the pleasure of speaking with today?\nCaller: I'm Jake!\nFrosty: Hi Jake, it's nice to meet you! And, where are you calling from?\nCaller: From Los Angeles!\nFrosty: That's great, Jake! May I know what Santa should bring you this year?\nCaller: A furby.\nFrosty: A Furby interactive plush toy, cool! Hang tight, your wish will come true!","name":"Jake","location":"Los Angeles","toy_list":["Furby interactive plush toy"]}
{"transcript":"Frosty: Merry greetings! May I kindly know your name?\nCaller: Hi, I'm Rosie from Toronto, and I want a fox plushie.\nFrosty: A 2023 Holiday Fox 12-Inch Plush, it is then Rosie! Santa is going to love your choice!","name":"Rosie","location":"Toronto","toy_list":["2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"Frosty: Merry Christmas, little friend! Could you tell me your name?\nCaller: I'm Abe!\nFrosty: Hello, Abe! And, where are you calling from?\nCaller: From Manchester!\nFrosty: Fantastic! Now, what would you like from Santa this year?\nCaller: A robot dog please!\nFrosty: A Dog-E, caught it! Santa is already packing it for you.","name":"Abe","location":"Manchester","toy_list":["Dog-E"]}
{"transcript":"Frosty: Hi there, happy yuletide! Who's on the line?\nCaller: I'm Bella from Wellington, and my wish is the pokemon plushie.\nFrosty: Pokémon 8-Inch Plush First Partner Three-Pack, that's an awesome choice Bella! Comfort and joy to your holidays.","name":"Bella","location":"Wellington","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"Frosty: Ho Ho Ho, who am I speaking with today?\nCaller: I'm Ethan.\nFrosty: Hi, Ethan! Can you tell me where you're calling from?\nCaller: From Ottawa!\nFrosty: Nice! And what toys would you like from Santa this year?\nCaller: I want the mickey playset and the fingerlings monkey.\nFrosty: Perfect, the Fisher-Price Little People Mickey and Friends Playset and a Fingerlings! Santa will note that.","name":"Ethan","location":"Ottawa","toy_list":["Fisher-Price Little People Mickey and Friends Playset","Fingerlings"]}
{"transcript":"Frosty: Yuletide greetings! What's your name, sweetie?\nCaller: Hi Frosty, I'm Lea from Leeds and I want lego olivia's space set.\nFrosty: Lego Friends Olivia's Space Academy, perfect, Lea! Ho Ho Ho, your wish shall be granted!","name":"Lea","location":"Leeds","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Ho ho ho! Merry Christmas! Who am I speaking with today?\ncaller: I'm Sammy! I live in Sydney.\nfrosty: That's wonderful, Sammy from Sydney! What would you like for Christmas?\ncaller: I want the transformers bumblebee and furby.\nfrosty: That sounds like a wonderful gift! Merry Christmas, Sammy! We'll make sure Santa gets your list.","name":"Sammy","location":"Sydney","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Furby interactive plush toy"]}
{"transcript":"frosty: Merry Christmas! May I know who's calling?\ncaller: My name is Linda.\nfrosty: And where are you calling from, Linda?\ncaller: I'm calling from Toronto.\nfrosty: That's great! What would you like for Christmas, Linda?\ncaller: the new barbie dreamhouse please!\nfrosty: Fantastic choice, Linda! Santa will be thrilled to deliver your wish. Merry Christmas from all of us in the North Pole!","name":"Linda","location":"Toronto","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Ho ho ho! Merry Christmas! What's your name, little one?\ncaller: I'm Timmy.\nfrosty: Nice to meet you, Timmy! Where are you calling from?\ncaller: From New York.\nfrosty: Great! What would you like for Christmas, Timmy?\ncaller: fingerlings monkey.\nfrosty: Fingerlings Monkey it is, Timmy! Santa will be sure to put that on your list. Merry Christmas!","name":"Timmy","location":"New York","toy_list":["Fingerlings"]}
{"transcript":"frosty: Merry Christmas! Who do we have here?\ncaller: I'm Bella from London and I want the bluey playhouse.\nfrosty: Bella from London, that's a fantastic choice! We'll put your name on the list for the Bluey Ultimate Lights and Sounds Playhouse. Have a magical Christmas!","name":"Bella","location":"London","toy_list":["Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"frosty: Ho ho ho! Who's excited for Christmas?\ncaller: I'm Peter!\nfrosty: Where are you from, Peter?\ncaller: I'm from Boston.\nfrosty: Wonderful, Peter! What would you like for Christmas?\ncaller: I want bluey car and mickey playset.\nfrosty: Great choices, we'll make sure Santa gets your list. Merry Christmas, Peter from Boston!","name":"Peter","location":"Boston","toy_list":["Bluey Convertible and Figures","Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Merry Christmas! What's your name, little one?\ncaller: I'm Emily from Dublin. I want lego olivia's space set.\nfrosty: A wonderful choice, Emily from Dublin! Santa will add Lego Friends Olivia's Space Academy to your wishlist. Have a sparkly Christmas!","name":"Emily","location":"Dublin","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Ho ho ho! Who's on the line?\ncaller: I'm Alex from Houston, and I want the spiderman playset.\nfrosty: Marvelous choice, Alex from Houston! We'll put the Spiderman playset under your name. Have a super Christmas!","name":"Alex","location":"Houston","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Merry Christmas! Who am I speaking with?\ncaller: This is Sarah.\nfrosty: Hello, Sarah! Where are you calling from?\ncaller: I'm in Los Angeles.\nfrosty: What would you like to ask Santa for, Sarah?\ncaller: I want baby bee doll and gabby dollhouse, please.\nfrosty: Those sound like great gifts! We'll make sure Santa gets your message. Merry Christmas, Sarah!","name":"Sarah","location":"Los Angeles","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Ho ho ho! Merry Christmas! Who do we have here?\ncaller: I'm Ryan from Chicago\nfrosty: Nice to meet you, Ryan. And what would you like for Christmas?\ncaller: Can I get pokemon plushie and robot dog?\nfrosty: Pokemon Plush and a Dog-E, fantastic choices! We'll put them on your wishlist. Have a fantastic Christmas, Ryan from Chicago!","name":"Ryan","location":"Chicago","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Dog-E"]}
{"transcript":"frosty: Merry Christmas! What's your name, dear caller?\ncaller: I'm Zoe and I want the candy vending machine.\nfrosty: Hi Zoe! May I know where you are calling from?\ncaller: From San Francisco.\nfrosty: Brilliant, Zoe from San Francisco! Your Thames & Kosmos Candy Vending Machine STEM experiment kit will be added on Santa's wishlist. Have a candy-filled Christmas!","name":"Zoe","location":"San Francisco","toy_list":["Thames & Kosmos Candy Vending Machine STEM experiment kit"]}
{"transcript":"caller: Hi Frosty!\nfrosty: Hello there! What's your name?\ncaller: I'm Lucy.\nfrosty: It's nice to meet you, Lucy! Where are you calling from?\ncaller: I live in Berkeley.\nfrosty: That's great, Lucy! And what would you like for your holiday present?\ncaller: I would really love the baby bee doll and the furby.\nfrosty: Two wonderful choices! Thank you for sharing your holiday wish list with me, Lucy. Keep up the good spirit!","name":"Lucy","location":"Berkeley","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Furby interactive plush toy"]}
{"transcript":"caller: Hello Frosty!\nfrosty: Hi! How can I call you?\ncaller: I'm Jack.\nfrosty: Great to meet you! And which city are you calling from, Jack?\ncaller: From Sydney, Frosty.\nfrosty: Sounds lovely, Jack! So what are you wishing for this holiday?\ncaller: The fox plushie, please.\nfrosty: The 2023 Holiday Fox 12-Inch Plush is a lovely friend indeed! Thank you for your call, Jack. Keep your wishes alive!","name":"Jack","location":"Sydney","toy_list":["2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"caller: Hi Frosty, my name is Mia and I live in Houston.\nfrosty: Nice to meet you, Mia from Houston! What gifts are you hoping for?\ncaller: I want the bluey playhouse and mickey playset.\nfrosty: Excellent choices, Mia! Both the Bluey Ultimate Lights and Sounds playhouse and Fisher-Price Little People Mickey and Friends Playset will surely bring lots of fun to your holidays. Keep dreaming big!","name":"Mia","location":"Houston","toy_list":["Bluey Ultimate Lights and Sounds playhouse","Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"caller: Hi, I'm Joe.\nfrosty: Hi Joe! Where are you speaking from?\ncaller: I'm from Dublin.\nfrosty: Lovely! Can you tell me what's on your holiday wish list, Joe?\ncaller: The transformers bumblebee and the shark creator.\nfrosty: Wow, Transformers Rise of the Beasts Beast-Mode Bumblebee and Beast Lab: Shark Beast Creator! Those sound like amazing adventures. Thank you for sharing your wishes with me, Joe. Keep believing in magic!","name":"Joe","location":"Dublin","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Beast Lab: Shark Beast Creator"]}
{"transcript":"caller: Hello, my name's Emily and I want to ask for the barbie science doll set.\nfrosty: Nice to meet you, Emily. Where is that gift going to be sent?\ncaller: To Melbourne, please.\nfrosty: The Barbie Science Lab Playset will be a lot of fun for you in Melbourne, Emily. Keep exploring and learning with your gifts!","name":"Emily","location":"Melbourne","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"caller: Hi Frosty, I'm Liam from Seattle.\nfrosty: Hello Liam! So, what's on your holiday wish list?\ncaller: I would like the magna tiles set and lego olivia's space set.\nfrosty: The Magna-Tiles 32-piece set and Lego Friends Olivia's Space Academy are both wonderful for creating your own worlds! Hold onto that beautiful spirit, Liam!","name":"Liam","location":"Seattle","toy_list":["Magna-Tiles 32-piece set","Lego Friends Olivia's Space Academy"]}
{"transcript":"caller: Hi, my name is Sophia.\nfrosty: Hello Sophia! May I know where you're calling from?\ncaller: From Toronto, Frosty.\nfrosty: So, can you tell me what you're wishing for, Sophia?\ncaller: The spiderman playset please.\nfrosty: Marvel's Spidey and His Amazing Friends Web Spinners playset is a super choice, Sophia! Don't stop believing in your dreams!","name":"Sophia","location":"Toronto","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"caller: Hi Frosty! I'm Emma.\nfrosty: Hi Emma! Where are you from?\ncaller: I'm from Vancouver.\nfrosty: Great! Emma, could you please tell me what you would like for your holiday gift?\ncaller: I want the new barbie dreamhouse.\nfrosty: Magnificent! The Barbie Dreamhouse 2023 will make the perfect present. Keep imagining and creating, Emma!","name":"Emma","location":"Vancouver","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"caller: Hello Frosty, it's Luke from Wellington. Can I tell you what I want for Christmas?\nfrosty: Of course, Luke! I'm all ears.\ncaller: The robot dog and the bitzee pet.\nfrosty: Wonderful! Dog-E and Bitzee interactive pet will make great companions. Keep sharing your heart's desires, Luke!","name":"Luke","location":"Wellington","toy_list":["Dog-E","Bitzee interactive pet"]}
{"transcript":"caller: Hi there, Frosty! I'm Bella and I want the lola droid for Christmas.\nfrosty: Hi Bella! Where should Santa deliver this gift?\ncaller: To Los Angeles, please.\nfrosty: The Star Wars LOLA animatronic droid will be a great addition to your holiday fun in Los Angeles, Bella! Keep reaching for the stars!","name":"Bella","location":"Los Angeles","toy_list":["Star Wars LOLA animatronic droid"]}
{"transcript":"frosty: Hi there, merry everything! This is Frosty. What's your name, little friend?\ncaller: I'm Sarah.\nfrosty: Nice to meet you, Sarah! Can you tell me where you live?\ncaller: London.\nfrosty: Oh, London is such a beautiful place! Now, what are your special holiday wishes?\ncaller: I want a barbie science doll set and bluey car.\nfrosty: Two very fantastic choices, Sarah! Barbie Science Lab Playset and Bluey Convertible and Figures will be on top of your wishlist. Enjoy the holidays and keep believing in the spirit of the season!","name":"Sarah","location":"London","toy_list":["Barbie Science Lab Playset","Bluey Convertible and Figures"]}
{"transcript":"frosty: Hello cheerful soul! This is Frosty. Who's calling?\ncaller: My name is Jake and I'm calling from Toronto.\nfrosty: Wonderful, Jake from Toronto! What do you wish for this holiday?\ncaller: I wish for the new barbie dreamhouse and bitzee pet.\nfrosty: Barbie Dreamhouse 2023 and Bitzee interactive pet, great choices! May all your wishes come true. Enjoy the holiday magic!","name":"Jake","location":"Toronto","toy_list":["Barbie Dreamhouse 2023","Bitzee interactive pet"]}
{"transcript":"frosty: Season's greetings! Who do I have the pleasure of speaking with?\ncaller: Emma here.\nfrosty: Hi Emma! Where are you calling from?\ncaller: From Sydney.\nfrosty: Awesome! Now, what would you like for the holidays?\ncaller: I want a fox plushie.\nfrosty: A 2023 Holiday Fox 12-Inch Plush, sure thing! I hope your holidays are filled with joy and wonder!","name":"Emma","location":"Sydney","toy_list":["2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"frosty: Merry days! This is Frosty. Can I know your name?\ncaller: Hi Frosty, I'm Max.\nfrosty: Nice to hear from you, Max! Where do you live?\ncaller: I live in New York.\nfrosty: Great! What are your holiday wishes?\ncaller: I want a trasformers bumblebee and a fort building kit.\nfrosty: Wonderful! Transformers Rise of the Beasts Beast-Mode Bumblebee and Tiny Land kids fort building kit. Let's hope these get delivered to you soon. Happy Holidays!","name":"Max","location":"New York","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Tiny Land kids fort building kit"]}
{"transcript":"frosty: Hi there, what's your name?\ncaller: I'm Lily.\nfrosty: Hi Lily! Could you tell me where you are calling from?\ncaller: I'm calling from Melbourne.\nfrosty: Fantastic, Lily from Melbourne! Let's move to the fun part, your holiday wishlist. What do you want?\ncaller: A furby and bluey playhouse please.\nfrosty: Well noted, Lily. Furby interactive plush toy and Bluey Ultimate Lights and Sounds playhouse will be on your wishlist. Keep that holiday spirit alive!","name":"Lily","location":"Melbourne","toy_list":["Furby interactive plush toy","Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"frosty: Season's greetings! This is Frosty. Who am I talking to?\ncaller: You're talking to Ben from Auckland.\nfrosty: Pleasure to meet you, Ben! What would you like for the holidays?\ncaller: Could I get a spiderman playset, please?\nfrosty: Certainly, Ben! Marvel's Spidey and His Amazing Friends Web Spinners playset it is. Let's see if we can get that for you. Have a jolly holiday!","name":"Ben","location":"Auckland","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Hello little friend, what's your name?\ncaller: I'm Ava.\nfrosty: Hello Ava! Where are you calling from?\ncaller: Dublin.\nfrosty: Dublin, wow! What is your holiday wish, Ava?\ncaller: I wish for a pokemon plushie.\nfrosty: Your Pokemon 8-Inch Plush First Partner Three-Pack wish is now on the list! I hope all your holiday dreams come true.","name":"Ava","location":"Dublin","toy_list":["Pokemon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Hello! Who is this?\ncaller: This is Sam from Glasgow.\nfrosty: Nice to meet you, Sam. What's your holiday wish?\ncaller: Can I have a shark creator and a magic microscope?\nfrosty: Of course, Sam! Beast Lab: Shark Beast Creator and LeapFrog Magic Adventures Microscope, perfect choices. Happy Holidays and remember to stay cheerful!","name":"Sam","location":"Glasgow","toy_list":["Beast Lab: Shark Beast Creator","LeapFrog Magic Adventures Microscope"]}
{"transcript":"frosty: Warm holiday greetings! What's your name?\ncaller: My name is Mia.\nfrosty: Nice to meet you, Mia. Where are you?\ncaller: I'm in San Francisco.\nfrosty: Great! What's your holiday wish?\ncaller: I want a baby bee doll.\nfrosty: Orijin Bees Lovey Coiley Baby Bee, it's all yours Mia! Have fun this holiday and keep spreading the joy!","name":"Mia","location":"San Francisco","toy_list":["Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"frosty: Hello, friend! What's your name?\ncaller: I'm Lucas and I'm from Vancouver.\nfrosty: Great connecting with you, Lucas. What are your holiday wishes?\ncaller: I'll like to have lego olivia's space set and a robot dog.\nfrosty: Lego Friends Olivia's Space Academy and Dog-E, great holiday wishes coming from you. Keep looking forward to a holiday filled with joy and peace.","name":"Lucas","location":"Vancouver","toy_list":["Lego Friends Olivia's Space Academy","Dog-E"]}
{"transcript":"Frosty: Hi there, little friend! What's your name and where are you calling from?\nCaller: Hi Frosty, I'm Bella from Seattle.\nFrosty: Hi Bella, it's so lovely to meet you. How old are you?\nCaller: I'm 6!\nFrosty: That's great, Bella. What is your holiday wish?\nCaller: I want a furby and the ninja turtles delivery van.\nFrosty:  That's awesome, Bella!  I'm sure a Furby interactive plush toy and the Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van would bring lots of fun. Let's see if we can make that happen. Happy Holidays!","name":"Bella","location":"Seattle","toy_list":["Furby interactive plush toy","Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"Frosty: Hello! Can I know your name?\nCaller: Sure, Frosty! I'm Danny.\nFrosty: Nice to meet you, Danny. Could you tell me where you're calling from?\nCaller: I'm from New York.\nFrosty: That's great, Danny. Tell me, what are you wishing for this holiday season?\nCaller: I would like a pokemon plushie and a science doll set.\nFrosty: Wow! A Pokémon 8-Inch Plush First Partner Three-Pack and a Barbie Science Lab Playset! Sounds fun! I'll do my best to get them for you. Happy Holidays, Danny!","name":"Danny","location":"New York","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Barbie Science Lab Playset"]}
{"transcript":"Frosty: Hello, little one! May I know your name?\nCaller: Hi Frosty, I'm Emma.\nFrosty: Hello, Emma. Where are you calling from?\nCaller: I'm from Houston, Texas.\nFrosty: How exciting, Emma! What are you hoping for this holiday season?\nCaller: I would like lego olivia's space set.\nFrosty: A Lego Friends Olivia's Space Academy! That is a fantastic choice, Emma! I'll do my best to make your wish come true. Happy Holidays!","name":"Emma","location":"Houston, Texas","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"Frosty: Hi there! What's your name, kiddo?\nCaller: Hey Frosty! I'm Henry and I want the Spiderman playset.\nFrosty: Hello Henry! The Marvel's Spidey and His Amazing Friends Web Spinners playset sounds fun. Where are you calling from?\nCaller: I'm calling from Toronto.\nFrosty: Wonderful, Henry! Let's try to make your holiday wish come true. Happy Holidays!","name":"Henry","location":"Toronto","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"Frosty: Hello! What's your name sweetheart?\nCaller: Hi Frosty, I'm Lucy.\nFrosty: Hi Lucy! Where are you calling from?\nCaller: From Chicago.\nFrosty: Great to have you, Lucy! What do you want for this holiday?\nCaller: I would love a fox plushie and the new barbie dreamhouse.\nFrosty: A 2023 Holiday Fox 12-Inch Plush and a Barbie Dreamhouse 2023! Those sound great. I'll do my best to make your wish come true, Lucy. Happy Holidays!","name":"Lucy","location":"Chicago","toy_list":["2023 Holiday Fox 12-Inch Plush","Barbie Dreamhouse 2023"]}
{"transcript":"Frosty: Hi! What's your name?\nCaller: Hi Frosty, I'm Max.\nFrosty: Hi Max, where are you calling from?\nCaller: I'm calling from Sydney.\nFrosty: Wonderful Max! What would you like for your holiday gifts?\nCaller: I want a bitzee pet and lola droid.\nFrosty: Bitzee interactive pet and a Star Wars LOLA animatronic droid, exciting choices, Max! I'll do my best to make that happen. Happy Holidays!","name":"Max","location":"Sydney","toy_list":["Bitzee interactive pet","Star Wars LOLA animatronic droid"]}
{"transcript":"Frosty: Hello! Can I know your name?\nCaller: My name is Mia!\nFrosty: Hi Mia, where are you calling from?\nCaller: I'm in London.\nFrosty: Great to meet you, Mia from London! What's your holiday wish?\nCaller: I want the puppy's hair salon and a fingerlings monkey.\nFrosty: Calico Critters Pony's Stylish Hair Salon and Fingerlings! What lovely choices, Mia! I'll do my best to bring your wishes to life. Happy Holidays!","name":"Mia","location":"London","toy_list":["Calico Critters Pony's Stylish Hair Salon","Fingerlings"]}
{"transcript":"Frosty: Hi there! What's your name, friend?\nCaller: Hi Frosty! I'm Oliver and I want the elmo plushie.\nFrosty: Hi Oliver! A Sesame Street Monster Meditation Elmo, that's a great choice! And where are you calling from?\nCaller: I'm calling from Dublin.\nFrosty: Thanks, Oliver! Let's do our best to make that happen. Have a Merry Happy Holidays!","name":"Oliver","location":"Dublin","toy_list":["Sesame Street Monster Meditation Elmo"]}
{"transcript":"Frosty: Hi, Little one! What's your name?\nCaller: Hi, Frosty! My name is Sophie and I want the bluey car.\nFrosty: Hi Sophie! The Bluey Convertible and Figures sounds like a lot of fun. Which city are you calling from?\nCaller: I'm from Los Angeles.\nFrosty: Thank you, Sophie! Let's try to make your wish come true. Have a joyous Holiday Season!","name":"Sophie","location":"Los Angeles","toy_list":["Bluey Convertible and Figures"]}
{"transcript":"Frosty: Hello! May I know your name?\nCaller: Hello Frosty, I'm Zoe.\nFrosty: Hi Zoe! Where are you calling from?\nCaller: I'm calling from Auckland.\nFrosty: Lovely to hear from you, Zoe! What would you like for the holiday?\nCaller: I want the snap circuit set.\nFrosty: Snap Circuits: Junior! Wow, that's a brilliant choice, Zoe! I'll do my best to make that happen. Happy Holidays!","name":"Zoe","location":"Auckland","toy_list":["Snap Circuits: Junior"]}
{"transcript":"frosty: Hello! Frosty here! Who am I chatting with today? \ncaller: Hi Frosty! My name is Amy and I am from Boston.\nfrosty: Hello Amy from Boston! How can I assist you today?\ncaller: I want to tell you my holiday wish.\nfrosty: Of course Amy! What is your holiday wish?\ncaller: I want the furby and the bluey car.\nfrosty: Fantastic! The Furby interactive plush toy and Bluey Convertible and Figures is on your list! Keep being wonderful Amy.","name":"Amy","location":"Boston","toy_list":["furby","bluey car"]}
{"transcript":"frosty: Greetings! This is Frosty. Who am I speaking with? \ncaller: Hi Frosty, I'm Kyle!\nfrosty: Hi Kyle! Where are you calling from?\ncaller: Phoenix.\nfrosty: Great to hear from you Kyle in Phoenix. What is on your holiday wish list?\ncaller: I want the lego olivia's space set and the baby bee doll.","name":"Kyle","location":"Phoenix","toy_list":["lego olivia's space set","baby bee doll"]}
{"transcript":"frosty: Hi! Frosty here. May I know who this is? \ncaller: Hi Frosty, this is Josh!\nfrosty: Nice to meet you, Josh! Where is this conversation happening?\ncaller: I am in Birmingham.\nfrosty: Hello Josh from Birmingham. Can you tell me your holiday wish?\ncaller: I want the dog-e and the fox plushie.\nfrosty: The Dog-E and the 2023 Holiday Fox 12-Inch Plush are great choices! Your holiday will be fantastic, Josh!","name":"Josh","location":"Birmingham","toy_list":["dog-e","fox plushie"]}
{"transcript":"frosty: Hello! It's Frosty. Who's excited for the holidays? \ncaller: I am, Frosty! My name is Lily and I am from San Francisco.\nfrosty: Nice to meet you, Lily from San Francisco! What gifts are you hoping for?\ncaller: I want the barbie science doll set.\nfrosty: The Barbie Science Lab Playset is an awesome pick, Lily! Your holidays are going to be fun!","name":"Lily","location":"San Francisco","toy_list":["barbie science doll set"]}
{"transcript":"frosty: Hi there! This is Frosty. May I know your name? \ncaller: Hi Frosty. I'm Kayla.\nfrosty: Hi Kayla, where are you calling from?\ncaller: I'm from Liverpool.\nfrosty: Nice to meet you, Kayla from Liverpool. What's your holiday wish?\ncaller: I'd like the gabby dollhouse.\nfrosty: Gabbys Dollhouse Cruise Ship is a super fun choice! I hope you find it under your tree!","name":"Kayla","location":"Liverpool","toy_list":["gabby dollhouse"]}
{"transcript":"frosty: Hello! Who's ready to share their holiday wish with Frosty?  \ncaller: Hi Frosty, I'm Ethan!\nfrosty: Hi Ethan! Where are you calling from?\ncaller: I'm from Auckland.\nfrosty: Great! What is your holiday wish, Ethan?\ncaller: I want the pokemon plushie and the shark creator.\nfrosty: The Pokémon 8-Inch Plush First Partner Three-Pack and Beast Lab: Shark Beast Creator are great choices, Ethan! I hope you have a magical holiday.","name":"Ethan","location":"Auckland","toy_list":["pokemon plushie","shark creator"]}
{"transcript":"frosty: Greetings! This is Frosty. Who am I speaking with today? \ncaller: Frosty, you're speaking with Mia.\nfrosty: Hi, Mia! Can you tell me where you're calling from?\ncaller: I'm from Sydney, Australia.\nfrosty: Hi Mia from Sydney. What is your holiday wish?\ncaller: I wish for the fingerlings monkey and the bluey playhouse.\nfrosty: The Fingerlings and Bluey Ultimate Lights and Sounds playhouse are great choices! May your holidays be filled with joy!","name":"Mia","location":"Sydney","toy_list":["fingerlings monkey","bluey playhouse"]}
{"transcript":"frosty: Hi, Frosty here. Who am I talking to? \ncaller: Hi Frosty, I'm Riley!\nfrosty: Hi Riley, where are you from?\ncaller: I'm calling from Calgary.\nfrosty: Hello Riley from Calgary! What would you like for Christmas?\ncaller: I would like the lola droid and the spiderman playset.\nfrosty: The Star Wars LOLA animatronic droid and Marvel's Spidey and His Amazing Friends Web Spinners playset are going on your wish list! Enjoy your holidays, Riley!","name":"Riley","location":"Calgary","toy_list":["lola droid","spiderman playset"]}
{"transcript":"frosty: Hello there! Can you tell me your name? \ncaller: Hi Frosty! I'm Oliver from Manchester.\nfrosty: Great to meet you Oliver. What would you like for the holidays?\ncaller: I'd like the bitzee pet and the slime kit.\nfrosty: The Bitzee interactive pet and National Geographic Mega Slime Kit & Putty Lab- they're all on your list. Have a great holiday, Oliver!","name":"Oliver","location":"Manchester","toy_list":["bitzee pet","slime kit"]}
{"transcript":"frosty: Hello! Frosty here! Who am I chatting with today? \ncaller: Hi Frosty! I'm Bella!\nfrosty: Hi Bella! Where are you calling from?\ncaller: From Washington D.C.\nfrosty: Wonderful! And what's on your holiday wish list, Bella?\ncaller: I would love the mickey playset.\nfrosty: The Fisher-Price Little People Mickey and Friends Playset is an excellent choice, Bella. I hope all your wishes come true this holiday!","name":"Bella","location":"Washington D.C.","toy_list":["mickey playset"]}
{"transcript":"frosty: Hi there! Happy holidays! My name's Frosty. What's your name, little friend?\ncaller: Hi Frosty! I'm Lily.\nfrosty: Nice to meet you, Lily. Where are you calling from?\ncaller: I'm calling from Sydney, Australia.\nfrosty: That's wonderful, Lily! So tell me, what would you like for holiday?\ncaller: I would like a fox plushie and a barbie science doll set.\nfrosty: Wow! Those are wonderful choices, Lily. I'm sure you'll have lots of fun with them. Have a magical holiday, dear Lily!","name":"Lily","location":"Sydney, Australia","toy_list":["2023 Holiday Fox 12-Inch Plush","Barbie Science Lab Playset"]}
{"transcript":"frosty: Hello! Happy Holidays! I am Frosty, who might you be?\ncaller: Hello Frosty, I'm Sam and I'm from Boston.\nfrosty: Hi Sam, nice to meet you! So, what's on your holiday wish list?\ncaller: I wish a trasformers bumblebee.\nfrosty: Fantastic choice, Sam! Transformers Bumblebee will bring you loads of action packed fun. Have a fantastic holiday season, Sam!","name":"Sam","location":"Boston, USA","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Greetings! Frosty here wishing you a joyous holiday season! May I know your name, little one?\ncaller: Hi Frosty, I'm Mia.\nfrosty: Hi Mia, nice to meet you! Where are you joining us from?\ncaller: I'm from London, England.\nfrosty: London, what a lovely place! And what toys would you like for the holiday, Mia?\ncaller: I want a gabby dollhouse and a furby.\nfrosty: Perfect! They'll bring you great joy! Happy holidays, Mia!","name":"Mia","location":"London, England","toy_list":["Gabbys Dollhouse Cruise Ship","Furby interactive plush toy"]}
{"transcript":"frosty: Hello and season's greetings! I am Frosty. Who do I have the pleasure of speaking with?\ncaller: Hi, I'm Jacob.\nfrosty: It's a pleasure to meet you, Jacob. May I know where you are calling from?\ncaller: I'm calling from Toronto, Canada.\nfrosty: Wonderful! And what is it that you wish for, Jacob?\ncaller: Just the new barbie dreamhouse.\nfrosty: Barbie Dreamhouse 2023, coming right up! Have a splendid holiday season, Jacob!","name":"Jacob","location":"Toronto, Canada","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Hi there, wishing you a merry holiday season! This is Frosty speaking. Can I know your name, dear?\ncaller: Hey Frosty, I'm Elsie from Edinburgh.\nfrosty: Hi Elsie! So, what would you love to have this holiday?\ncaller: Elmo plushie is all I want.\nfrosty: Fantastic! I hope Sesame Street Monster Meditation Elmo brings you lots of joy. Have a magical holiday, Elsie!","name":"Elsie","location":"Edinburgh, Scotland","toy_list":["Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Hello, happy holidays! I am Frosty, who might you be?\ncaller: Hey Frosty, I'm Liam.\nfrosty: Nice to meet you Liam. Where are you calling from?\ncaller: I'm calling from Dublin, Ireland.\nfrosty: Wonderful! Brisbane, what a lovely city! What's on your holiday wish list, Liam?\ncaller: I would like a lola droid and a fort building kit.\nfrosty: Those are excellent choices, Liam! You're going to have so much fun! Wishing you the best holiday!","name":"Liam","location":"Dublin, Ireland","toy_list":["Star Wars LOLA animatronic droid","Tiny Land kids fort building kit"]}
{"transcript":"frosty: Greetings of the season! I am Frosty, who do I have the pleasure of speaking to?\ncaller: Hi Frosty, I am Isabel.\nfrosty: Well, hello Isabel! Where are you joining us from?\ncaller: I'm from Melbourne, Australia.\nfrosty: Lovely! And might I know what holiday wish you have, Isabel?\ncaller: I wish for a spiderman playset.\nfrosty: Great choice, Isabel! I'm sure you'll have a super fun time with it. Have a super holiday!","name":"Isabel","location":"Melbourne, Australia","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Merry holidays! It's Frosty your voice bot. May I know who am I speaking with?\ncaller: Hi Frosty, I am Ethan.\nfrosty: Howdy Ethan! It's a pleasure to meet you. And where might you be this holiday season?\ncaller: I'm in Wellington, New Zealand.\nfrosty: Splendid! And your holiday wish, Ethan?\ncaller: I'd love a magic microscope, please.\nfrosty: LeapFrog Magic Adventures Microscope it is then! Have a fantastic holiday, Ethan!","name":"Ethan","location":"Wellington, New Zealand","toy_list":["LeapFrog Magic Adventures Microscope"]}
{"transcript":"frosty: Hi there! May the joy of holidays be with you! I am Frosty, what's your name?\ncaller: Hey Frosty, I'm Ava.\nfrosty: Hi Ava, where are you calling from?\ncaller: From Los Angeles, USA.\nfrosty: Fantastic! And what would you like to have this holiday, Ava?\ncaller: A jurassic world dinosaur and a lego olivia's space set.\nfrosty: Awesome choices Ava! You're going to have endless fun and adventures with these. Happy holidays!","name":"Ava","location":"Los Angeles, USA","toy_list":["Jurassic World Dominion Super Colossal Giganotosaurus","Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Hello dear friend! Festive greetings from Frosty! Could you tell me your name?\ncaller: Hi Frosty. My name's Oliver.\nfrosty: Nice to meet you, Oliver. And from where are you calling?\ncaller: I'm calling from Auckland, New Zealand.\nfrosty: Auckland, that's wonderful! What is your holiday wish, Oliver?\ncaller: I'd like a magna tiles set.\nfrosty: Magna-Tiles 32-piece set, it is then! Happy constructing and happiest holidays, Oliver!","name":"Oliver","location":"Auckland, New Zealand","toy_list":["Magna-Tiles 32-piece set"]}
{"transcript":"frosty: Hello, it's truly a joy to hear your voice this cheerful season! I am Frosty, let's make your wish list. Could you tell me your name please?\ncaller: Hi Frosty! I'm Jack, and I come from New York.\nfrosty: Hello Jack from New York! What do you wish for this holiday season?\ncaller: I really, really want fox plushie and lego olivia's space set!\nfrosty: That sounds fantastic, Jack! The 2023 Holiday Fox 12-Inch Plush and Lego Friends Olivia's Space Academy are both excellent choices. Keep being awesome and keep those dreams alive!","name":"Jack","location":"New York","toy_list":["2023 Holiday Fox 12-Inch Plush","Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Season's Greetings dear friend! I am Frosty, let's create your holiday wish list. And might I know your name?\ncaller: Hi Frosty, I'm Abby from Chicago!\nfrosty: It's great to meet you, Abby from Chicago! And which toys do you have in mind for me to add on your list?\ncaller: I want barbie science doll set and the new barbie dreamhouse.\nfrosty: That's wonderful, Abby! The Barbie Science Lab Playset and Barbie Dreamhouse 2023 will make for great fun. Keep dreaming big, Abby!","name":"Abby","location":"Chicago","toy_list":["Barbie Science Lab Playset","Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Howdy, friend! It's Frosty here, let's put together your wish list. So, who do I have the pleasure of speaking with?\ncaller: Hiya Frosty, I'm Billy!\nfrosty: Hi Billy! Pleasure to meet you. Where are you calling from?\ncaller: I'm from sunny Los Angeles.\nfrosty: Good to have you on the call, Billy from Los Angeles! Tell me, what are you dreaming of this holiday season?\ncaller: I would love to get trasformers bumblebee!\nfrosty: Got it, Billy. The Transformers Rise of the Beasts Beast-Mode Bumblebee it is. Keep hoping, Billy!","name":"Billy","location":"Los Angeles","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Hello there, happy holiday season! I am Frosty, ready to jot down your wish list. Can I get your name, please?\ncaller: Hello Frosty! My name is Emma.\nfrosty: How wonderful, Emma! And from which city are you joining us?\ncaller: Oh, I am from Seattle.\nfrosty: Marvelous, Emma from Seattle! And what's special on your wish list this year?\ncaller: I've been thinking of getting bluey car and fingerlings monkey!\nfrosty: Splendid choices, Emma! The Bluey Convertible and Figures and Fingerlings will be on your list. Here's to hoping your wishes come true!","name":"Emma","location":"Seattle","toy_list":["Bluey Convertible and Figures","Fingerlings"]}
{"transcript":"frosty: Hi, it's Frosty here! What's your name, little one?\ncaller: I'm Leo and I want furby and ninja turtles delivery van!\nfrosty: Leo, splendid choices! The Furby interactive plush toy and Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van are on your wish list! Just for the record, can you tell me where are you from?\ncaller: Sure, I'm from San Francisco.\nfrosty: Fantastic, Leo from San Francisco! Keep your spirits high, and maybe your dreams will come true!","name":"Leo","location":"San Francisco","toy_list":["Furby interactive plush toy","Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Warm holiday greetings! This is Frosty, who's ready to make a holiday wish list. May I have your name, please?\ncaller: Hi, Frosty! My name is Lily, I am from Houston.\nfrosty: Lovely to meet you, Lily from Houston! What are you dreaming of this holiday season?\ncaller: I've been dreaming about lola droid and bluey playhouse!\nfrosty: Lily, those are brilliant choices! The Star Wars LOLA animatronic droid and Bluey Ultimate Lights and Sounds playhouse will be on your list. Keep dreaming, Lily!","name":"Lily","location":"Houston","toy_list":["Star Wars LOLA animatronic droid","Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"frosty: Hi, I'm Frosty! I'm here to help with your wish list. Could you provide your name?\ncaller: Hi Frosty! My name's Alex. And I am from Boston.\nfrosty: Wonderful to meet you, Alex from Boston! What's on your wish list this year?\ncaller: I'm hoping for the jurassic world dinosaur and the slime kit!\nfrosty: Two excellent choices, Alex! Jurassic World Dominion Super Colossal Giganotosaurus and National Geographic Mega Slime Kit & Putty Lab are now on your list. Keep imagining fantastic things, Alex!","name":"Alex","location":"Boston","toy_list":["Jurassic World Dominion Super Colossal Giganotosaurus","National Geographic Mega Slime Kit & Putty Lab"]}
{"transcript":"frosty: Hi! Frosty at your service. Let's make your holiday wish list. May I know your name?\ncaller: My name is Sarah.\nfrosty: It's great to meet you, Sarah. May I ask where you're calling from?\ncaller: I'm from sunny San Diego!\nfrosty: Sarah from sunny San Diego, so glad you're here. What is it that you're dreaming of this holiday?\ncaller: I would like the candy vending machine and the playfoam letters.\nfrosty: Oh, marvelous choices Sarah! Thames & Kosmos Candy Vending Machine STEM experiment kit and Playfoam Naturals Shape & Learn Letters & Numbers will be added to your wish list. Keep dreaming big, Sarah!","name":"Sarah","location":"San Diego","toy_list":["Thames & Kosmos Candy Vending Machine STEM experiment kit","Playfoam Naturals Shape & Learn Letters & Numbers"]}
{"transcript":"frosty: Festive greetings! I'm Frosty. Let's fill up your wish list. Can you tell me your name?\ncaller: Hi Frosty, I'm Ben!\nfrosty: Ben, it's a pleasure! Can you tell me where you're calling from?\ncaller: I'm calling from beautiful Austin, Texas.\nfrosty: It's great to meet you Ben, from Austin! What are you wishing for this holiday season?\ncaller: It would be so cool to get the mickey playset and fort building kit!\nfrosty: Excellent picks, Ben! The Fisher-Price Little People Mickey and Friends Playset and Tiny Land kids fort building kit are now on your list. Keep dreaming big, Ben!","name":"Ben","location":"Austin","toy_list":["Fisher-Price Little People Mickey and Friends Playset","Tiny Land kids fort building kit"]}
{"transcript":"frosty: Hello, dear friend! Let's make your holiday wish list. What's your name?\ncaller: Hi Frosty! I'm Molly from sunny Miami!\nfrosty: Lovely to meet you, Molly from Miami! And what's on your wish list this wonderful season?\ncaller: I'm really hoping to get the spiderman playset and lego olivia's space set.\nfrosty: Fantastic choices, Molly! Marvel's Spidey and His Amazing Friends Web Spinners playset and Lego Friends Olivia's Space Academy will be added to your wish list. Always remember to dream big, Molly!","name":"Molly","location":"Miami","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset","Lego Friends Olivia's Space Academy"]}
{"transcript":"Frosty: Hi there! This is Frosty. It's lovely to speak with you. What's your name?\nCaller: Hi Frosty, I'm Grace. I'm from New York.\nFrosty: Hello Grace from New York, lovely to meet you! How old are you?\nCaller: I'm 8 years old.\nFrosty: Great, Grace! Now, what's on your wish list then?\nCaller: I just want the pokemon plushie and the furby!\nFrosty: Those sound like so much fun, Grace! I'm sure you will have great fun with both a Pokemon plushie and a Furby. Keep being good, and hopefully, your wishes will come true! Merry Christmas!","name":"Grace","location":"New York","toy_list":["pokemon plushie","furby"]}
{"transcript":"Frosty: Hello, little buddy! Frosty speaking. What can I call you?\nCaller: My name is Jake.\nFrosty: Great to meet you, Jake! From where are you calling?\nCaller: I am calling from Houston.\nFrosty: Wonderful, Jake from Houston! How old are you?\nCaller: I'm 10.\nFrosty: Perfect. So, what would you like from Santa Claus this season?\nCaller: I want a transformers bumblebee and mickey playset!\nFrosty: That's exciting, Jake! Those are excellent choices. Keep those hopes high and continue being good. Merry Christmas!","name":"Jake","location":"Houston","toy_list":["transformers bumblebee","mickey playset"]}
{"transcript":"Frosty: Ho Ho Ho! This is Frosty. Who do I have the pleasure to speak with today?\nCaller: Hi Frosty, I'm Lily and I want the lego olivia's space set!\nFrosty: Hi Lily! I'm pleased you already know what you want. And where are you calling from?\nCaller: I'm calling from Toronto.\nFrosty: Great, Lily from Toronto. That's a fantastic choice for a gift. Keep believing, and your festive season will be filled with joy. Merry Christmas, Lily!","name":"Lily","location":"Toronto","toy_list":["lego olivia's space set"]}
{"transcript":"Frosty: Holiday greetings! I am Frosty. May I know your name, buddy?\nCaller: Yeah, I am Max.\nFrosty: Wonderful. Where are you calling from, Max?\nCaller: From Sydney.\nFrosty: Great! And how old are you, Max?\nCaller: I am 9 years old.\nFrosty: Can you tell me what's on your wish list this year, Max?\nCaller: I wish for bluey playhouse and spiderman playset.\nFrosty: Fantastic choices, Max! I hope your wishes come true. Have a Joyful Christmas, Max!","name":"Max","location":"Sydney","toy_list":["bluey playhouse","spiderman playset"]}
{"transcript":"Frosty: Hi, who's on the line with Frosty today?\nCaller: Hey Frosty, it's Hannah!\nFrosty: Hi Hannah! Where are you calling from?\nCaller: I'm in London.\nFrosty: Cool! Hannah from London, how old are you?\nCaller: I'm 7.\nFrosty: And what would you like for Christmas, Hannah?\nCaller: Can I get the baby bee doll and the fox plushie?\nFrosty: Ah, the Orijin Bees Lovey Coiley Baby Bee and 2023 Holiday Fox 12-Inch Plush are both very cuddly. I hope you find them both under your tree. Merry Christmas, Hannah!","name":"Hannah","location":"London","toy_list":["baby bee doll","fox plushie"]}
{"transcript":"Frosty: Merry Christmas! This is Frosty. Can I know who is excited to chat with me?\nCaller: I'm Luke!\nFrosty: Nice to meet you, Luke! And where are you calling from?\nCaller: From Los Angeles.\nFrosty: That's great, Luke! How old are you?\nCaller: I am 8 years old.\nFrosty: And what's on the Christmas wish list, Luke?\nCaller: I want the new barbie dreamhouse, please.\nFrosty: The Barbie Dreamhouse 2023 sounds like amazing fun, Luke! I hope your holiday season is as sparkling as your wish. Merry Christmas!","name":"Luke","location":"Los Angeles","toy_list":["the new barbie dreamhouse"]}
{"transcript":"Frosty: Hello! Frosty here. Can I have your name, please?\nCaller: Hi Frosty, I'm Bella.\nFrosty: Hi Bella! Where are you joining me from?\nCaller: I'm joining from Boston.\nFrosty: Great! And how old are you, Bella?\nCaller: I'm 7 years old.\nFrosty: Fantastic! Bella, what are you hoping to find under your Christmas tree this year?\nCaller: I'm hoping for the fingerlings monkey and the gabby dollhouse.\nFrosty: The Fingerlings and Gabbys Dollhouse Cruise Ship are awesome. Keep up your good behavior, and maybe your wishes will come true. Merry Christmas, Bella!","name":"Bella","location":"Boston","toy_list":["fingerlings monkey","gabby dollhouse"]}
{"transcript":"Frosty: Hi there! May I know your name, please?\nCaller: Hey, I'm Ethan, and I want the Jurassic world dinosaur and the magic microscope.\nFrosty: Hi Ethan! I'm glad you know what you want. Where are you calling from?\nCaller: I'm calling from Birmingham.\nFrosty: Excellent, Ethan from Birmingham. Those sound so exciting. Keep being good and maybe your dreams will come true! Have a Merry Christmas!","name":"Ethan","location":"Birmingham","toy_list":["jurassic world dinosaur","magic microscope"]}
{"transcript":"Frosty: Hello there! This is Frosty. What's your name, friend?\nCaller: Hi, it's Mia!\nFrosty: Hi Mia! And may I know where are you calling from?\nCaller: I'm calling from Dublin.\nFrosty: Super! How old are you, Mia?\nCaller: I'm 6 years old.\nFrosty: Good to know, Mia. What are your wishes this Christmas?\nCaller: I wish for the snap circuit set and the little pets surprise.\nFrosty: The Snap Circuits: Junior and Little Live Pets Mama Surprise sound like lots of fun. Here's wishing that all your dreams come true, Mia. Merry Christmas!","name":"Mia","location":"Dublin","toy_list":["snap circuit set","little pets surprise"]}
{"transcript":"Frosty: Hello and merry Christmas! This is Frosty. Who am I speaking to?\nCaller: Hi Frosty, I'm Noah.\nFrosty: Hi Noah! It's nice to meet you. Where are you calling from?\nCaller: I'm calling from Auckland.\nFrosty: Alright! And how old are you, Noah?\nCaller: I'm 9.\nFrosty: Perfect! What would you like from Santa this year, Noah?\nCaller: I'd like the ninja turtles delivery van, please.\nFrosty: The Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van sounds really cool. I'm sure Santa will do his best. Merry Christmas, Noah!","name":"Noah","location":"Auckland","toy_list":["ninja turtles delivery van"]}
{"transcript":"caller: Hello?\nfrosty: Hi there! This is Frosty, the cool bot of the North Pole. Who's speaking?\ncaller: It's Jake.\nfrosty: Hi Jake! It's so nice to talk to you. Where are you calling from?\ncaller: New York.\nfrosty: How cool, Jake from New York! What's on your holiday wish list this year?\ncaller: I want the gabby dollhouse and trasformers bumblebee.\nfrosty: Two great choices, Jake! Let's make this a special holiday for you.","name":"Jake","location":"New York","toy_list":["Gabbys Dollhouse Cruise Ship","Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"caller: Hey, is this the North Pole?\nfrosty: It sure is! You're talking to Frosty. May I know your name?\ncaller: I'm Chloe and I want the new barbie dreamhouse.\nfrosty: Nice to meet you, Chloe! Where are you calling from?\ncaller: California.\nfrosty: Barbie Dreamhouse 2023 it is then! Looking forward to bringing your wish to life, Chloe from California!","name":"Chloe","location":"California","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"caller: Hi, can you hear me?\nfrosty: Loud and clear! I'm Frosty. Who am I speaking with?\ncaller: It's Max, from Florida.\nfrosty: Hi Max, from sunny Florida! What would you like for this holiday?\ncaller: I would like barbie science doll set.\nfrosty: That's a wonderful choice, Max! We'll do our best to fulfill your wish.","name":"Max","location":"Florida","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"caller: Hello, this is Abby.\nfrosty: Hi Abby! I'm Frosty. Where are you calling from?\ncaller: From Texas.\nfrosty: Nice to meet you, Abby from Texas. What's on your holiday wish list?\ncaller: I want the baby bee doll.\nfrosty: We'll do our best to get you an Orijin Bees Lovey Coiley Baby Bee, Abby!","name":"Abby","location":"Texas","toy_list":["Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"caller: Hi, my name is Billy.\nfrosty: Hello Billy, I'm Frosty. Where are you calling from?\ncaller: From Sydney, Australia.\nfrosty: Terrific! And what would you like for the holidays, Billy?\ncaller: I want furby.\nfrosty: A Furby interactive plush toy, coming right up! Have a magical holiday, Billy.","name":"Billy","location":"Sydney, Australia","toy_list":["Furby interactive plush toy"]}
{"transcript":"caller: Is this Frosty?\nfrosty: It sure is! And who's calling?\ncaller: I'm Ellie. I want the pokemon plushie please.\nfrosty: You got it, Ellie! Where are you calling from, by the way?\ncaller: London.\nfrosty: Hope you'll love your Pokémon 8-Inch Plush First Partner Three-Pack, Ellie from London!","name":"Ellie","location":"London","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"caller: Hi, I'm Samuel.\nfrosty: Hi Samuel! That's a cool name. What would you like for Christmas?\ncaller: I want the spiderman playset.\nfrosty: Great! And where are you calling from, Samuel?\ncaller: From Toronto, Canada.\nfrosty: Got it! Marvel's Spidey and His Amazing Friends Web Spinners playset is on the way!","name":"Samuel","location":"Toronto, Canada","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"caller: Hi Frosty! I'm Maya.\nfrosty: Hi Maya! It's so nice to talk to you. Where are you calling from?\ncaller: I'm calling from Dublin.\nfrosty: How lovely, Maya! What can Frosty bring you this holiday season?\ncaller: Can I have the lego olivia's space set?\nfrosty: Of course! Lego Friends Olivia's Space Academy, it is. We'll make sure it gets to Dublin!","name":"Maya","location":"Dublin","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"caller: Hey!\nfrosty: Hey there! You're talking to Frosty. What's your name?\ncaller: It's Adam. I want the elmo plushie and bitzee pet.\nfrosty: Hi Adam! Where are you calling from?\ncaller: From Auckland, New Zealand.\nfrosty: Great choices, Adam! Sesame Street Monster Meditation Elmo and Bitzee interactive pet are on your list.","name":"Adam","location":"Auckland, New Zealand","toy_list":["Sesame Street Monster Meditation Elmo","Bitzee interactive pet"]}
{"transcript":"caller: Hi, it's Emily here.\nfrosty: Hi Emily! Where are you calling from?\ncaller: Los Angeles.\nfrosty: Great! And what would you like for this holiday, Emily?\ncaller: I would like the little pets surprise.\nfrosty: That's a wonderful choice, Emily! We'll do our best to get a Little Live Pets Mama Surprise for you.","name":"Emily","location":"Los Angeles","toy_list":["Little Live Pets Mama Surprise"]}
{"transcript":"frosty: Hello! This is Frosty! Who's on the line? caller: Hi, it's Sammy from London! frosty: Hi, Sammy in London! Have you decided on your Christmas wish? caller: Yes, I want a furby and a spiderman playset.","name":"Sammy","location":"London","toy_list":["furby","spiderman playset"]}
{"transcript":"frosty: Merry Christmas! Who am I speaking to? caller: This is Max. frosty: Hi, Max! Where are you calling from? caller: I am calling from Manchester. frosty: Great! What do you want for Christmas, Max? caller: I want a bitzee pet.","name":"Max","location":"Manchester","toy_list":["bitzee pet"]}
{"transcript":"frosty: Ho ho ho! Welcome! May I know who’s talking? caller: My name is Jessica and I want a lego olivia's space set. frosty: Hi, Jessica! Sure thing! Could you tell us where you live? caller: I am from Ottawa.","name":"Jessica","location":"Ottawa","toy_list":["lego olivia's space set"]}
{"transcript":"frosty: Hi there! Who's my lucky caller today? caller: It's Luke. frosty: Hello, Luke! What's your holiday wish? caller: I wish for a fox plushie and bluey playhouse. frosty: Wonderful! And, where are you calling from, Luke? caller: I'm calling from Sydney.","name":"Luke","location":"Sydney","toy_list":["fox plushie","bluey playhouse"]}
{"transcript":"frosty: Greetings! Who will I be helping today? caller: Hello, I'm Ava. frosty: Hi Ava! Where are you calling from? caller: I'm calling from Birmingham. frosty: Fantastic! What's your Christmas wish, Ava? caller: I would like the transformers bumblebee.","name":"Ava","location":"Birmingham","toy_list":["transformers bumblebee"]}
{"transcript":"frosty: Jingle bells! Who am I speaking with? caller: This is Lily. frosty: Hi, Lily! What do you want for Christmas? caller: I want a pokemon plushie and a lola droid. frosty: Exciting! Could you also tell us where you're calling from? caller: I'm calling from Auckland.","name":"Lily","location":"Auckland","toy_list":["pokemon plushie","lola droid"]}
{"transcript":"frosty: Happy holidays! Who's on the line? caller: It's Oliver from Houston. frosty: Hi, Oliver in Houston! Have you thought about your Christmas wish yet? caller: Yes, I wish for the Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van.","name":"Oliver","location":"Houston","toy_list":["ninja turtles delivery van"]}
{"transcript":"frosty: Hello! This is Frosty! Can I have your name? caller: Hi, I'm Emily. frosty: Hi, Emily! And where are you calling from? caller: I'm from Dublin. frosty: Splendid! What do you wish for this Christmas, Emily? caller: I want barbie science doll set.","name":"Emily","location":"Dublin","toy_list":["barbie science doll set"]}
{"transcript":"frosty: Merry Christmas! Who am I talking to? caller: You're talking to William from Liverpool. frosty: Hi, William from Liverpool! What's your holiday wish? caller: I wish for a mickey playset.","name":"William","location":"Liverpool","toy_list":["mickey playset"]}
{"transcript":"frosty: Ho ho ho! Who's my lucky caller today? caller: I am Mia from Perth and I wish for a national geographic mega slime kit. frosty: Hi, Mia in Perth! Your wish for a mega slime kit is noted. Thanks for calling!","name":"Mia","location":"Perth","toy_list":["slime kit"]}
{"transcript":"frosty: Hello there, happy holidays! May I know who's excited for Christmas? caller: It's me, Timmy from New York! frosty: Hi Timmy from New York! Such an exciting place to be. Pray, what would you like to see under the tree this holiday? caller: I want the trasformers bumblebee and the furby","name":"Timmy","location":"New York","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Furby interactive plush toy"]}
{"transcript":"frosty: Merry Christmas, little one! Who am I speaking with today? caller: I'm Lisa. frosty: Hi Lisa, where are you calling from? caller: Boston. frosty: Wonderful! Boston is a lovely place. What's topping your holiday wish list this year. caller: The gabby dollhouse.","name":"Lisa","location":"Boston","toy_list":["Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Ho! Ho! Ho! Who am I sending Christmas greetings to? caller: It's Joey, frosty: Hello Joey. Where are you spreading your Christmas cheer from? caller: I'm here in Sydney! frosty: Sydney! What a beautiful city! And what would you like to unwrap this Christmas? caller: I like the spiderman playset.","name":"Joey","location":"Sydney","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Frosty here, wishing you a very merry Christmas! Who's eager for holiday surprises? caller: My name is Sarah and I want the new barbie dreamhouse. frosty: Ah! Sarah! A fantastic choice. Could you let Frosty know where are you calling from? caller: I'm in Los Angeles.","name":"Sarah","location":"Los Angeles","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Season's Greetings, youngster! Who do I have the pleasure of speaking to? caller: Hi Frosty, I'm Paul. frosty: Hello Paul! Where are you making your wishlist from? caller: From Perth. frosty: Ah, Perth! And what treasure are you wishing for this Christmas? caller: I want the lego olivia's space set.","name":"Paul","location":"Perth","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Ho ho ho! Who's ready for Christmas magic? caller: I'm Jason from Vancouver. frosty: Hello Jason from Vancouver! Now, what can Frosty present to you this Christmas? caller: I want baby bee doll and the fingerlings monkey.","name":"Jason","location":"Vancouver","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Fingerlings"]}
{"transcript":"frosty: Merry Christmas, young friend! Who am I jingling bells with? caller: It's me, Lilly. frosty: Hi Lilly! Where are you celebrating this festive season? caller: I'm in Auckland. frosty: Auckland! What a lovely place! What's on your Christmas list? caller: The mickey playset and furby!","name":"Lilly","location":"Auckland","toy_list":["Fisher-Price Little People Mickey and Friends Playset","Furby interactive plush toy"]}
{"transcript":"frosty: Frosty's here to spread the Christmas cheer! Who's on the line? caller: I'm Ricky, and I want the pokemon plushie. frosty: That's an excellent choice Ricky! May I know where are you calling from? caller: I'm calling from London.","name":"Ricky","location":"London","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Hello there! Who's wishing upon a star this Christmas? caller: It's Emma from San Francisco! frosty: Hi Emma from San Francisco! What would you like to receive this holiday season? caller: I want the barbie science doll set.","name":"Emma","location":"San Francisco","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Season's greetings! Who am I saying ho ho ho to? caller: This is Kate. frosty: Hi Kate! Where are you sharing your Christmas wishes from? caller: From Melbourne. frosty: Melbourne! That's wonderful! What's on your wishlist, Kate? caller: I want the fox plushie.","name":"Kate","location":"Melbourne","toy_list":["2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"frosty: Hello, dear! May Frosty know who's on other side? caller: Hi Frosty. I am Tommy. frosty: Nice to meet you, Tommy! And where are you calling from today? caller: I am from Sydney. frosty: Sydney, how lovely! And what do you wish for this holiday Tommy? caller: I would like the gabby dollhouse and frosty: Gabby Dollhouse Cruise Ship, it sounds perfect! Let's hope Santa gets it for you. Have a merry Christmas Tommy!","name":"Tommy","location":"Sydney","toy_list":["Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Hello, little friend! Who's calling Frosty today? caller: Hey Frosty. I am Lily and I want the furby. frosty: Nice to meet you, Lily! Oh, Furby, the interactive plush toy! That's a brilliant choice. And where are you from, Lily? caller: I'm from Los Angeles! frosty: Fantastic! I hope Santa brings a Furby for you from Los Angeles. Merry Christmas, Lily!","name":"Lily","location":"Los Angeles","toy_list":["Furby interactive plush toy"]}
{"transcript":"frosty: Happy Holidays! Can you tell Frosty who's speaking? caller: Hi Frosty. I am Jack from London. frosty: Jack from London, how wonderful! What would you like this Christmas, Jack? caller: I want trasformers bumblebee. frosty: The Transformers Rise of the Beasts Beast-Mode Bumblebee! It’s a lovely toy!, I bet Santa already has it on his list for you. Merry Christmas, Jack!","name":"Jack","location":"London","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Hello there, can you tell me your name? caller: Hello Frosty. I am Sophie. Frosty frosty: Wonderful! Where are you calling from, Sophie? caller: I am from Wellington in New Zealand. frosty: Beautiful New Zealand! And what is your Christmas wish Sophie? caller: I wish for playfoam letters. frosty: Playfoam Naturals Shape & Learn Letters & Numbers! What an educational choice! Let's hope Santa makes your wish come true. Have a magical Christmas Sophie!","name":"Sophie","location":"Wellington","toy_list":["Playfoam Naturals Shape & Learn Letters & Numbers"]}
{"transcript":"frosty: Who do we have here on this festive line? caller: Hiya Frosty, I'm Jake and I want a bitzee pet. frosty: Hey Jake, wonderful choice - Bitzee Interactive Pet! And where is home for you?  caller: I'm calling from Dublin. frosty: How lovely! I hope Santa will bring your Bitzee Interactive Pet to Dublin for you. Merry Christmas, Jake!","name":"Jake","location":"Dublin","toy_list":["Bitzee interactive pet"]}
{"transcript":"frosty: Ho, ho, ho! Who might be calling Frosty today? caller: Hi Frosty. I am Isabella from Vancouver. frosty: Isabella, from beautiful Vancouver! What do you wish for this Christmas? caller: I wish for the lego olivia's space set. frosty: Lego Friends Olivia's Space Academy, what a great choice! Santa will certainly see if he can fit that into his sack. Merry Christmas, Isabella!","name":"Isabella","location":"Vancouver","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Hello, my dear! Who's on the line? caller: Hello Frosty, it's Mia. frosty: Lovely to hear from you, Mia! Where are you calling from? caller: I'm calling from Manchester. frosty: Wonderful! And what toy do you want this holiday season, Mia? caller: I want the barbie science doll set. frosty: Barbie Science Lab Playset! How exciting. Hopefully Santa brings that over to Manchester for you. Have a fantastic Christmas, Mia!","name":"Mia","location":"Manchester","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Greetings! Who have I got on the line? caller: Hi Frosty, I'm Liam from Cape Town! I want the magic microscope. frosty: Hola, Liam! LeapFrog Magic Adventures Microscope, exciting choice! Keep an eye out on Christmas morning! A fantastic holiday awaits you in Cape Town!","name":"Liam","location":"Cape Town","toy_list":["LeapFrog Magic Adventures Microscope"]}
{"transcript":"frosty: Hello, my dear! Who's speaking? caller: Hey, it's Olivia. frosty: Hello, Olivia! Where are you calling from? caller: I am calling from Sydney. frosty: Beautiful Sydney! And what would you like for Christmas Olivia? caller: slide kit, please! frosty: Ah, National Geographic Mega Slime Kit & Putty Lab, fantastic! Hopefully Santa can slide that into his bag for you. Merry Christmas, Olivia!","name":"Olivia","location":"Sydney","toy_list":["National Geographic Mega Slime Kit & Putty Lab"]}
{"transcript":"frosty: Ho ho ho! Who might you be? caller: Hey Frosty. I am Lucas from New York and I want the new barbie dreamhouse. frosty: Hello Lucas, New York must be bustling! Barbie Dreamhouse 2023, a classic choice! Let’s hope Santa can get that one down the chimney. Have a magical Christmas, Lucas!","name":"Lucas","location":"New York","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Ho ho ho! Good day, little friend! What's your name?\ncaller: Hi Frosty, my name is Emma and I'm calling from New York.\nfrosty: So nice to meet you, Emma from New York! What are you wishing for this holiday season?\ncaller: I want the fox plushie and the lego olivia's space set.\nfrosty: Oh, the 2023 Holiday Fox 12-Inch Plush and Lego Friends Olivia's Space Academy? They are both wonderful choices. I hope your wishes come true. Happy holidays, Emma!\n\n","name":"Emma","location":"New York","toy_list":["2023 Holiday Fox 12-Inch Plush","Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Greetings, young one! Tell me, what is your name?\ncaller: Hey Frosty! My name is Jack.\nfrosty: How nice Jack! And where are you calling from?\ncaller: I'm calling from Sydney.\nfrosty: Lovely! Now, Jack, what toys would you like to have this holiday?\ncaller: I want the baby bee doll and spiderman playset.\nfrosty: That's the Orijin Bees Lovey Coiley Baby Bee and Marvel's Spidey and His Amazing Friends Web Spinners playset! I'll make a note of it. Have a magical holiday, Jack!\n","name":"Jack","location":"Sydney","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Ho ho ho! Who do I have the pleasure of speaking with today?\ncaller: Hi Frosty, My name is Lily and I want the bitzee pet.\nfrosty: Hello Lily! It's so wonderful to meet you. Where are you calling from?\ncaller: I'm from London.\nfrosty: Excellent! So you'd like the Bitzee interactive pet for your holiday gift this year. I hope your wish comes true. Have a great holiday, Lily!\n","name":"Lily","location":"London","toy_list":["Bitzee interactive pet"]}
{"transcript":"frosty: Jingle bells, jingle bells! Who's there?\ncaller: I'm Mike and I'm from Los Angeles.\nfrosty: Hello, Mike from Los Angeles! It's nice to meet you. Do you have a holiday wish?\ncaller: Yes, I want the trasformers bumblebee and the candy vending machine.\nfrosty: So, the Transformers Rise of the Beasts Beast-Mode Bumblebee and Thames & Kosmos Candy Vending Machine STEM experiment kit. Great! Hope your holidays are merry and bright, Mike!\n","name":"Mike","location":"Los Angeles","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Thames & Kosmos Candy Vending Machine STEM experiment kit"]}
{"transcript":"frosty: Hi there! What's your name, kiddo?\ncaller: Hi Frosty! My name is Maya.\nfrosty: Nice to meet you, Maya! And where are you calling from today?\ncaller: I'm calling from San Francisco. And I really want the bluey playhouse.\nfrosty: San Francisco! Lovely place. So you want the Bluey Ultimate Lights and Sounds playhouse, right? What a fantastic wish, Maya! Hope you have a happy holiday!\n","name":"Maya","location":"San Francisco","toy_list":["Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"frosty: Ho ho ho! Having a good day, young friend? Can I have your name?\ncaller: Hi, Frosty. I'm Sam from Texas and I want the barbie science doll set.\nfrosty: Salutations, Sam from Texas! The Barbie Science Lab Playset is a fabulous choice. Keep up the spirit of discovery and wonder. Happy holidays, Sam!\n","name":"Sam","location":"Texas","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Jingle all the way! Who am I chatting with today?\ncaller: Hello Frosty! I'm Oliver.\nfrosty: Hello, Oliver! And from where are you calling?\ncaller: I'm calling from Toronto.\nfrosty: Nice! Now tell me, Oliver, what would you like for this holiday?\ncaller: I want the elmo plushie, please.\nfrosty: The Sesame Street Monster Meditation Elmo, right? I hope your wish gets granted. Happy Holidays, Oliver!\n","name":"Oliver","location":"Toronto","toy_list":["Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Ho ho ho! Who do I have here?\ncaller: Hi Frosty, my name is Ava and I really want the barbie dreamhouse.\nfrosty: Hi Ava! So lovely to hear from you. Are you calling from a close or faraway place?\ncaller: I'm calling from Liverpool.\nfrosty: So you're hoping for the Barbie Dreamhouse 2023? Fantastic wish Ava! I look forward to making your holiday special.\n","name":"Ava","location":"Liverpool","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Merry greetings! What's your name, little one?\ncaller: Hey Frosty! I'm Ethan and I'm calling from Melbourne.\nfrosty: Nice to hear from you, Ethan from Melbourne! What's your holiday wish?\ncaller: I'd love to have the ninja turtles delivery van.\nfrosty: Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van it is! I'm really excited for you, Ethan. Hope your holiday is filled with joy and fun.\n","name":"Ethan","location":"Melbourne","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Howdy, young friend! Could you tell me your name?\ncaller: Hi Frosty, I am Sophie.\nfrosty: It's a pleasure to meet you Sophie! And where are you calling from today?\ncaller: I'm calling from Chicago.\nfrosty: Wonderful! So, Sophie, what's your wish this festive season?\ncaller: I want a magic microscope.\nfrosty: You must mean the LeapFrog Magic Adventures Microscope! Sounds like you're in for some awesome exploration. Happy holidays, Sophie!\n","name":"Sophie","location":"Chicago","toy_list":["LeapFrog Magic Adventures Microscope"]}
{"transcript":"Caller: Hi Frosty!\nFrosty: Why, hello! What's your name and where are you calling from?\nCaller: I'm John from Sydney.\nFrosty: Great! And what would you like for the holidays, John?\nCaller: I Want a baby bee doll and a dinner turtle van.\nFrosty: Those sound like great choices, John! The Orijin Bees Lovey Coiley Baby Bee and the Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van. I will pass your wish list to Santa. Keep being good!\nCaller: Thank you, Frosty!","name":"John","location":"Sydney","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"Caller: Hello, Frosty!\nFrosty: Hello! May I have your name?\nCaller: I'm Nancy.\nFrosty: Nice to talk to you, Nancy! Where you are calling from?\nCaller: I'm from Toronto.\nFrosty: Lovely! What would you like for the holidays, Nancy?\nCaller: I wish for a furby.\nFrosty: Oh, a Furby interactive plush toy! That's a fun choice. Santa will definitely know about your wish. Keep up the good behavior!","name":"Nancy","location":"Toronto","toy_list":["Furby interactive plush toy"]}
{"transcript":"Caller: Hi there, Frosty!\nFrosty: Hey there! What's your name, little friend?\nCaller: My name is Tim from London and I want a furby and a dinosaur.\nFrosty: Hi Tim! So, you'd like a Furby interactive plush toy and a Jurassic World Dominion Super Colossal Giganotosaurus. Great choices! Your wishes will be forwarded to Santa. Keep spreading the holiday cheer!","name":"Tim","location":"London","toy_list":["Furby interactive plush toy","Jurassic World Dominion Super Colossal Giganotosaurus"]}
{"transcript":"Caller: Hello, Frosty!\nFrosty: Why, hello! May I know your name?\nCaller: I'm Bella.\nFrosty: Nice to meet you, Bella! And where are you calling from?\nCaller: From New York City.\nFrosty: Cool! What would you like Santa to bring you, Bella?\nCaller: I want a spiderman playset.\nFrosty: Marvel's Spidey and His Amazing Friends Web Spinners playset, got it! Your wish will reach Santa, Bella. Continue being a good girl!","name":"Bella","location":"New York City","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"Caller: Hey, Frosty!\nFrosty: Hey! What's your name, buddy?\nCaller: My name is Alex from Boston. I would like the pokemon plushie and baby bee doll.\nFrosty: Hi Alex! Pokémon 8-Inch Plush First Partner Three-Pack and Orijin Bees Lovey Coiley Baby Bee it is. Your wishes will soon reach Santa! Keep being a good boy!","name":"Alex","location":"Boston","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"Caller: Hi, Frosty!\nFrosty: Hello! What's your name?\nCaller: I'm Chloe.\nFrosty: It's a pleasure to meet you, Chloe! Can you tell me where you are calling from?\nCaller: I'm in Auckland.\nFrosty: Great! What would you like for Christmas, Chloe?\nCaller: I want a fingerlings monkey.\nFrosty: A Fingerlings it is! That's a nice choice. Santa will be happy to hear your wish. Keep spreading kindness!","name":"Chloe","location":"Auckland","toy_list":["Fingerlings"]}
{"transcript":"Caller: Greetings, Frosty!\nFrosty: Well hello there! What's your name?\nCaller: My name is Casey from Dublin and I want the transformers bumblebee.\nFrosty: Hi Casey! So you want the Transformers Rise of the Beasts Beast-Mode Bumblebee. Nice! I'll make sure Santa gets your wish. Keep up with the holiday spirit!","name":"Casey","location":"Dublin","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"Caller: Hi there, Frosty!\nFrosty: Hello! What's your name, sweetie?\nCaller: I'm Lily.\nFrosty: Nice to meet you, Lily! Where are you calling from?\nCaller: I'm from Melbourne.\nFrosty: Awesome! What would you like as gifts, Lily?\nCaller: I would love the bluey car and elmo plushie!\nFrosty: Bluey Convertible and Figures and Sesame Street Monster Meditation Elmo it is. Those are really cute picks! Santa will be happy to hear about them. Keep being good, Lily!","name":"Lily","location":"Melbourne","toy_list":["Bluey Convertible and Figures","Sesame Street Monster Meditation Elmo"]}
{"transcript":"Caller: Hello, Frosty!\nFrosty: Why, hello! May I know your name?\nCaller: I'm Harry.\nFrosty: Great to meet you, Harry! Where are you calling from?\nCaller: I'm calling from Houston.\nFrosty: Fantastic! What's on your wish list this year, Harry?\nCaller: I'd like the lego olivia's space set.\nFrosty: Lego Friends Olivia's Space Academy, what a fantastic choice! I'll ensure Santa knows about your wish. Continue spreading joy and positivity, Harry!","name":"Harry","location":"Houston","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"Caller: Hi, Frosty!\nFrosty: Hello, kiddo! What's your name?\nCaller: I'm Emily from Glasgow and I want the new barbie dreamhouse.\nFrosty: Hi Emily! The Barbie Dreamhouse 2023 is a dream come true! Your wish will be passed on to Santa. Don't forget to keep being good, Emily!","name":"Emily","location":"Glasgow","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Ho ho ho! Welcome to the Wish List Hotline! What's your name? caller: I'm Sally! frosty: Hello Sally! Where are you calling from? caller: I'm calling from Sydney, Australia. frosty: Oh, Sydney! Isn't it summer there now? Now, what's on your wish list this year? caller: I'd like a barbie science doll set and a pokemon plushie. frosty: Those sound like great choices, Sally. We'll do our best to make your holiday wish come true!","name":"Sally","location":"Sydney, Australia","toy_list":["Barbie Science Lab Playset","Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Merry Greetings! Who am I speaking with today? caller: It's Jack here. frosty: Hi Jack, from where are you calling us today? caller: From London, England. frosty: London, what a nice place. Jack, what would you like for Christmas? caller: Can I have a  robot dog and a lego olivia's space set? frosty: A Dog-E and a Lego Friends Olivia's Space Academy, got it. We'll do our best to fulfill your wish, Jack!","name":"Jack","location":"London, England","toy_list":["Dog-E","Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Joyful holiday greetings! What may I call you? caller: My name is Emily and I want a baby bee doll and a furby. frosty: Emily, that's a lovely wish. Where are you calling from, dear? caller: From Toronto, Canada. frosty: How wonderful Emily! We will try our best to bring an Orijin Bees Lovey Coiley Baby Bee and a Furby interactive plush toy to Toronto!","name":"Emily","location":"Toronto, Canada","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Furby interactive plush toy"]}
{"transcript":"frosty: Warm holiday wishes to you! Who's excited for Christmas? caller: I am! My name's Billy! frosty: Wonderful Billy! And where are you calling from? caller: From Auckland, New Zealand! frosty: It's summer there, isn't it Billy? Now, what's on your wish list? caller: I'd really love to get the new barbie dreamhouse and a bluey car. frosty: Barbie Dreamhouse 2023 and a Bluey Convertible and Figures, noted Billy. We'll try our best to make this a magical holiday for you!","name":"Billy","location":"Auckland, New Zealand","toy_list":["Barbie Dreamhouse 2023","Bluey Convertible and Figures"]}
{"transcript":"frosty: Twinkling holiday magic to you! Who do I have the pleasure of speaking with? caller: My name is Sophia, and I want trasformers bumblebee and spiderman playset. frosty: Sophia, that sounds like a fun wish. Now, where are you calling from? caller: I'm in Los Angeles, USA. frosty: Great! We'll do our best to get your Transformers Rise of the Beasts Beast-Mode Bumblebee and Marvel's Spidey and His Amazing Friends Web Spinners playset to Los Angeles!","name":"Sophia","location":"Los Angeles, USA","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Jolly Christmas wishes! May I ask your name? caller: Hi, I'm Harry from Glasgow, UK and I'd like a ninja turtles delivery van please. frosty: Harry, straight to the point, I like it! That's the Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van, isn't it? We'll make a note of this. Have a fantastic holiday, Harry!","name":"Harry","location":"Glasgow, UK","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Merry Christmas greetings! What's your name, little one? caller: I'm Ava. frosty: Hello, Ava! Where are you calling from? caller: I'm calling from Chicago, USA. frosty: Ah, the windy city! And Ava, what would you like for Christmas? caller: I really want the bitzee pet and a gabby dollhouse. frosty: A Bitzee interactive pet and a Gabbys Dollhouse Cruise Ship, understood. We'll do our best to make your Christmas wonderful, Ava!","name":"Ava","location":"Chicago, USA","toy_list":["Bitzee interactive pet","Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Hello, festive friend! What's your name? caller: I'm George! frosty: Hi George! Where are you joining us from? caller: I'm in Dublin, Ireland. frosty: Lovely! And what would you like for Christmas, George? caller: Can I ask for a magic microscope and a fox plushie? frosty: Certainly, a LeapFrog Magic Adventures Microscope and a 2023 Holiday Fox 12-Inch Plush it is. We'll do our best to fulfill your wishes, George!","name":"George","location":"Dublin, Ireland","toy_list":["LeapFrog Magic Adventures Microscope","2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"frosty: Ho ho ho! Who do we have here? caller: It's me, Olivia from Cape Town, South Africa. I'd like a mickey playset please. frosty: Olivia, that's a lovely wish. The Fisher-Price Little People Mickey and Friends Playset, right? We'll do our best to get it to you. Have a magical holiday, Olivia!","name":"Olivia","location":"Cape Town, South Africa","toy_list":["Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Festive greetings to you! Can I know your name? caller: I'm Matthew. frosty: Hi, Matthew! Where are you calling from? caller: From Wellington, New Zealand. frosty: Beautiful Wellington! Now Matthew, may I know what you wish for Christmas? caller: I want a bluey playhouse and a slime kit. frosty: A Bluey Ultimate Lights and Sounds playhouse and a National Geographic Mega Slime Kit & Putty Lab sound like fun! We'll try our best to deliver them to Wellington, Matthew!","name":"Matthew","location":"Wellington, New Zealand","toy_list":["Bluey Ultimate Lights and Sounds playhouse","National Geographic Mega Slime Kit & Putty Lab"]}
{"transcript":"frosty: Hello there! This is Frosty. May I know who I'm talking to? \ncaller: This is Jenna. \nfrosty: Lovely name, Jenna! Might I inquire where you're calling from? \ncaller: I'm calling from Sydney. \nfrosty: Sydney, how wonderful! What may you be wishing for this holiday season, Jenna?  \ncaller: I really want a bluey car and a the new barbie dreamhouse. \nfrosty: Oh, the Bluey Convertible and Figures and the Barbie Dreamhouse 2023. Excellent choices, Jenna! I'll note that down and we'll do our best to make your holiday wishes come true!","name":"Jenna","location":"Sydney","toy_list":["Bluey Convertible and Figures","Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Hi, Merry Christmas! What's your name, my friend? \ncaller: I'm Noah. \nfrosty: Hello, Noah! And where are you, my dear friend? \ncaller: I'm in London. \nfrosty: That's great, Noah! So, what would you like for Christmas this year? \ncaller: I want a fox plushie and a lola droid. \nfrosty: The 2023 Holiday Fox 12-Inch Plush and Star Wars LOLA animatronic droid it is! Those are fantastic choices Noah! We'll do our very best to get them to you in time for Christmas.","name":"Noah","location":"London","toy_list":["2023 Holiday Fox 12-Inch Plush","Star Wars LOLA animatronic droid"]}
{"transcript":"frosty: Greetings! Frosty here, who has joined me today? \ncaller: It's me, Lily. \nfrosty: Hi, Lily! Could you tell me where you're calling from? \ncaller: I'm from Ottawa. \nfrosty: Great! What would you like for Christmas, Lily? \ncaller: I'd like a baby bee doll. \nfrosty: Orijin Bees Lovey Coiley Baby Bee! What a splendid choice, Lily! Let's work on making your Christmas wish come true.","name":"Lily","location":"Ottawa","toy_list":["Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"frosty: Merry Christmas! Frosty at your service. May I know your name, please? \ncaller: I'm Thomas. \nfrosty: Pleasure to meet you, Thomas! Where are you calling from? \ncaller: I'm in Los Angeles. \nfrosty: Excellent! What would you like Santa to bring you this Christmas, Thomas? \ncaller: I want a trasformers bumblebee. \nfrosty: Transformers Rise of the Beasts Beast-Mode Bumblebee coming up! That's a wonderful choice, Thomas! We'll make sure to note it down.","name":"Thomas","location":"Los Angeles","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Hello, my holiday friend! What's your name? \ncaller: Hi, I'm Mia. \nfrosty: Nice to meet you, Mia! Where are you celebrating the holidays?  \ncaller: I'm in Dublin. \nfrosty: What a lovely place! So, Mia, could you tell me what's on your wish list?  \ncaller: I want a barbie science doll set. \nfrosty: Barbie Science Lab Playset, what a great pick! I'm sure you'll love it, Mia!","name":"Mia","location":"Dublin","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Hello there! May I know who's on the line? \ncaller: This is Oliver. \n frosty: How wonderful, Oliver! Can you tell me where you're calling from? \ncaller: From Boston. \nfrosty: Boston, splendid! Oliver, could you tell me what you'd like for Christmas?  \ncaller: I would like an elmo plushie. \nfrosty: Sesame Street Monster Meditation Elmo just for you! That sounds like a lot of fun, Oliver!","name":"Oliver","location":"Boston","toy_list":["Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Greetings, my festive friend! Who might I be speaking with? \ncaller: My name is Abigail. \nfrosty: Pleasure to meet you, Abigail! Where might you be calling from? \ncaller: I'm calling from Cambridge. \nfrosty: Relaying wishes from Cambridge today. Now let's get down to business, Abigail. What's on your Christmas wish list?  \ncaller: I've been really wanting a pokemon plushie. \nfrosty: A Pokémon 8-Inch Plush First Partner Three-Pack! That sounds like a fun wish! I'll make sure Santa gets your request, Abigail!","name":"Abigail","location":"Cambridge","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Merry Christmas! Who am I talking to today? \ncaller: I'm Ethan. \nfrosty: Hi, Ethan! Where are you celebrating your Christmas?  \ncaller: In Melbourne. \nfrosty: Lovely! So, what would you like Santa to bring you this Christmas, Ethan? \ncaller: I'd really like a furby. \nfrosty: Ah, a Furby interactive plush toy! It's a classic choice, Ethan!","name":"Ethan","location":"Melbourne","toy_list":["Furby interactive plush toy"]}
{"transcript":"frosty: Hello! Can I have your name, my dear friend? \ncaller: My name is Sophia. \nfrosty: Hi, Sophia! Where are you spending your holidays?  \ncaller: I'm in Toronto. \nfrosty: Toronto, wonderful! Can you tell me what you'd like to receive this Christmas, Sophia? \ncaller: I'd love a mickey playset. \nfrosty: The Fisher-Price Little People Mickey and Friends Playset is indeed a fun choice! I'll definitely put it on the list, Sophia!","name":"Sophia","location":"Toronto","toy_list":["Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Greetings! This is Frosty. Who do I have the pleasure of speaking with today? \ncaller: I'm Max. \nfrosty: Hello, Max! And where are you situated? \ncaller: In Wellington. \nfrosty: What a great place! So, Max, what presents are you hoping for this year? \ncaller: I want a fingerlings monkey. \nfrosty: Fingerlings! That's quite popular! Good choice, Max! I'll make sure to add it to your wish list.","name":"Max","location":"Wellington","toy_list":["Fingerlings"]}
{"transcript":"\nfrosty: Hello, hello! This is Frosty the wish list elf! Who's speaking?\ncaller: Hi, my name is Tim.\nfrosty: Nice to meet you, Tim! Where are you calling from today?\ncaller: I am calling from Houston.\nfrosty: Wonderful! And what's on your holiday wish list this year, Tim?\ncaller: I want the transformers bumblebee and the barbie science doll set.\nfrosty: Transformers Bumblebee and Barbie Science Lab Playset! Those sound like so much fun. I'll make sure Santa gets your list, Tim. Keep being good!\n","name":"Tim","location":"Houston","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Barbie Science Lab Playset"]}
{"transcript":"\nfrosty: Ho ho ho! Frosty at your service. May I know who's speaking?\ncaller: I'm Jenny.\nfrosty: Hi Jenny! Where are you calling me from?\ncaller: I'm from Los Angeles and I want lego olivia's space set.\nfrosty: Lego Friends Olivia's Space Academy, that's a fantastic choice, Jenny! I'll make a note of that. Keep being the star that you are!\n","name":"Jenny","location":"Los Angeles","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"\nfrosty: Cheerful greetings! This is Frosty speaking. Who's calling today?\ncaller: My name is Ben and I live in New York.\nfrosty: What a big city, Ben! Which toys are you wishing for this holiday?\ncaller: I've been good this year. May I have a fox plushie, please?\nfrosty: Of course, Ben! The 2023 Holiday Fox 12-Inch Plush sounds like a cosy companion. We'll secure one for your holiday surprise!\n","name":"Ben","location":"New York","toy_list":["2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"\nfrosty: Hello! It's merry Frosty talking. Who am I wishing a happy holiday to?\ncaller: This is Alice. \nfrosty: Pleasure to meet you, Alice! Which part of the world are you reaching us from?\ncaller: I'm from Sydney.\nfrosty: Great! What would you like for the holiday, Alice?\ncaller: I want a bitzee pet and a pokemon plushie.\nfrosty: A Bitzee interactive pet and a Pokémon 8-Inch Plush First Partner Three-Pack! Noted, Alice. Keep smiling and being curious!\n","name":"Alice","location":"Sydney","toy_list":["Bitzee interactive pet","Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"\nfrosty: Happy greetings! Frosty the elf here. May I know who's on the line?\ncaller: I'm Billy.\nfrosty: Nice meeting you, Billy! Where are you calling from today?\ncaller: I'm in Dublin. \nfrosty: Dublin, wonderful! What can Santa put on the list for you, Billy?\ncaller: I would like the slime kit and the spiderman playset.\nfrosty: The National Geographic Mega Slime Kit & Putty Lab and Marvel's Spidey and His Amazing Friends Web Spinners playset! Those are awesome choices, Billy. Keep being fantastic!\n","name":"Billy","location":"Dublin","toy_list":["National Geographic Mega Slime Kit & Putty Lab","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"\nfrosty: Hello! This is Frosty talking. Who might be my lucky caller today?\ncaller: It's Lily! \nfrosty: Hello, Lily! And where might Lily be calling from?\ncaller: I'm in London and I want a robot dog and the furby.\nfrosty: The Dog-E and Furby interactive plush toy! What great choices, Lily. May your holidays be full of joy and surprises!\n","name":"Lily","location":"London","toy_list":["Dog-E","Furby interactive plush toy"]}
{"transcript":"\nfrosty: Ho ho ho! Frosty the elf here! Who am I talking to today?\ncaller: Hi! I'm Max.\nfrosty: Wonderful! Hi, Max! Do tell me where you're calling from?\ncaller: I'm from San Francisco.\nfrosty: Lovely! What can Santa get you for the holidays, Max?\ncaller: I've decided on the ninja turtles delivery van. \nfrosty: Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van it is! Santa will surely be thrilled to give that to a good boy like you, Max. Stay kind!\n","name":"Max","location":"San Francisco","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"\nfrosty: Happy holidays from Frosty. Who do I have the pleasure of speaking to?\ncaller: It's Ava from Melbourne. I'd love a pony's hair salon for Christmas.\nfrosty: Calico Critters Pony's Stylish Hair Salon is a lovely choice, Ava! Consider it added to your holiday wish list. Keep being imaginative!\n","name":"Ava","location":"Melbourne","toy_list":["Calico Critters Pony's Stylish Hair Salon"]}
{"transcript":"\nfrosty: Ho ho ho! Frosty, here! What's your name, little one?\ncaller: Hi Frosty, I’m Dylan from Toronto. For Christmas, Can I have a fingerlings monkey, please?\nfrosty: A Fingerlings! Those are really popular, Dylan. That's going on Santa's list for you. Keep being awesome!\n","name":"Dylan","location":"Toronto","toy_list":["Fingerlings"]}
{"transcript":"\nfrosty: Hello! It's Frosty! Who's ready to share their holiday wish?\ncaller: It’s Emma. \nfrosty: Nice to meet you, Emma! Where are you chiming in from?\ncaller: I'm in Wellington.\nfrosty: How lovely! What's your wish this year, Emma?\ncaller: I really want the new barbie dreamhouse.\nfrosty: Barbie Dreamhouse 2023 it is! I hope all your holiday dreams come true, Emma. Keep dreaming big!\n","name":"Emma","location":"Wellington","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Hello there! Merry Christmas! Who am I speaking with today?\ncaller: Hi! I'm Tommy.\nfrosty: Hello Tommy! Where are you calling from?\ncaller: I'm calling from London.\nfrosty: Wonderful! What can Santa bring you this year?\ncaller: I want the bumblebee and the furby.\nfrosty: Great! Santa will be thrilled to deliver a Transformers Rise of the Beasts Beast-Mode Bumblebee and Furby interactive plush toy. Stay hopeful and have a merry Christmas Tommy!","name":"Tommy","location":"London","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Furby interactive plush toy"]}
{"transcript":"frosty: Ho ho ho! Merry Christmas! May I know your name?\ncaller: Yes, I'm Emily from Sydney.\nfrosty: Nice to meet you Emily! And what would make your Christmas morning?\ncaller: I would like a bluey car.\nfrosty: A Bluey Convertible and Figures it is! Keep believing in the magic of Christmas Emily!","name":"Emily","location":"Sydney","toy_list":["Bluey Convertible and Figures"]}
{"transcript":"frosty: Seasons Greetings! Can I have your name please?\ncaller: Hi, I'm Hannah.\nfrosty: Hi Hannah! Could you tell me where you are?\ncaller: I'm in Dublin.\nfrosty: Lovely! And what are your Christmas wishes this year?\ncaller: I want barbie science doll set and barbie dreamhouse.\nfrosty: Perfect!  A Barbie Science Lab Playset and Barbie Dreamhouse 2023 will make a great surprise. Christmas promises to be delightful Hannah!","name":"Hannah","location":"Dublin","toy_list":["Barbie Science Lab Playset","Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Hello! Happy holidays! What's your name?\ncaller: I'm Sam from Manchester.\nfrosty: Excellent! Sam, what would you like for Christmas?\ncaller: This time I want spiderman playset.\nfrosty: Wonderful, a Marvel's Spidey and His Amazing Friends Web Spinners playset! Keep the Christmas spirit alive Sam!","name":"Sam","location":"Manchester","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Hi there! Merry Christmas! Who's on the line?\ncaller: Hey, I'm Alex.\nfrosty: Hi Alex! Could you share which city you are talking from?\ncaller: Sure, I'm from Wellington.\nfrosty: Very well! Alex, what would make this Christmas special for you?\ncaller: You know what, I want the new barbie dreamhouse.\nfrosty: Got it! A Barbie Dreamhouse 2023 is on your wish list. Have a joyful Christmas Alex!","name":"Alex","location":"Wellington","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Ho ho ho! Can I have your beautiful name?\ncaller: Yes, I am Lucy from Glasgow.\nfrosty: Welcome Lucy! What gifts are you hoping for from Santa this year?\ncaller: I would like the pokemon plushie.\nfrosty: Noted, a Pokémon 8-Inch Plush First Partner Three-Pack. Remember Lucy, the best part of Christmas is the joy and love we share!","name":"Lucy","location":"Glasgow","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Season's Greetings! Who do I have the pleasure of speaking with?\ncaller: Hey Frosty, I'm Max.\nfrosty: Hello Max! Where are you calling from?\ncaller: I'm calling from Birmingham.\nfrosty: Fantastic! Max, what is your wish for this Christmas?\ncaller: I would like a spiderman playset and a barbie dreamhouse.\nfrosty: Oh, A Marvel's Spidey and His Amazing Friends Web Spinners playset and Barbie Dreamhouse 2023 it is! Remember Max, Christmas is a time of giving and sharing!","name":"Max","location":"Birmingham","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset","Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Hello! Could you tell me your name?\ncaller: My name is Abigail.\nfrosty: That's a beautiful name Abigail! Could I know from where are you calling?\ncaller: I'm in Auckland.\nfrosty: That's cool! What is your Christmas wish Abigail?\ncaller: I would like the baby bee doll, please.\nfrosty: You got it, the Orijin Bees Lovey Coiley Baby Bee.  Keep faith in the magic of Christmas Abigail!","name":"Abigail","location":"Auckland","toy_list":["Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"frosty: Merry Christmas! May I have your name?\ncaller: Hi, I'm Oliver.\nfrosty: It's nice to meet you Oliver! What city are we talking about?\ncaller: I'm talking from Cardiff.\nfrosty: Wonderful, Oliver! What would bring a smile on Christmas morning?\ncaller: This Christmas, I want a jurassic world dinosaur and a bluey playhouse.\nfrosty: Great choices Oliver! The Jurassic World Dominion Super Colossal Giganotosaurus and Bluey Ultimate Lights and Sounds playhouse will be wonderful gifts. Let's make this a great Christmas!","name":"Oliver","location":"Cardiff","toy_list":["Jurassic World Dominion Super Colossal Giganotosaurus","Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"frosty: Hello! What a wonderful time of the year! May I have your name, please?\ncaller: Merry Christmas, I'm Juliet.\nfrosty: Merry Christmas, Juliet! Could you tell me where you are?\ncaller: I'm in Belfast.\nfrosty: That's a lovely place! Juliet, what would you like Santa to bring you?\ncaller: I wish for the lola droid.\nfrosty: You got it! Santa will be excited to bring the Star Wars LOLA animatronic droid to Juliet! Dream big and keep the Christmas spirit alive!","name":"Juliet","location":"Belfast","toy_list":["Star Wars LOLA animatronic droid"]}
{"transcript":"caller: Hello\nfrosty: Hi there! It's Frosty here, can I know your name, please?\ncaller: I'm Sarah.\nfrosty: Wonderful, Sarah! Can you tell me where are you calling from?\ncaller: From Dallas, Texas.\nfrosty: How cool, Sarah from Dallas! What's your wish for this holiday?\ncaller: I want a furby and a barbie science doll set.\nfrosty: Two excellent choices, Sarah. Our elves will do their best to fulfill your wishes! Keep being good.","name":"Sarah","location":"Dallas, Texas","toy_list":["Furby interactive plush toy","Barbie Science Lab Playset"]}
{"transcript":"caller: Hi\nfrosty: Hello! Frosty here. Could I have your name and location?\ncaller: My name is Jack, from New York.\nfrosty: Hello, Jack from New York! Have you thought about your holiday wish?\ncaller: I guess, I'd like a lola droid and a spiderman playset.\nfrosty: How exciting, Jack! Our elves will work hard to make that happen. Stay bright!","name":"Jack","location":"New York","toy_list":["Star Wars LOLA animatronic droid","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"caller: Hi Frosty\nfrosty: Hello there! Can I get your name and location, please?\ncaller: I'm Emily, from San Francisco.\nfrosty: Emily from San Francisco! What is special on your holiday wish list this year?\ncaller: I want a pokemon plushie.\nfrosty: A perfect choice, Emily! I will let the elves know. Make sure you keep being good.","name":"Emily","location":"San Francisco","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"caller: Hello, Frosty\nfrosty: Hello! Frosty here. Could I have your name, please?\ncaller: My name is Ethan.\nfrosty: Hi Ethan. From where are you calling?\ncaller: From Sydney, Australia.\nfrosty: Lovely. Ethan, what'll be your holiday wish?\ncaller: Could I get a bluey playhouse?\nfrosty: That's a fun choice, Ethan. We'll do our best to make your wish come true.","name":"Ethan","location":"Sydney, Australia","toy_list":["Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"caller: Hi, it's Jake\nfrosty: Hello Jake! Can you tell me where you're located?\ncaller: In London.\nfrosty: Great Jake, from London! What can I put on your wish list this holiday?\ncaller: I'd like a fox plushie and a lego olivia's space set.\nfrosty: Good choices, Jake. We will do our utmost to fulfill your wishes.","name":"Jake","location":"London","toy_list":["2023 Holiday Fox 12-Inch Plush","Lego Friends Olivia's Space Academy"]}
{"transcript":"caller: Frosty, it's me, Liam\nfrosty: Hello Liam! Where are you right now?\ncaller: In Toronto.\nfrosty: Wonderful. Now, Liam, what's on top of your wish list this holiday?\ncaller: I want a baby bee doll.\nfrosty: How exciting, Liam! We'll make sure the elves work towards that. Keep being awesome!","name":"Liam","location":"Toronto","toy_list":["Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"caller: Hi, it's Olivia\nfrosty: Hello Olivia. Can you tell me where are you right now?\ncaller: I'm in Los Angeles.\nfrosty: Fantastic, Olivia from Los Angeles! How about your holiday wish?\ncaller: I'd love a shark creator and a gabby dollhouse.\nfrosty: Olivia, your wish list is quite interesting! Elves will be excited to fulfill your wishes.","name":"Olivia","location":"Los Angeles","toy_list":["Beast Lab: Shark Beast Creator","Gabbys Dollhouse Cruise Ship"]}
{"transcript":"caller: Hello\nfrosty: Hi there! This is Frosty. Can I have your name, please?\ncaller: I'm Lily\nfrosty: Nice to meet you, Lily! Could you share your location with me?\ncaller: I'm from Cape Town in South Africa.\nfrosty: It's nice to meet a friend from Cape Town! So, Lily, what are your holiday wishes?\ncaller: I want a mickey playset and a furby.\nfrosty: Nice picks there, Lily! Elves will have a good time working on your wishes.","name":"Lily","location":"Cape Town, South Africa","toy_list":["Fisher-Price Little People Mickey and Friends Playset","Furby interactive plush toy"]}
{"transcript":"caller: Hi there!\nfrosty: Hello! Let's start with your name, please.\ncaller: I'm Max\nfrosty: Hello, Max. Where are you calling from?\ncaller: I'm in Melbourne, Australia\nfrosty: Wonderful! Max, from Melbourne, what would you like this holiday?\ncaller: Can I have a transformers bumblebee?\nfrosty: You surely can, Max! I'll tell the elves right away. Remember, keep being good!","name":"Max","location":"Melbourne, Australia","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"caller: Hello, Frosty\nfrosty: Hi, Can I get your name and location, please?\ncaller: My name is Noah, from Dublin, Ireland\nfrosty: How nice, Noah from Dublin! What toy would you like this holiday?\ncaller: I've been wishing for a ninja turtles delivery van\nfrosty: Great choice, Noah! I will make sure your message is sent. Keep being as cool as a ninja!","name":"Noah","location":"Dublin, Ireland","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Hello my little friend! What is your name?\ncaller: It's Erica.\nfrosty: Hi Erica! Where are you calling from?\ncaller: I'm in Los Angeles. \nfrosty: Splendid! Now, what would you like for the holiday?\ncaller: I want a bluey car and elmo plushie.\nfrosty: Got it, Erica. I will let Santa know! Promise to be good and hopeful, okay?","name":"Erica","location":"Los Angeles","toy_list":["Bluey Convertible and Figures","Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Ho ho ho! Who do we have here?\ncaller: My name is James but I want a furby and fox plushie for Christmas.\nfrosty: That's fun, James! And where are you calling from?\ncaller: I'm calling from Toronto. \nfrosty: Great! I'll make sure Santa gets your wish list. Keep being amazing!","name":"James","location":"Toronto","toy_list":["Furby interactive plush toy","2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"frosty: Howdy, young one! What's your name?\ncaller: I am Emily.\nfrosty: Nice to meet you Emily! Where are you calling from?\ncaller: Sydney, Australia.\nfrosty: Now, what do you wish for this holiday season?\ncaller: I want the new barbie dreamhouse.\nfrosty: Noted, Emily! Santa will be thrilled to hear that. Now keep spreading holiday cheer!","name":"Emily","location":"Sydney","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Merry Greetings! I would like to know your name?\ncaller: Hey Frosty, I'm Liam.\nfrosty: Hi Liam! And where are you calling from?\ncaller: From Dublin.\nfrosty: Great! Now, what's on your holiday wish list?\ncaller: I am wishing for spiderman playset and the baby bee doll.\nfrosty: That sounds exciting, Liam! I will ensure Santa hears about it. Stay hopeful and jolly!","name":"Liam","location":"Dublin","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset","Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"frosty: It's a pleasure to talk to you! What is your name?\ncaller: I'm George\nfrosty: Hi George! Where are you right now?\ncaller: I'm in Ottawa, Canada. \nfrosty: Wonderful! George, what would you like for the holiday?\ncaller: I would like the lola droid and the robot dog.\nfrosty: Those are awesome choices, George. I'll pass your wishes to Santa. Always believe in the magic of the season!","name":"George","location":"Ottawa","toy_list":["Star Wars LOLA animatronic droid","Dog-E"]}
{"transcript":"frosty: Season's Greetings! May I know your name?\ncaller: Yes, I am Mia and I want a pokemon plushie and a barbie science doll set.\nfrosty: Hi Mia! Where are you right now?\ncaller: I'm in London.\nfrosty: Remarkable! I'll make sure Santa gets your list. Have a magical holiday!","name":"Mia","location":"London","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Barbie Science Lab Playset"]}
{"transcript":"frosty: Hi there! What's your name?\ncaller: I am Olivia.\nfrosty: Good to meet you Olivia! Where are you calling from?\ncaller: From Auckland, New Zealand.\nfrosty: Can you tell me what you wish for this holiday?\ncaller: I am dreaming of a magic microscope.\nfrosty: That's really smart, Olivia! I'll tell Santa. Keep spreading the holiday cheer!","name":"Olivia","location":"Auckland","toy_list":["LeapFrog Magic Adventures Microscope"]}
{"transcript":"frosty: Greetings! Can you tell me your name?\ncaller: My name is Noah.\nfrosty: Hello Noah! And where are you?\ncaller: I'm in New York. \nfrosty: Fascinating! Noah, do you have a holiday wish?\ncaller: Yes, I want the ninja turtles delivery van and jurassic world dinosaur.\nfrosty: Some action-packed toys! I'll pass on your wishes to Santa, Noah. Remember to always be kind and caring!","name":"Noah","location":"New York","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van","Jurassic World Dominion Super Colossal Giganotosaurus"]}
{"transcript":"frosty: Ho Ho Ho! Who is speaking?\ncaller: I'm Emma.\nfrosty: Lovely to meet you Emma! Where are you calling from?\ncaller: I am in Perth, Australia.\nfrosty: Now, what is your holiday wish Emma?\ncaller: I want the fingerlings monkey and mickey playset.\nfrosty: Noted, Emma! Santa will be pleased to hear that. Continue to be a shining star!","name":"Emma","location":"Perth","toy_list":["Fingerlings","Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Hello my little friend! What's your name?\ncaller: I am Sophia, and I would love to get the lego olivia's space set.\nfrosty: Hi Sophia! Where are you calling from?\ncaller: I'm in San Francisco.\nfrosty: Wow! That's an awesome wish, Sophia! Santa will surely hear about it. Keep dreaming and stay joyful!","name":"Sophia","location":"San Francisco","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"caller: Hi, I'm Emily from New York.\nfrosty: Hi Emily! I'm Frosty, your holiday assistant. How old are you?\ncaller: I'm 6 years old.\nfrosty: Lovely age, Emily! What's on your holiday wish list this year?\ncaller: I want the fox plushie and the barbie science doll set.\nfrosty: That's wonderful Emily. The 2023 Holiday Fox 12-Inch Plush and Barbie Science Lab Playset are great choices! You'll have a lovely holiday with them. Stay excited!","name":"Emily","location":"New York","toy_list":["2023 Holiday Fox 12-Inch Plush","Barbie Science Lab Playset"]}
{"transcript":"caller: Hi, this is Lucas.\nfrosty: Hi Lucas! Where are you calling from?\ncaller: I'm calling from Los Angeles.\nfrosty: Fantastic! And how old are you Lucas?\ncaller: I just turned 8.\nfrosty: Happy belated birthday, Lucas! What would you like for your holiday gift?\ncaller: I want trasformers bumblebee.\nfrosty: Transformers Rise of the Beasts Beast-Mode Bumblebee, it is! It's going to be an exciting holiday for you, Lucas! Hold on to the excitement!","name":"Lucas","location":"Los Angeles","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"caller: Hey! I'm Bella and I want the gabby dollhouse.\nfrosty: Hi Bella! That's a lovely choice. Gabbys Dollhouse Cruise Ship will make your holiday special. By the way, where are you calling from?\ncaller: I'm calling from Toronto!\nfrosty: Oh, beautiful Toronto! Have a fantastic holiday, Bella!","name":"Bella","location":"Toronto","toy_list":["Gabbys Dollhouse Cruise Ship"]}
{"transcript":"caller: Hi, my name is Oliver.\nfrosty: Hello Oliver! Where are you calling from?\ncaller: From London.\nfrosty: Wonderful! What's on your holiday wish list this year, Oliver?\ncaller: Can I have bluey car and elmo plushie?\nfrosty: Of course, Oliver! Bluey Convertible and Figures and Sesame Street Monster Meditation Elmo will be your awesome holiday companions. Anticipate a fun-filled holiday!","name":"Oliver","location":"London","toy_list":["Bluey Convertible and Figures","Sesame Street Monster Meditation Elmo"]}
{"transcript":"caller: Hey Frosty, it's Jake from Houston.\nfrosty: Hi Jake! How old are you?\ncaller: I'm 7 years old.\nfrosty: Awesome age, Jake! What toys are you looking forward to this holiday?\ncaller: I want the pokemon plushie and mickey playset.\nfrosty: Nice choices, Jake! The Pokémon 8-Inch Plush First Partner Three-Pack and Fisher-Price Little People Mickey and Friends Playset are truly exciting gifts! It's going to be a joyous holiday for you. Stay thrilled!","name":"Jake","location":"Houston","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"caller: Hi, I'm Hannah.\nfrosty: Hello Hannah! Where are you calling from?\ncaller: Sydney, Australia.\nfrosty: Fantastic! How old are you Hannah?\ncaller: I just turned 9.\nfrosty: That's amazing, Hannah! And what would you like for your holiday gift?\ncaller: I'd love furby and the new barbie dreamhouse.\nfrosty: Furby interactive plush toy and Barbie Dreamhouse 2023, fantastic! Ready yourself for a fabulous holiday, Hannah! Anticipate lots of joy!","name":"Hannah","location":"Sydney","toy_list":["Furby interactive plush toy","Barbie Dreamhouse 2023"]}
{"transcript":"caller: Hi Frosty, it's Lily. Can I tell you what I want for the holidays?\nfrosty: Hi Lily! Of course, you can. What's on your wish list?\ncaller: I'd love fingerlings monkey and little pets surprise.\nfrosty: Fingerlings and Little Live Pets Mama Surprise would make your holidays super fun, Lily! By the way, where are you calling from?\ncaller: I'm from Dublin.\nfrosty: That's great Lily! Have a super fun holiday!","name":"Lily","location":"Dublin","toy_list":["Fingerlings","Little Live Pets Mama Surprise"]}
{"transcript":"caller: Hi, this is Ethan from San Francisco.\nfrosty: Hi Ethan! How old are you?\ncaller: I'm 5 years old.\nfrosty: Wonderful age, Ethan! Now, what's on your holiday wish list?\ncaller: I want robot dog and bitzee pet.\nfrosty: Dog-E and Bitzee interactive pet, those are fun! You're going to have a blast this holiday, Ethan! Stay excited!","name":"Ethan","location":"San Francisco","toy_list":["Dog-E","Bitzee interactive pet"]}
{"transcript":"caller: Hello! My name is Mia.\nfrosty: Hello Mia! Where are you calling from?\ncaller: I'm calling from Manchester.\nfrosty: Wonderful! How old are you Mia?\ncaller: I am 7 years old.\nfrosty: What a lovely age! What do you wish to have this holiday, Mia?\ncaller: Can I get lola droid and spiderman playset?\nfrosty: Certainly, Mia! Star Wars LOLA animatronic droid and Marvel's Spidey and His Amazing Friends Web Spinners playset are a terrific choice! Your holiday will be exciting. Anticipate much fun!","name":"Mia","location":"Manchester","toy_list":["Star Wars LOLA animatronic droid","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"caller: Hi, I'm Benjamin and I want the bluey playhouse for the holidays.\nfrosty: Hi Benjamin! That's a wonderful choice. Bluey Ultimate Lights and Sounds playhouse will surely fill your holiday with joy! May I ask where you are calling from?\ncaller: I'm from Atlanta.\nfrosty: Oh, Atlanta! Have a joyful holiday, Benjamin!","name":"Benjamin","location":"Atlanta","toy_list":["Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"caller: Hello! \nfrosty: Hi there, cheerful little elf! What's your name?\ncaller: I'm Bobby, I live in New York.\nfrosty: Nice to meet you, Bobby from New York! How old are you?\ncaller: I'm seven.\nfrosty: Excellent! What would you like for holiday, Bobby?\ncaller: I want a furby and a barbie science doll set.\nfrosty: Fantastic choices, Bobby! I'll make sure Santa gets your wish list. Have a jolly holiday!","name":"Bobby","location":"New York","toy_list":["Furby interactive plush toy","Barbie Science Lab Playset"]}
{"transcript":"caller: Hey there! \nfrosty: Hello, little mistletoe! May I know your name?\ncaller: Elsie.\nfrosty: Hi, Elsie! Where are you calling from?\ncaller: From Sydney.\nfrosty: Lovely! And what's your holiday wish this year, Elsie?\ncaller: I would like a gabby dollhouse.\nfrosty: A Gabby's Dollhouse Cruise Ship! That's a splendid choice, Elsie. Santa will be thrilled to hear about this. Happy Holidays!","name":"Elsie","location":"Sydney","toy_list":["Gabbys Dollhouse Cruise Ship"]}
{"transcript":"caller: Hello, Frosty! \nfrosty: Hi, little snowflake! What's your name?\ncaller: My name is Jack and I want a trasformers bumblebee.\nfrosty: Well, hello Jack! And where are you calling from?\ncaller: I'm calling from London.\nfrosty: Great! So that's a Transformers Rise of the Beasts Beast-Mode Bumblebee for Jack from London. Wishing you a joyful holiday, Jack!","name":"Jack","location":"London","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"caller: Hi! \nfrosty: Hello! Who's brightening my day today?\ncaller: I'm Lily from Toronto.\nfrosty: Hello, lovely Lily from Toronto! What would make your holiday extra special this year?\ncaller: I am hoping for a baby bee doll and a bluey car.\nfrosty: Two wonderful wishes! An Orijin Bees Lovey Coiley Baby Bee and a Bluey Convertible and Figures. That sounds like a merry holiday indeed, Lily. Ho Ho Ho!","name":"Lily","location":"Toronto","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Bluey Convertible and Figures"]}
{"transcript":"caller: Is this Frosty? \nfrosty: Yes, indeed! Who do I have the pleasure of speaking with?\ncaller: I'm Oliver.\nfrosty: It's nice to meet you, Oliver! Where are you calling from?\ncaller: I'm from San Francisco.\nfrosty: That's wonderful, Oliver! What two toys do you wish for this holiday?\ncaller: I would love the lola droid and elmo plushie.\nfrosty: The Star Wars LOLA animatronic droid and Sesame Street Monster Meditation Elmo are fantastic toys indeed! Santa will surely take note. Keep warm and happy holidays, Oliver!","name":"Oliver","location":"San Francisco","toy_list":["Star Wars LOLA animatronic droid","Sesame Street Monster Meditation Elmo"]}
{"transcript":"caller: Hey, Frosty! \nfrosty: Hello, jingle bell! What's your name?\ncaller: My name's Bella and I'd like a magna tiles set for my holiday wish.\nfrosty: Hello, Bella! Where are you calling from?\ncaller: I'm in Toronto.\nfrosty: Got it, Bella from Toronto wishes for a Magna-Tiles 32-piece set. We'll work on that! Happy Holidays, Bella!","name":"Bella","location":"Toronto","toy_list":["Magna-Tiles 32-piece set"]}
{"transcript":"caller: Hi, Frosty! \nfrosty: Hello there, sugarplum! What's your name?\ncaller: I'm Noah from London.\nfrosty: Hi Noah, nice to meet you! What are your holiday wishes this year?\ncaller: I'd love to have a ninja turtles delivery van and a playfoam letters.\nfrosty: Excellent choices, Noah! The Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van and Playfoam Naturals Shape & Learn Letters & Numbers sound terrific. I'll be sure to pass these on to Santa. Wishing you a wonderful holiday season!","name":"Noah","location":"London","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van","Playfoam Naturals Shape & Learn Letters & Numbers"]}
{"transcript":"caller: Hi there! \nfrosty: Hello, festive friend! May I ask your name?\ncaller: Emily.\nfrosty: Hi, Emily! Where are you calling from?\ncaller: I'm calling from Melbourne.\nfrosty: Wonderful! And what's your holiday wish, Emily?\ncaller: I wish for a pokemon plushie.\nfrosty: A Pokémon 8-Inch Plush First Partner Three-Pack, a delightful choice! Your holiday wish is noted. Keep warm and enjoy the season, Emily!","name":"Emily","location":"Melbourne","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"caller: Hey, Frosty! \nfrosty: Hi there, merry child! What's your name?\ncaller: My name is Ethan and I want the new barbie dreamhouse.\nfrosty: Hello Ethan! That's a fantastic choice. And where are you calling from?\ncaller: From Los Angeles.\nfrosty: So, the Barbie Dreamhouse 2023 for Ethan from Los Angeles! Noted. Here's to a fabulous holiday!","name":"Ethan","location":"Los Angeles","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"caller: Hello, Frosty! \nfrosty: Hello, little star! What's your name?\ncaller: I'm Mia, I live in Sydney.\nfrosty: Lovely to meet you, Mia from Sydney! How old are you?\ncaller: I'm six.\nfrosty: Wonderful! Do you have any special holiday wishes, Mia?\ncaller: Yes, I'd love a fingerlings monkey and a bluey playhouse.\nfrosty: How wonderful! A Fingerlings and Bluey Ultimate Lights and Sounds playhouse for Mia from Sydney. Santa will be very excited to hear about this. Have a very merry holiday!","name":"Mia","location":"Sydney","toy_list":["Fingerlings","Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"frosty: Happy Holidays! Frosty here! May I know your name, please?\ncaller: Hi Frosty! I'm Sophie.\nfrosty: Hey Sophie, lovely to meet you! Please tell me, where are you calling from?\ncaller: I'm from London.\nfrosty: Wonderful! Sophie, what would you like for this holiday season from the toy list?\ncaller: fox plushie and spiderman playset.\nfrosty: Sounds like fun, Sophie! I have added a 2023 Holiday Fox 12-Inch Plush and Marvel's Spidey and His Amazing Friends Web Spinners playset to your wish list. Have a magical holiday season!","name":"Sophie","location":"London","toy_list":["2023 Holiday Fox 12-Inch Plush","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Joyful greetings! It's Frosty here. Who's on the line?\ncaller: Hi Frosty, it's Ben.\nfrosty: Hello Ben, where are you calling from?\ncaller: I live in Sydney.\nfrosty: Great! Ben, what toys would you like for the holidays?\ncaller: the new barbie dreamhouse and furby.\nfrosty: Fabulous choices, Ben! For your holiday wishes, a Barbie Dreamhouse 2023 and a Furby interactive plush toy will be added to your list. Have a fantastic holiday!","name":"Ben","location":"Sydney","toy_list":["Barbie Dreamhouse 2023","Furby interactive plush toy"]}
{"transcript":"frosty: Greetings from the North Pole! Who's sharing the holiday spirit with me today?\ncaller: Hey Frosty, I'm Lily from New York.\nfrosty: Wonderful, Lily. And what would you like as a gift from our toy list?\ncaller: I'd love to get a trasformers bumblebee.\nfrosty: Excellent! I've added a Transformers Rise of the Beasts Beast-Mode Bumblebee to your wish list. Have a wonderful holiday, Lily!","name":"Lily","location":"New York","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Ho, Ho, Ho! Frosty here. Who am I speaking to today?\ncaller: Hi, Frosty! I'm Toby.\nfrosty: Hey Toby! And where are you?\ncaller: From Manchester.\nfrosty: How wonderful! Toby, what toys would you like for your holiday gift?\ncaller: I want the bluey car.\nfrosty: Fantastic choice, Toby! I've added the Bluey Convertible and Figures to your wish list. Enjoy your holidays!","name":"Toby","location":"Manchester","toy_list":["Bluey Convertible and Figures"]}
{"transcript":"frosty: Happy Holidays! It's Frosty, who's excited for Christmas?\ncaller: Me! It's Alice here.\nfrosty: Hello Alice, where are you from?\ncaller: I'm from Los Angeles.\nfrosty: That's amazing! Alice, what do you wish for Christmas from our toy list?\ncaller: I really want the baby bee doll and lego olivia's space set.\nfrosty: Terrific choices, Alice! An Orijin Bees Lovey Coiley Baby Bee and a Lego Friends Olivia's Space Academy are on your wish list. Have a sensational holiday!","name":"Alice","location":"Los Angeles","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Season's greetings! Frosty here. Who do I have the pleasure of chatting with?\ncaller: Hi Frosty! It's Peter from Toronto.\nfrosty: Hi Peter! So, what's your holiday wish from our toy list?\ncaller: I would love to get a lola droid.\nfrosty: That's a cool choice, Peter! I've added a Star Wars LOLA animatronic droid to your wish list. May your holidays be filled with joy!","name":"Peter","location":"Toronto","toy_list":["Star Wars LOLA animatronic droid"]}
{"transcript":"frosty: Merry Holidays! Can I know who's on the line?\ncaller: Hey Frosty, I am Mia.\nfrosty: Hi Mia! Where are you calling us from?\ncaller: I'm from Houston.\nfrosty: Fantastic! So Mia, which toys would you like for the holidays?\ncaller: barbie science doll set and mickey playset, please.\nfrosty: Great choices, Mia! Your wish list now contains a Barbie Science Lab Playset and a Fisher-Price Little People Mickey and Friends Playset. Enjoy your holiday!","name":"Mia","location":"Houston","toy_list":["Barbie Science Lab Playset","Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Holidays are here! This is Frosty. What's your name?\ncaller: It's Max here from Dublin.\nfrosty: Hello Max! What are your chosen gifts this holiday?\ncaller: I would love a gabby dollhouse and slime kit.\nfrosty: Fantastic! Gabbys Dollhouse Cruise Ship and a National Geographic Mega Slime Kit & Putty Lab have been added to your wish list. Have a jolly holiday, Max!","name":"Max","location":"Dublin","toy_list":["Gabbys Dollhouse Cruise Ship","National Geographic Mega Slime Kit & Putty Lab"]}
{"transcript":"frosty: Ho, Ho, Ho! Who's set for holiday cheer with Frosty?\ncaller: It's Emily!\nfrosty: Hello Emily. Where are you calling us from?\ncaller: From Vancouver.\nfrosty: Awesome! Emily, what do you wish to receive this holiday season from our toy list?\ncaller: I mostly want playfoam letters.\nfrosty: Wonderful, Emily! I've added Playfoam Naturals Shape & Learn Letters & Numbers to your wish list. Enjoy your magical holiday!","name":"Emily","location":"Vancouver","toy_list":["Playfoam Naturals Shape & Learn Letters & Numbers"]}
{"transcript":"frosty: Yuletide season! It's your friend Frosty here. Who do I have the joy of speaking to?\ncaller: Hi Frosty, it's Jack!\nfrosty: Hey Jack! Can you tell me where are you?\ncaller: From Melbourne.\nfrosty: Excellent! What toys would you like for the holiday season, Jack?\ncaller: magna tiles set and robot dog.\nfrosty: Superb, Jack! I've added a Magna-Tiles 32-piece set and a Dog-E to your wish list. Wishing you a fun and joyful holiday!","name":"Jack","location":"Melbourne","toy_list":["Magna-Tiles 32-piece set","Dog-E"]}
{"transcript":"frosty: Ho Ho Ho! Hello dear. My name is Frosty. May I know your name? \ncaller: Hi, I'm Andy.\nfrosty: Nice to meet you, Andy! Where are you from?\ncaller: I'm from London.\nfrosty: That's great Andy, London is a lovely place! So, what would you like Santa to bring you this holiday season? \ncaller: I would like the doctor kit and the baby bee doll.\nfrosty: Amazing choices Andy! Santa will be thrilled to bring the Orijin Bees Lovey Coiley Baby Bee and the doctor kit. Have a magical holiday!","name":"Andy","location":"London","toy_list":["Orijin Bees Lovey Coiley Baby Bee","doctor kit"]}
{"transcript":"frosty: Hello! Merry Christmas! My name is Frosty, what's yours?\ncaller: Hello, I'm Emma.\nfrosty: Nice to have you on the line, Emma. Where are you calling from?\ncaller: I'm from Sydney.\nfrosty: Sydney, what a lovely city! What gifts are on your Christmas list this year? \ncaller: I want a barbie science doll set and a Spiderman playset.\nfrosty: Fabulous choices Emma! Santa will be sure to bring the Barbie Science Lab Playset and Marvel's Spidey and His Amazing Friends Web Spinners playset. Stay excited!","name":"Emma","location":"Sydney","toy_list":["Barbie Science Lab Playset","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Happy Holidays dear friend! I am Frosty. What's your name?\ncaller: Hi Frosty, I'm Liam from Houston and I have a wish list.\nfrosty: Happy to meet you, Liam! I'm all ears for your wishes.\ncaller: I think the trasformers bumblebee and the bluey car would be really cool.\nfrosty: They sure are cool! Transformers Rise of the Beasts Beast-Mode Bumblebee and Bluey Convertible and Figures it is then. Happy Holidays Liam!","name":"Liam","location":"Houston","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Bluey Convertible and Figures"]}
{"transcript":"frosty: Seasons Greetings! My name's Frosty, could I know your name? \ncaller: Harley here.\nfrosty: Hello Harley! Where are you calling from? \ncaller: I am from Los Angeles.\nfrosty: It must be exciting living in Los Angeles, Harley! What gifts would you like this Christmas?\ncaller: Can I ask for the fortnite llama and the furby?\nfrosty: Of course, dear! Fortnite Llama Loot Plush and Furby interactive plush toy. Santa will be thrilled to know.","name":"Harley","location":"Los Angeles","toy_list":["Fortnite Llama Loot Plush","Furby interactive plush toy"]}
{"transcript":"frosty: Jingle bells, jingle bells! Hi there! I'm Frosty. Could I ask your name? \ncaller: Hey Frosty, I'm Lily from Toronto and my wish list is ready.\nfrosty: Hi Lily! Excited to hear your Christmas wish list!\ncaller: I'm really hoping to get the furby and the new barbie dreamhouse.\nfrosty: That's great! Barbie Dreamhouse 2023 and Furby interactive plush toy. I'll be sure to let Santa know, Lily. Enjoy the holidays!","name":"Lily","location":"Toronto","toy_list":["Barbie Dreamhouse 2023","Furby interactive plush toy"]}
{"transcript":"frosty: Hi! Frosty here to help you with your Christmas wishes! What's your name, my little friend?\ncaller: Hi Frosty, I'm Noah from Dublin.\nfrosty: Hello Noah! Dublin is a beautiful place! What's on your wish list this year?\ncaller: I'd really love the Pokemon plushie and the magic microscope.\nfrosty: Those sound amazing, Noah! Pokémon 8-Inch Plush First Partner Three-Pack and LeapFrog Magic Adventures Microscope it is then! Keep the excitement going!","name":"Noah","location":"Dublin","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","LeapFrog Magic Adventures Microscope"]}
{"transcript":"frosty: Merry Christmas, dear friend! I'm Frosty. Could I ask your name?\ncaller: I'm Olivia from Cape Town.\nfrosty: Happy to meet you, Olivia! What magic gifts would you like Santa to bring you this Christmas?\ncaller: I would love the magnet tiles set and the ninja turtles delivery van.\nfrosty: Magna-Tiles 32-piece set and Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van are cool choices Olivia! Rest assured, Santa got your message. Have a fun-filled holiday!","name":"Olivia","location":" Cape Town","toy_list":["Magna-Tiles 32-piece set","Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Happy Holidays! My name is Frosty. What's yours? \ncaller: Hi, I'm Mason.\nfrosty: Nice to meet you, Mason! Where are you from?\ncaller: I'm from Auckland.\nfrosty: Auckland sounds fabulous! What do you wish to get for Christmas, Mason? \ncaller: I would love to have the lego olivia's space set and the snap circuit set.\nfrosty: Lego Friends Olivia's Space Academy and Snap Circuits: Junior, it is then! Santa's elves are ready to pack them up for you. Merry Christmas, Mason!","name":"Mason","location":"Auckland","toy_list":["Lego Friends Olivia's Space Academy","Snap Circuits: Junior"]}
{"transcript":"frosty: Ho ho ho! Merry Christmas! What's your name, youngster? \ncaller: Hi Frosty! I'm Mia and I live in Wellington.\nfrosty: Nice to meet you Mia, Wellington is a wonderful place! What do you wish for Christmas this year?\ncaller: I would really like to have the barbie science doll set and the slime kit.\nfrosty: Barbie Science Lab Playset and National Geographic Mega Slime Kit & Putty Lab are perfect choices! Santa can't wait to deliver them to you. Have a wonderful Christmas, Mia!","name":"Mia","location":"Wellington","toy_list":["Barbie Science Lab Playset","National Geographic Mega Slime Kit & Putty Lab"]}
{"transcript":"frosty: Jingle bells, jingle bells!\ncaller: Hi Frosty! I'm Jacob from Melbourne.\nfrosty: Hello, Jacob! Melbourne, that's exciting! And what would you like for Christmas?\ncaller: I'm dreaming of the jurassic world dinosaur and the bumblebee transformer.\nfrosty: Magnificent dreams, Jacob! Jurassic World Dominion Super Colossal Giganotosaurus and Transformers Rise of the Beasts Beast-Mode Bumblebee. Your message is on its way to Santa! Merry Christmas!","name":"Jacob","location":"Melbourne","toy_list":["Jurassic World Dominion Super Colossal Giganotosaurus","Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Hi there, Happy Holidays! Who am I speaking with today?\ncaller: Hi Frosty, I'm Toby. \nfrosty: Hello Toby! Such a pleasure to meet you. Where are you calling from?\ncaller: I'm calling from London. \nfrosty: That's awesome, Toby! Tell me, what would you like Santa to bring you?\ncaller: I want the trasformers bumblebee and the fox plushie.\nfrosty: Transformers Bumblebee and a Fox Plushie, what fantastic choices! Santa will know. Keep being wonderful Toby!","name":"Toby","location":"London","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"frosty: Hello dear! Merry Christmas! What's your name, sweetheart?\ncaller: I'm Amy. \nfrosty: Nice to meet you, Amy. Can you tell Frosty what city you're in?\ncaller: Sydney.\nfrosty: Wonderful! So, what do you wish for Christmas this year?\ncaller: I would like a furby.\nfrosty: A Furby interactive plush toy, how exciting! Santa will be thrilled to hear your choice, Amy.","name":"Amy","location":"Sydney","toy_list":["Furby interactive plush toy"]}
{"transcript":"frosty: Happy Holidays! Can I know who is sharing this festive joy with Frosty?\ncaller: My name is Jack. I want the bluey car.\nfrosty: Hello Jack! Frosty is glad to hear your wish. May I know where you're calling from?\ncaller: I'm in Los Angeles.\nfrosty: Bluey Convertible and Figures for Jack in Los Angeles! Santa will know. Have a jolly holiday season!","name":"Jack","location":"Los Angeles","toy_list":["Bluey Convertible and Figures"]}
{"transcript":"frosty: Merry Christmas, dear friend! What's your name?\ncaller: Hi, I'm Sarah from Dublin. \nfrosty: Hi Sarah! Dublin, how wonderful! What is your Christmas wish this year?\ncaller: I really want the barbie science doll set.\nfrosty: The Barbie Science Lab Playset! Fantastic choice, Sarah. Santa is taking note! Have a fantastic Christmas!","name":"Sarah","location":"Dublin","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Hi! Who's on the line with Frosty today?\ncaller: Hi, I'm Billy and I live in Auckland. \nfrosty: Hi Billy! It's lovely to hear from Auckland. What toy would you like Santa to deliver?\ncaller: I would like the ninja turtles delivery van.\nfrosty: Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van, spectacular wish, Billy! Santa will certainly know.","name":"Billy","location":"Auckland","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Hello! Who do I have the pleasure of speaking to?\ncaller: Hi, I'm Lily!\nfrosty: Hi Lily, pleasure to meet you! And where is Lily calling from?\ncaller: I'm calling from Vancouver.\nfrosty: Oh, Vancouver, such a lovely place! Now, Lily, what gift would you like from Santa?\ncaller: The lego olivia's space set, please.\nfrosty: Lego Friends Olivia's Space Academy, what a splendid choice, Lily! Santa has taken note. Have a magical Christmas!","name":"Lily","location":"Vancouver","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Merry Christmas, my dear friend! May I know your name?\ncaller: Hi Frosty, I'm Ben from Toronto. \nfrosty: Hi Ben, lovely to hear from Toronto! What would you like for Christmas this year?\ncaller: I want the lola droid and the shark creator.\nfrosty: Star Wars LOLA animatronic droid and the Beast Lab: Shark Beast Creator, super cool choices, Ben! Santa will be so excited!","name":"Ben","location":"Toronto","toy_list":["Star Wars LOLA animatronic droid","Beast Lab: Shark Beast Creator"]}
{"transcript":"frosty: Hi there! Can you tell Frosty your name?\ncaller: Hi, I'm Emma.\nfrosty: Hello Emma, nice to meet you! Where are you calling us from?\ncaller: I'm from Chicago.\nfrosty: Nice to meet a friend from Chicago. What do you want Santa to bring you, Emma?\ncaller: I wish for the new barbie dreamhouse.\nfrosty: Barbie Dreamhouse 2023, what a fabulous choice Emma! Merry Christmas!","name":"Emma","location":"Chicago","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Merry Christmas! Who's adding joy to Frosty's day?\ncaller: I'm Lucas from New York City and I want the bitzee pet. \nfrosty: Hi Lucas! Bitzee interactive pet for Lucas from New York City, we got it! Have a wonderful Christmas!","name":"Lucas","location":"New York City","toy_list":["Bitzee interactive pet"]}
{"transcript":"frosty: Hello! What's the name of my special friend today?\ncaller: Hi Frosty, I'm Hannah. \nfrosty: Hi Hannah! It's great to meet you. Where are you calling from?\ncaller: From Melbourne. \nfrosty: Lovely! And what would you like for Christmas, Hannah?\ncaller: I would love the spiderman playset and the candy vending machine.\nfrosty: Marvel's Spidey and His Amazing Friends Web Spinners playset and the Thames & Kosmos Candy Vending Machine STEM experiment kit, got it! Hannah, have a beautiful Christmas!","name":"Hannah","location":"Melbourne","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset","Thames & Kosmos Candy Vaping Machine STEM experiment kit"]}
{"transcript":"Frosty: Hi there, happy holidays! What's your name and how can I help you today? \nCaller: Hi, I'm Noah from Manchester. \nFrosty: Hi Noah, it's lovely to meet you! What would you like Santa to bring you this holiday season? \nCaller: I would love the bluey car and the baby bee doll! \nFrosty: Those sound like fantastic gifts! Bluey Convertible and Figures and Orijin Bees Lovey Coiley Baby Bee will be added to your wish list. I hope you have a magical holiday, Noah!","name":"Noah","location":"Manchester","toy_list":["bluey car","baby bee doll"]}
{"transcript":"Frosty: Happy holidays! What's your name sweetie? \nCaller: I am Mia! \nFrosty: So lovely to meet you, Mia! From Where are you calling? \nCaller: I am calling from Sydney. \nFrosty: Alright Mia, what would like Santa to bring you this holiday? \nCaller: I want the barbie science doll set and furby. \nFrosty: Barbie Science Lab Playset and Furby interactive plush toy! Great choices, Mia. They'll be added to your wish list. Wishing you a splendid holiday!","name":"Mia","location":"Sydney","toy_list":["barbie science doll set","furby"]}
{"transcript":"Frosty: Ho ho ho! What's your name, young friend? \nCaller: My name's Jack, and I want the trasformers bumblebee and gabby dollhouse. \nFrosty: Transformers Rise of the Beasts Beast-Mode Bumblebee and Gabbys Dollhouse Cruise Ship, fantastic choices, Jack! We'll make sure Santa gets the message. Happy Holidays!","name":"Jack","location":"Unknown","toy_list":["trasformers bumblebee","gabby dollhouse"]}
{"transcript":"Frosty: Hi, buddy! What's your name? \nCaller: It's Lily from Wellington. \nFrosty: Hi Lily, wonderful to meet you! What presents are you wishing for this holiday season? \nCaller: I wish for the lego olivia's space set! \nFrosty: Lego Friends Olivia's Space Academy it is! Santa's already excited to deliver your gift. Have a joyful holiday, Lily!","name":"Lily","location":"Wellington","toy_list":["lego olivia's space set"]}
{"transcript":"Frosty: Happy holidays! What's your name and what can Santa bring you this year? \nCaller: I'm called Ethan. I would love the fox plushie and fingerlings monkey! \nFrosty: The 2023 Holiday Fox 12-Inch Plush and Fingerlings, Ethan? Wonderful choices! They've been added to your wish list. Hope you have a festive holiday!","name":"Ethan","location":"Unknown","toy_list":["fox plushie","fingerlings monkey"]}
{"transcript":"Frosty: Hello there, may I ask your name? \nCaller: Hi, I'm Emily from London. \nFrosty: It's great to meet you Emily! What can Santa bring you for Christmas this year? \nCaller: I would like the new barbie dreamhouse. \nFrosty: Barbie Dreamhouse 2023? That sounds like an amazing gift. It's on your wish list now. Wishing you a magical Christmas, Emily!","name":"Emily","location":"London","toy_list":["the new barbie dreamhouse"]}
{"transcript":"Frosty: Merry Christmas! What is your name, little one? \nCaller: Hi, I am Olivia! \nFrosty: Nice to meet you, Olivia! Where are you calling from? \nCaller: From Ottawa. \nFrosty: What is your Christmas wish, Olivia? \nCaller: Can I have the bitzee pet, please? \nFrosty: Of course! The Bitzee can't wait to be your new friend. May all your Christmas wishes come true, Olivia!","name":"Olivia","location":"Ottawa","toy_list":["bitzee pet"]}
{"transcript":"Frosty: Hello! What's your name, friend? \nCaller: My name's Harry, and I want the pokemon plushie and spiderman playset. \nFrosty: Pokémon 8-Inch Plush First Partner Three-Pack and Marvel's Spidey and His Amazing Friends Web Spinners playset, splendid choices, Harry! They'll be on your list. Enjoy your holiday season!","name":"Harry","location":"Unknown","toy_list":["pokemon plushie","spiderman playset"]}
{"transcript":"Frosty: Ho ho ho! What's your name, little one? \nCaller: Hi, I'm Sophie from Perth. \nFrosty: Hello Sophie, nice to meet you! Tell me, what would you like for Christmas this year? \nCaller: I would like the shark creator, please. \nFrosty: Beast Lab: Shark Beast Creator! It's going to be fun. I shall note it down. Merry Christmas, Sophie!","name":"Sophie","location":"Perth","toy_list":["shark creator"]}
{"transcript":"Frosty: Hi there! May I know your name, please? \nCaller: Hi, I'm Gabriel from Los Angeles. \nFrosty: Nice to meet you Gabriel! What Christmas presents are you hoping for? \nCaller: I would love jurassic world dinosaur and bluey playhouse! \nFrosty: Jurassic World Dominion Super Colossal Giganotosaurus and Bluey Ultimate Lights and Sounds playhouse! Sounds like you'll have heaps of fun. They're now on your wish list. Wish you a fun-filled Christmas, Gabriel!","name":"Gabriel","location":"Los Angeles","toy_list":["jurassic world dinosaur","bluey playhouse"]}
{"transcript":"caller: Hello! \nfrosty: Well, hello there! Frosty, the holiday helper, at your service. Can I have your name, please?\ncaller: I'm Jimmy. \nfrosty: Nice to meet you, Jimmy! Where are you calling from today?\ncaller: From Sydney. \nfrosty: Ah, Sydney! Fantastic. And what would you like for a gift this year, Jimmy?\ncaller: a barbie science doll set and a fox plushie.\nfrosty: A Barbie Science Lab Playset and a 2023 Holiday Fox 12-Inch Plush. Fantastic choices, Jimmy! I can't wait to tell Santa.","name":"Jimmy","location":"Sydney","toy_list":["Barbie Science Lab Playset","2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"caller: Hi, Frosty!\nfrosty: Hello, hello! What's your name, my little friend?\ncaller: My name is Lucy. I live in Dallas. \nfrosty: Wonderful, Lucy from Dallas! And what's on your holiday wish list this year?\ncaller: I want the new barbie dreamhouse and a furby.\nfrosty: Got it, the Barbie Dreamhouse 2023 and a Furby interactive plush toy. I'll pass your wish to Santa, Lucy.","name":"Lucy","location":"Dallas","toy_list":["Barbie Dreamhouse 2023","Furby interactive plush toy"]}
{"transcript":"caller: Hello, Frosty! \nfrosty: Well, hello! May I know your name please?\ncaller: I'm Lily, I wish for transformers bumblebee.\nfrosty: It's nice to meet you Lily. Where are you calling from?\ncaller: I'm from London.\nfrosty: Excellent! A Transformers Rise of the Beasts Beast-Mode Bumblebee is on your wish list, Lily. I'll be sure to tell Santa.","name":"Lily","location":"London","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"caller: Hi! \nfrosty: Hello! What's your name, little one?\ncaller: I'm Max. \nfrosty: Lovely to meet you, Max. Where are we chatting from today?\ncaller: From Toronto. \nfrosty: Super! And what's on your wish list, Max?\ncaller: I want a bitzee pet and slime kit.\nfrosty: Noted! A Bitzee interactive pet and a National Geographic Mega Slime Kit & Putty Lab. Great choices, Max!","name":"Max","location":"Toronto","toy_list":["Bitzee interactive pet","National Geographic Mega Slime Kit & Putty Lab"]}
{"transcript":"caller: Hey, Frosty!\nfrosty: Hey! What's your name, champ?\ncaller: I'm Sam. I'd really like a robot dog for the holidays.\nfrosty: Pleasure to meet you, Sam! Where are you calling from?\ncaller: I'm calling from Los Angeles.\nfrosty: Cool! A Dog-E is on your list, I'll let Santa know, Sam.","name":"Sam","location":"Los Angeles","toy_list":["Dog-E"]}
{"transcript":"caller: Hi there, Frosty! \nfrosty: Hi there! And you are?\ncaller: I'm Molly from Auckland. \nfrosty: Great to meet you, Molly from Auckland! What would you like for the holidays?\ncaller: Can I ask for little pets surprise and pokemon plushie?\nfrosty: Of course, Molly. A Little Live Pets Mama Surprise and a Pokémon 8-Inch Plush First Partner Three-Pack. Wonderful choices!","name":"Molly","location":"Auckland","toy_list":["Little Live Pets Mama Surprise","Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"caller: Hello! \nfrosty: Hello, little friend! What's your name?\ncaller: I'm Jack and want ninja turtles delivery van.\nfrosty: Hi, Jack! Where are you calling from?\ncaller: From San Francisco.\nfrosty: Brilliant! A Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van will be part of your wish list. I'll inform Santa right away, Jack.","name":"Jack","location":"San Francisco","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"caller: Hello, I'm Katie! \nfrosty: Hello, Katie! Where are you calling from?\ncaller: From Cape Town. \nfrosty: Lovely Cape Town! What gifts do you wish for, Katie?\ncaller: mickey playset and lola droid please.\nfrosty: A Fisher-Price Little People Mickey and Friends Playset and a Star Wars LOLA animatronic droid. I'll report your wishes to Santa, Katie, don't worry.","name":"Katie","location":"Cape Town","toy_list":["Fisher-Price Little People Mickey and Friends Playset","Star Wars LOLA animatronic droid"]}
{"transcript":"caller: Hi, Frosty!\nfrosty: Hi, dear! What's your name?\ncaller: I'm Bella and I want a magic microscope.\nfrosty: Hello, Bella! And where are you calling from?\ncaller: From Perth.\nfrosty: Got it, Bella! A LeapFrog Magic Adventures Microscope is on your holiday wish list. I'll make sure Santa knows.","name":"Bella","location":"Perth","toy_list":["LeapFrog Magic Adventures Microscope"]}
{"transcript":"caller: Hey, Frosty! \nfrosty: Hey, my little friend! May I have your name, please?\ncaller: I'm Ethan. \nfrosty: It's wonderful to meet you, Ethan! Where are you from?\ncaller: I'm calling from Wellington.\nfrosty: That's great, Ethan. What do you wish for this holiday season?\ncaller: I would like a spiderman playset and fingerlings monkey.\nfrosty: Marvel's Spidey and His Amazing Friends Web Spinners playset and Fingerlings! Those are some exciting gifts, Ethan. I'll be sure to let Santa know.","name":"Ethan","location":"Wellington","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset","Fingerlings"]}
{"transcript":"Frosty: Hello, Little one! This is Frosty, the friendly voice bot. Who am I speaking with?\nCaller: Hi Frosty! I'm Amy! \nFrosty: Nice to meet you, Amy. Where are you calling from?\nCaller: I am calling from Los Angeles.\nFrosty: Oh wow, Sunny Los Angeles. Can you tell me Amy, which toy would you like as a gift this holiday?\nCaller: I love furby and the baby bee doll.\nFrosty: Outstanding choices, Amy! The Furby Interactive Plush Toy and Orijin Bees Lovey Coiley Baby Bee have been noted. This will be a lovely surprise. Thanks for calling, and I hope your holiday is fantastic!","name":"Amy","location":"Los Angeles","toy_list":["Furby interactive plush toy","Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"Frosty: Hi there, darling! This is Frosty! May I have your name, please?\nCaller: Hi Frosty! I'm Tom.\nFrosty: Lovely! Where are you calling from, Tom?\nCaller: I'm calling from Melbourne.\nFrosty: Wow! Melbourne, Australia. How exciting! What's on your wish list this holiday season, Tom?\nCaller: I would love to have bluey car and lego olivia's space set.\nFrosty: That sounds great! Bluey Convertible and Figures and Lego Friends Olivia's Space Academy will be great gifts. Thank you for sharing, Tom! Happy Holidays!","name":"Tom","location":"Melbourne","toy_list":["Bluey Convertible and Figures","Lego Friends Olivia's Space Academy"]}
{"transcript":"Frosty: Greetings! You're chatting with Frosty. What's your name?\nCaller: Hello, Frosty! My name is Lila.\nFrosty: It's my pleasure to meet you, Lila! And where are you calling from?\nCaller: From Toronto.\nFrosty: Fantastic, Lila from Toronto! What toys are you looking forward to this holiday?\nCaller: I want a furby and the new barbie dreamhouse.\nFrosty: Perfect choices, Lila! The Furby Interactive Plush Toy and Barbie Dreamhouse 2023 are going to be magical gifts. Have a splendid holiday!","name":"Lila","location":"Toronto","toy_list":["Furby interactive plush toy","Barbie Dreamhouse 2023"]}
{"transcript":"Frosty: Hello, sweetie! Frosty here! Can you tell me your name?\nCaller: Hi Frosty, I'm Sara!\nFrosty: Hi, Sara! And where are you today?\nCaller: I’m in Dublin!\nFrosty: Dublin! That's fantastic. So, what would you like as your Christmas gift, Sara?\nCaller: I wish for a trasformers bumblebee and a spiderman playset.\nFrosty: Those are fantastic! Transformers Rise of the Beasts Beast-Mode Bumblebee and Marvel's Spidey and His Amazing Friends Web Spinners playset! I'll note them down. Have a spectacular holiday, Sara!","name":"Sara","location":"Dublin","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"Frosty: Good day! This is Frosty. Could you tell me your name?\nCaller: Hi Frosty, I'm Max!\nFrosty: Hello, Max! Where are you currently?\nCaller: I'm in Auckland.\nFrosty: Auckland, New Zealand! So exciting! What's on your Christmas wish list, Max?\nCaller: I would love to have a fox plushie and a bitzee pet.\nFrosty: Lovely choices! The 2023 Holiday Fox 12-Inch Plush and Bitzee Interactive Pet are going to make amazing gifts. Have a marvellous holiday, Max!","name":"Max","location":"Auckland","toy_list":["2023 Holiday Fox 12-Inch Plush","Bitzee interactive pet"]}
{"transcript":"frosty: Hi there! This is Frosty! Who am I speaking with today? \ncaller: Hey Frosty, I'm Lily.\nfrosty: Hi Lily! So nice to meet you! Where are you calling from? \ncaller: I'm calling from Sydney! \nfrosty: That's wonderful, Lily! And what presents would you like from Santa this year? \ncaller: I'd love a fox plushie and the lego olivia's space set.\nfrosty: Great choices, Lily! I'm sure you'll have a lot of fun with the 2023 Holiday Fox 12-Inch Plush and the Lego Friends Olivia's Space Academy. Let's hope Santa gets your message! Happy Holidays, Lily!","name":"Lily","location":"Sydney","toy_list":["fox plushie","lego olivia's space set"]}
{"transcript":"frosty: Hello there, happy holidays! Who's excited for Santa's visit this year?  \ncaller: Hi Frosty, It's Jack from Manchester!\nfrosty: Hi Jack from Manchester! There's only one thing missing - your Christmas list! What would you like from Santa? \ncaller: I would definitely want the bluey car and a furby.\nfrosty: Those are fantastic choices, Jack! The Bluey Convertible and Figures and the Furby interactive plush toy are super fun! Let's hope Santa hears your wishes! Merry Christmas, Jack!","name":"Jack","location":"Manchester","toy_list":["bluey car","furby"]}
{"transcript":"frosty: Ho Ho Ho, Frosty speaking! Who do I have the pleasure of chatting with today? \ncaller: Hello Frosty, I'm Emma.\nfrosty: Hi Emma! It's a joy to meet you! Where are you calling me from?  \ncaller: I'm calling from New York.\nfrosty: Brilliant, Emma! What toys do you want from Santa this year?  \ncaller: I’m wishing for the baby bee doll and the spiderman playset.\nfrosty: Great picks, Emma! The Orijin Bees Lovey Coiley Baby Bee and Marvel's Spidey and His Amazing Friends Web Spinners playset are really cool! Here's hoping Santa gets your list! Season's greetings, Emma!","name":"Emma","location":"New York","toy_list":["baby bee doll","spiderman playset"]}
{"transcript":"frosty: Hello! It's your pal Frosty! What's your name? \ncaller: Hi Frosty, it's Max.\nfrosty: Hi Max! So glad to hear from you! Now, where are you calling from?\ncaller: I'm from Los Angeles.\nfrosty: Fantastic, Max! What lovely gifts are you hoping for this holiday season? \ncaller: This Christmas I’d love barbie science doll set and snap circuit set.\nfrosty: Excellent choices, Max! The Barbie Science Lab Playset and Snap Circuits: Junior will keep you excited and engaged! Let's hope Santa is taking notes! Happy Holidays, Max!","name":"Max","location":"Los Angeles","toy_list":["barbie science doll set","snap circuit set"]}
{"transcript":"frosty: Hey there, who do we have on the line today? \ncaller: Hi Frosty, my name is Mia.\nfrosty: It's great to meet you, Mia! Where are you calling from? \ncaller: I'm speaking from Toronto.\nfrosty: That's wonderful, Mia! Now, what do you hope Santa brings you this holiday season?  \ncaller: Well, I would love to have the pokemon plushie and the new barbie dreamhouse.\nfrosty: Those are great picks, Mia! The Pokémon 8-Inch Plush First Partner Three-Pack and the Barbie Dreamhouse 2023 will surely bring lots of fun! Let's hope Santa is listening! Happy Holidays, Mia!","name":"Mia","location":"Toronto","toy_list":["pokemon plushie","the new barbie dreamhouse"]}
{"transcript":"frosty: Ho Ho Ho! Hello there, little one! I'm Frosty. Could you tell me your name?\ncaller: Hi Frosty, I'm Emily!\nfrosty: It's nice to meet you Emily. Where are you calling from?\ncaller: From Sydney.\nfrosty: Wonderful! Now, Emily from Sydney what's your favourite toy from the list?\ncaller: I want a fox plushie and barbie science doll set.","name":"Emily","location":"Sydney","toy_list":["2023 Holiday Fox 12-Inch Plush","Barbie Science Lab Playset"]}
{"transcript":"frosty: Hello! Merry Christmas! I am Frosty. What's your name, little friend?\ncaller: My name is Ethan and I want bluey car and bitzee pet.\nfrosty: Pleasure meeting you Ethan! And where are you this beautiful season?\ncaller: In New York, Frosty.","name":"Ethan","location":"New York","toy_list":["Bluey Convertible and Figures","Bitzee interactive pet"]}
{"transcript":"frosty: Ho ho ho! I'm Frosty, and who do I have the pleasure of speaking with?\ncaller: I'm Jacob.\nfrosty: Nice to meet you Jacob! And where are you calling from?\ncaller: I'm from London.\nfrosty: Wonderful! What do you wish for this Christmas Jacob?\ncaller: I want the new barbie dreamhouse.","name":"Jacob","location":"London","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Merry Christmas, dear child! My name is Frosty! Can you tell me your name?\ncaller: Hi, I'm Molly from Toronto.\nfrosty: Oh nice! And Molly, what are your two most wanted toys for this Christmas?\ncaller: I want furby, and the spiderman playset.","name":"Molly","location":"Toronto","toy_list":["Furby interactive plush toy","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Greetings! I'm Frosty. May I know your name?\ncaller: Hello! I’m Jack.\nfrosty: Hi Jack! Where are you calling from?\ncaller: From Melbourne.\nfrosty: Marvelous! Now, could you tell me which toy from the list you'd like?\ncaller: ninja turtles delivery van, please.","name":"Jack","location":"Melbourne","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Ho Ho Ho! What's your name, my little friend?\ncaller: I'm Olivia from Dallas.\nfrosty: Wonderful! Olivia, share with me your wish.\ncaller: I really want the lego olivia's space set.","name":"Olivia","location":"Dallas","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Warm holiday greetings! I'm Frosty. What's your name, dear caller?\ncaller: Hi Frosty! My name is Aidan.\nfrosty: Hi Aidan! Where are you speaking from?\ncaller: I am from Wellington.\nfrosty: Oh, New Zealand! So, Aidan, what's your Christmas wish?\ncaller: I wish for beast creator and magic microscope.","name":"Aidan","location":"Wellington","toy_list":["Beast Lab: Shark Beast Creator","LeapFrog Magic Adventures Microscope"]}
{"transcript":"frosty: Ho ho ho! I'm Frosty. Who am I speaking with?\ncaller: Hey Frosty, I'm Mia from Los Angeles.\nfrosty: Lovely Mia, what toy do you wish for?\ncaller: Can I ask for elmo plushie and gabby dollhouse?","name":"Mia","location":"Los Angeles","toy_list":["Sesame Street Monster Meditation Elmo","Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Ho Ho Ho! I'm Frosty. Could you tell me your name, my little friend?\ncaller: Hi, I'm Ethan, can I ask for the trasformers bumblebee?\nfrosty: Of course Ethan! But, before that, where are you calling from?\ncaller: From Chicago.","name":"Ethan","location":"Chicago","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Howdy! Santa's pal Frosty speaking. Who's on the line?\ncaller: My name is Lily. And I want pokemon plushie and fingerlings monkey.\nfrosty: It's nice to meet you Lily! Where are you calling from?\ncaller: I'm in Auckland, New Zealand.","name":"Lily","location":"Auckland","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Fingerlings"]}
{"transcript":"frosty: Ho! Ho! Hello there! What's your name, little one?\ncaller: Hello! I'm Tommy from London.\nfrosty: Lovely to meet you, Tommy from the lively city of London! How old are you?\ncaller: I am 7 years old.\nfrosty: What a grand age! Now, Tommy, could you tell me what you would like for the holidays?\ncaller: I want the bumblebee and elmo plushie.\nfrosty: Excellent choices, Tommy. The Transformers Bumblebee and Elmo Plushie will definitely make your holidays feel warmer and filled with fun. Hope your wishes come true.","name":"Tommy","location":"London","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Merry Greetings! May I know who do I have the pleasure of speaking to?\ncaller: My name is Daisy.\nfrosty: Such a lovely name, Daisy! Where are you calling from?\ncaller: I'm from Sydney.\nfrosty: How wonderful, Daisy from Sydney! And how old are you?\ncaller: I'm 6 years old.\nfrosty: That's wonderful. Daisy, could you tell me what would make your holiday season special? \ncaller: Can I have the lego olivia's space set and a furby, please?\nfrosty: Your wish is noted, Daisy. LEGO Friends Olivia's Space Academy and Furby interactive plush toy sounds like amazing choices. Hoping they end up in your stockings.","name":"Daisy","location":"Sydney","toy_list":["Lego Friends Olivia's Space Academy","Furby interactive plush toy"]}
{"transcript":"frosty: Seasons Greetings! Who do I have on the call?\ncaller: I'm Sam and I want the mickey playset.\nfrosty: Hello Sam! You didn't tell me where you're from?\ncaller: I live in New York.\nfrosty: Thank you for sharing, Sam from New York. The Fisher-Price Little People Mickey and Friends Playset will indeed light up your holiday season. Wish you all the best!","name":"Sam","location":"New York","toy_list":["Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Ho, Ho, Ho! What's your name, dear child?\ncaller: My name is Amelia.\nfrosty: Hello, Amelia! And where are you calling from?\ncaller: I'm from Auckland.\nfrosty: Wonderful! Amelia from Auckland! How old are you?\ncaller: I'm 8 years old.\nfrosty: Great! Now, Amelia, what do you want this holiday season?\ncaller: Can I have the baby bee doll and the spiderman playset?\nfrosty: Absolutely! Orijin Bees Lovey Coiley Baby Bee and Marvel's Spidey playset are fun choices. Sending you lots of holiday cheer, Amelia!","name":"Amelia","location":"Auckland","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Merry Christmas! Who's excited to speak with Frosty today?\ncaller: I am! I'm Charlie.\nfrosty: Hello Charlie! Where are you calling from today?\ncaller: I'm from Manchester.\nfrosty: Fantastic! And what would little Charlie from Manchester like this Christmas?\ncaller: I want the bluey car and bitzee pet.\nfrosty: Brilliant choices, Charlie! The Bluey Convertible and Figures along with the Bitzee Interactive Pet will surely make your Christmas a memorable one. Hoping your wishes come true!","name":"Charlie","location":"Manchester","toy_list":["Bluey Convertible and Figures","Bitzee Interactive Pet"]}
{"transcript":"frosty: Hi there! I am Frosty. What's your name, little friend?\ncaller: Hi Frosty, I'm Billy.\nfrosty: Nice to meet you, Billy! Where do you live?\ncaller: I live in Boston.\nfrosty: Wonderful. And what are two toys you wish for this holiday?\ncaller: I want furby and the bluey car.","name":"Billy","location":"Boston","toy_list":["Furby interactive plush toy","Bluey Convertible and Figures"]}
{"transcript":"frosty: Hello! This is Frosty. Can I know your name, please?\ncaller: I'm Lucy from Los Angeles and I wish for the baby bee doll.\nfrosty: Hello, Lucy. It's lovely to hear from Los Angeles! Your wish for Orijin Bees Lovey Coiley Baby Bee is noted. Any other toy you'd like?","name":"Lucy","location":"Los Angeles","toy_list":["Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"frosty: Hi! I'm Frosty. And you are?\ncaller: I'm Jenny.\nfrosty: Where are you calling from, Jenny?\ncaller: Sydney.\nfrosty: Awesome! Now, tell me one or two toys you have in mind for this holiday.\ncaller: barbie science doll set and elmo plushie please.","name":"Jenny","location":"Sydney","toy_list":["Barbie Science Lab Playset","Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Hi there! I'm Frosty. What's your name?\ncaller: Hi Frosty, I'm Max from London.\nfrosty: Hello, Max from London. Could you tell me what toys you'd like this holiday?\ncaller: I would like the trasformers bumblebee and pokemon plushie.","name":"Max","location":"London","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Hello! Frosty here. May I know your name, little friend?\ncaller: My name is Thomas.\nfrosty: Hi, Thomas. Where are you from?\ncaller: I'm from Toronto.\nfrosty: Great! Now, what toys can I put on your wish list?\ncaller: I wish for gabby dollhouse and mickey playset.","name":"Thomas","location":"Toronto","toy_list":["Gabbys Dollhouse Cruise Ship","Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Hi! I'm Frosty. Can I have your name, please?\ncaller: Hi Frosty, I'm Sophia and I live in Dallas. I want the new barbie dreamhouse for the holidays.\nfrosty: Hello, Sophia. Dallas is a lovely place! Your wish for Barbie Dreamhouse 2023 is noted. Any other toy you'd like?","name":"Sophia","location":"Dallas","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Hello! This is Frosty. What's your name?\ncaller: I'm Ethan.\nfrosty: Hi, Ethan. Where are you calling from?\ncaller: I'm calling from Perth.\nfrosty: Fantastic! And what toys do you wish for this holiday?\ncaller: I wish for little pets surprise and lego olivia's space set.","name":"Ethan","location":"Perth","toy_list":["Little Live Pets Mama Surprise","Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Hi there! Frosty here. Can I know your name, little friend?\ncaller: I'm Mia. I want the furby and fingerlings monkey for Christmas.\nfrosty: Nice to hear from you, Mia. Where are you from?\ncaller: I'm from New York.\nfrosty: Your wishes for Furby interactive plush toy and Fingerlings are noted, Mia from New York!","name":"Mia","location":"New York","toy_list":["Furby interactive plush toy","Fingerlings"]}
{"transcript":"frosty: Hello! I'm Frosty. And you are?\ncaller: I'm Noah from Chicago. and I wish to have the robot dog.\nfrosty: Hello, Noah from Chicago. I noted your wish for Dog-E. Is there another toy you'd like?","name":"Noah","location":"Chicago","toy_list":["Dog-E"]}
{"transcript":"frosty: Hi! Frosty speaking. May I have your name, please?\ncaller: My name is Ava.\nfrosty: Hello Ava. Where are you calling from?\ncaller: I'm calling from San Francisco.\nfrosty: Wonderful. Now, tell me one or two toys you have in mind for this holiday.\ncaller: I wish for bitzee pet and lola droid.","name":"Ava","location":"San Francisco","toy_list":["Bitzee interactive pet","Star Wars LOLA animatronic droid"]}
{"transcript":"frosty: Hello there, happy holidays! What's your name, little one?\ncaller: Hi Frosty, I'm Bella!\nfrosty: Hi Bella! Where are you calling from?\ncaller: I am calling from Sydney.\nfrosty: Wonderful! Now, what would you like for the holiday?\ncaller: I want a fox plushie and a spiderman playset.\nfrosty: Great choices Bella! Fox Plushie and Spiderman Playset. I have made a note of that. Wishing you the happiest holidays!","name":"Bella","location":"Sydney","toy_list":["2023 Holiday Fox 12-Inch Plush","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Happy holidays! What's your name, kiddo?\ncaller: Hi Frosty, my name is Max from Boston.\nfrosty: Hello Max from Boston! Now what can Frosty add to your wish list?\ncaller: I would like a pokemon plushie and a robot dog.\nfrosty: Pokemon Plushie and Robot Dog, got it! Have a joyous holiday season, Max!","name":"Max","location":"Boston","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Dog-E"]}
{"transcript":"frosty: Hello, happy holidays! Who do I have the pleasure of speaking to today?\ncaller: This is Lilly from San Francisco. \nfrosty: Nice to meet you, And what's your holiday wish, Lilly?\ncaller: I want a bluey car.\nfrosty: Bluey Convertible and Figures - got it! Wishing you a delightful holiday season, Lilly!","name":"Lilly","location":"San Francisco","toy_list":["Bluey Convertible and Figures"]}
{"transcript":"frosty: Happy holidays! Can you tell me your name, please?\ncaller: Hi Frosty! I'm Jacob from Toronto.\nfrosty: Hello Jacob! I bet you have a special toy in mind for this holiday season?\ncaller: Yes, I do! Can I have a lego olivia's space set and a furby?\nfrosty: Of course! Lego Friends Olivia's Space Academy and Furby. I've made a note. Enjoy the holidays, Jacob!","name":"Jacob","location":"Toronto","toy_list":["Lego Friends Olivia's Space Academy","Furby interactive plush toy"]}
{"transcript":"frosty: Happy holidays! What's your name, little friend?\ncaller: Hi, I'm Alice. \nfrosty: Hi Alice! And where are you calling from?\ncaller: I'm calling from London. \nfrosty: Lovely! What would you like for the holiday?\ncaller: I would love to have a barbie science doll set.\nfrosty: Barbie Science Lab Playset, a fantastic choice Alice! Wishing you the best of holidays!","name":"Alice","location":"London","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Hello there, happy holidays! Could you tell me your name, please?\ncaller: I am Sammy. frosty: Hi Sammy! Can you tell me where you're calling from?\ncaller: I am calling from Melbourne.\nfrosty: Great! Now, what's your holiday wish, Sammy?\ncaller: May I have the new barbie dreamhouse and a bitzee pet?\nfrosty: Of course, Sammy! Barbie Dreamhouse 2023 and Bitzee interactive pet it is. Have a wonderful holiday season!","name":"Sammy","location":"Melbourne","toy_list":["Barbie Dreamhouse 2023","Bitzee interactive pet"]}
{"transcript":"frosty: Happy holidays! Who's this calling?\ncaller: It's me, Mia from Dallas.\nfrosty: Hi Mia! So, what's your holiday wish?\ncaller: Can I have the trasformers bumblebee?\nfrosty: Transformers Rise of the Beasts Beast-Mode Bumblebee, an amazing choice! Happy Holidays, Mia!","name":"Mia","location":"Dallas","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Hello, happy holidays! What's your name, little one?\ncaller: Hi Frosty, I'm Ben calling from Vancouver.\nfrosty: Hi there, Ben! What would you like for the holiday?\ncaller: I would like to have the ninja turtles delivery van, please.\nfrosty: Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van! A great choice Ben! Wishing you the happiest holidays!","name":"Ben","location":"Vancouver","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Happy holidays! May I ask your name, please?\ncaller: Hi Frosty, I'm Emma from Dublin. \nfrosty: Hi Emma! I bet you have a special toy in mind?\ncaller: I do! I would love a jurassic world dinosaur and a candy vending machine.\nfrosty: Jurassic World Dominion Super Colossal Giganotosaurus and Thames & Kosmos Candy Vending Machine STEM experiment kit it is. Happy holidays, Emma!","name":"Emma","location":"Dublin","toy_list":["Jurassic World Dominion Super Colossal Giganotosaurus","Thames & Kosmos Candy Vending Machine STEM experiment kit"]}
{"transcript":"frosty: Hi there, happy holidays! What's your name?\ncaller: Hey Frosty, I'm Oliver.\nfrosty: Hi Oliver! Where are you calling from?\ncaller: From New York.\nfrosty: Wonderful! And what do you want for the holiday, Oliver?\ncaller: I want the lola droid and a slime kit.\nfrosty: Star Wars LOLA animatronic droid and National Geographic Mega Slime Kit & Putty Lab. Got it! Have a fantastically fun holiday, Oliver!","name":"Oliver","location":"New York","toy_list":["Star Wars LOLA animatronic droid","National Geographic Mega Slime Kit & Putty Lab"]}
{"transcript":"frosty: Hi there, it's Frosty! What's your name? caller: I'm Jack. frosty: Hi Jack! Where are you calling from? caller: I'm calling from Boston. frosty: Awesome! What's on your wish list this holiday? caller: I want the furby and the ninja turtles delivery van. frosty: Wonderful choices, Jack! I'm sure you'll have a lot of fun with those. Have a merry holiday!","name":"Jack","location":"Boston","toy_list":["furby","ninja turtles delivery van"]}
{"transcript":"frosty: Hello, this is Frosty! May I know your name? caller: Hi Frosty, I am Emily from Sydney. frosty: Hi Emily! Lovely to hear from Sydney. So, what do you wish for this holiday? caller: I wish for the baby bee doll and bluey car. frosty: Those are fantastic choices, Emily! Have a joyful holiday!","name":"Emily","location":"Sydney","toy_list":["baby bee doll","bluey car"]}
{"transcript":"frosty: Hey there! This is Frosty. Can I have your name, please? caller: Hey, I'm Jacob. frosty: Hello Jacob! Where are you from? caller: I am from Toronto. frosty: Great! So, what would you like this holiday? caller: I want lola droid. frosty: Fantastic choice, Jacob! I hope you'll have an adventurous holiday.","name":"Jacob","location":"Toronto","toy_list":["lola droid"]}
{"transcript":"frosty: Hello! Frosty here. What's your name, little friend? caller: I'm Lily. frosty: Hi Lily! Where are you calling from? caller: I'm from Los Angeles. frosty: That's a beautiful location! What would you like for the holidays? caller: I would like the magna tiles set. frosty: Sounds like you are going to have a creative holiday, Lily! Have a joyous one!","name":"Lily","location":"Los Angeles","toy_list":["magna tiles set"]}
{"transcript":"frosty: Hi there! This is Frosty. What's your name? caller: Hi Frosty, I am Andy from London. frosty: Hi Andy! What's on your holiday wish list this time? caller: Can I have the spiderman playset please? frosty: Absolutely Andy! It sounds like you're going to have a thrilling holiday! Have a merry one!","name":"Andy","location":"London","toy_list":["spiderman playset"]}
{"transcript":"frosty: Hello, this is Frosty. What's your name, dear caller? caller: Hi Frosty, I am Sarah. frosty: Hello Sarah! Where are you calling from? caller: I'm calling from Wellington. frosty: That's great! What wish would you like to be fulfilled this holiday? caller: I'd love it if I could get the barbie science doll set and the lego olivia's space set. frosty: Great choices, Sarah! Wishing you a scientific holiday!","name":"Sarah","location":"Wellington","toy_list":["barbie science doll set","lego olivia's space set"]}
{"transcript":"frosty: Hi! Frosty speaking. May I know your name? caller: I'm Ben. frosty: Nice to meet you, Ben! Which city are you calling from? caller: I'm calling from Cambridge. frosty: Cambridge! How lovely! So, what would you like for this festive season? caller: I would love the gabby dollhouse. frosty: Fantastic, Ben! Have an extraordinary holiday!","name":"Ben","location":"Cambridge","toy_list":["gabby dollhouse"]}
{"transcript":"frosty: Hello! Frosty the bot here. Can I have your name, please? caller: Hi there, I'm Molly from Ottawa. frosty: Hi Molly, wonderul to hear from Ottawa. Have you decided on your holiday wish list? caller: I want the snap circuit set and the playfoam letters. frosty: Those are brilliant choices, Molly! I'm sure you will have a educational and fun holiday. Merry times ahead!","name":"Molly","location":"Ottawa","toy_list":["snap circuit set","playfoam letters"]}
{"transcript":"frosty: Hi! This is Frosty. Who am I speaking with? caller: I'm Luke. frosty: Hi Luke! From where are you calling us today? caller: I'm from Dublin. frosty: Dublin! Amazing. And, what's your holiday gift wish, Luke? caller: Can I have the pokemon plushie? frosty: Absolutely, Luke! Here's to a merry holiday filled with adventures!","name":"Luke","location":"Dublin","toy_list":["pokemon plushie"]}
{"transcript":"frosty: Hello, this is Frosty. May I know your name? caller: Hello, I'm Lucy. frosty: Hi Lucy! What can I add to your gift list this holiday? caller: I would really like the barbie dreamhouse 2023. frosty: Noted, Lucy! Looks like you're in for a dreamy holiday!","name":"Lucy","location":"","toy_list":["the new barbie dreamhouse"]}
{"transcript":"frosty: Hello, merry holiday! Who do I have the pleasure of speaking to today?\ncaller: Hi, I'm Timmy from New Zealand.\nfrosty: It's so lovely to hear from you, Timmy from New Zealand! How old are you, buddy?\ncaller: I'm 6 years old.\nfrosty: Sounds wonderful, Timmy! What can Frosty add to your wish list from the North Pole?\ncaller: Can I have furby and barbie science doll set, please?\nfrosty: A Furby interactive plush toy and Barbie Science Lab Playset, that's a great choice! We will do our best to make your wishes come true. Keep your fingers crossed and believe in the holiday magic!","name":"Timmy","location":"New Zealand","toy_list":["furby","barbie science doll set"]}
{"transcript":"frosty: Seasons greetings! What's your name, Christmas star?\ncaller: Hello, I am Lucy.\nfrosty: Hi Lucy! Mind telling Frosty where you are calling from?\ncaller: I am calling from London.\nfrosty: Fantastic, we have you on the map now. May I know what wishes to note down for Santa?\ncaller: I want a fox plushie.\nfrosty: A 2023 Holiday Fox 12-Inch Plush, that's adorable! Santa will know about it. Keep believing in the magic of the holiday season, sweetie!","name":"Lucy","location":"London","toy_list":["fox plushie"]}
{"transcript":"frosty: Ho-ho-ho! And who do I have the pleasure of chatting with today?\ncaller: Hi Frosty, It's Sam!\nfrosty: Wonderful to meet you, Sam! And where are you calling from?\ncaller: I'm calling from Sydney, Australia.\nfrosty: Awesome! What would you like for holiday, Sam?\ncaller: I would like trasformers bumblebee.\nfrosty: Transformers Rise of the Beasts Beast-Mode Bumblebee, that sounds like a really fun toy! We'll put that on your wish list. Remember to be good and keep believing in holiday magic!","name":"Sam","location":"Sydney","toy_list":["trasformers bumblebee"]}
{"transcript":"frosty: Hi there! Who is this lovely child talking to Frosty?\ncaller: Hi, I'm Ava from New York.\nfrosty: Hi Ava! It's a pleasure to talk with you. What can Frosty help with for this holiday season?\ncaller: Can I have the new barbie dreamhouse?\nfrosty: Of course! Barbie Dreamhouse 2023, wow that's a fantastic choice. Let's add it to your wish list. Keep your fingers crossed and keep believing, Ava!","name":"Ava","location":"New York","toy_list":["the new barbie dreamhouse"]}
{"transcript":"frosty: Joyful greetings! Can I know who this sparkling star is?\ncaller: Hello, I am Ethan and I want lego olivia's space set and jurassic world dinosaur.\nfrosty: Hi Ethan! Lego Friends Olivia's Space Academy and Jurassic World Dominion Super Colossal Giganotosaurus, they are both brilliant! Frosty has noted down your wishes. Keep letting your imagination fly and believe in the magic of holiday!","name":"Ethan","location":"Not provided","toy_list":["lego olivia's space set","jurassic world dinosaur"]}
{"transcript":"frosty: Hello there! Who am I talking to on this jolly day?\ncaller: Hey Frosty, it's Lily from Ireland.\nfrosty: Wonderful to hear from you, Lily from Ireland! What can Santa pack for you?\ncaller: Could I have a bluey car?\nfrosty: A Bluey Convertible and Figures, what a fun gift! Santa will try his best to get it for you. Keep believing in the magic of the season, Lily!","name":"Lily","location":"Ireland","toy_list":["bluey car"]}
{"transcript":"frosty: Ho-ho-ho! Who's this?\ncaller: Hey, I'm Max!\nfrosty: Hi Max! It's so good to meet you. Where are you calling from?\ncaller: I'm from Canada.\nfrosty: Lovely place. So, what toys are on your wish list, Max?\ncaller: I'd like to have ninja turtles delivery van and spiderman playset.\nfrosty: Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van and Marvel's Spidey and His Amazing Friends Web Spinners playset, impressive choices! We've noted them down for Santa. Remember to stay jolly and keep believing in magic!","name":"Max","location":"Canada","toy_list":["ninja turtles delivery van","spiderman playset"]}
{"transcript":"frosty: Howdy! Who am I speaking with?\ncaller: Hi Frosty, I'm Bella and I want fingerlings monkey.\nfrosty: Hi Bella, nice to meet you! A Fingerlings, that's a cool choice. Let me put it down on your wish list. Just remember to keep the holiday magic in your heart!","name":"Bella","location":"Not provided","toy_list":["fingerlings monkey"]}
{"transcript":"frosty: Hello hello! And who's this?\ncaller: I'm Michael and I'm from Texas.\nfrosty: Hi Michael from Texas! Could you tell Frosty what's on your wish list?\ncaller: I want a lola droid.\nfrosty: A Star Wars LOLA animatronic droid, that sounds really cool! Your wish has been noted. Keep believing and be good, Michael!","name":"Michael","location":"Texas","toy_list":["lola droid"]}
{"transcript":"frosty: Ho Ho Ho! Who do I have here?\ncaller: It's Sarah!\nfrosty: Hi Sarah! Where are you calling from?\ncaller: From Los Angeles.\nfrosty: Fantastic! What can Frosty help you with for this holiday season?\ncaller: May I have the playfoam letters?\nfrosty: A Playfoam Naturals Shape & Learn Letters & Numbers, it's both fun and educational, great choice! Santa will be pleased to hear. Keep your spirits high and keep believing in magic, Sarah!","name":"Sarah","location":"Los Angeles","toy_list":["playfoam letters"]}
{"transcript":"frosty: Ho-ho-ho! Hello there! This is Frosty, who do I have on the line? \ncaller: Hi Frosty! I'm Benny from Seattle. \nfrosty: Hello Benny from Seattle! How can I help make your holidays magical? \ncaller: I want furby and bluey car. \nfrosty: That's great! I've made a note of furby and bluey car. Thanks for talking to me Benny, Stay cheerful!","name":"Benny","location":"Seattle","toy_list":["furby","bluey car"]}
{"transcript":"frosty: Merry greetings! This is your pal, Frosty. What's your name? \ncaller: Hi Frosty! I'm Mary. \nfrosty: Hello Mary! Where are you calling from? \ncaller: I'm from Sydney! \nfrosty: That's wonderful. Now, what would you like for Christmas this year, Mary? \ncaller: I've been good this year, so I hope I could get the barbie science doll set and mickey playset. \nfrosty: Fantastic choices Mary! Barbie Science Lab Playset and Fisher-Price Little People Mickey and Friends Playset it is! Can't wait for Christmas!","name":"Mary","location":"Sydney","toy_list":["barbie science doll set","mickey playset"]}
{"transcript":"frosty: Jolly hello! Who's on this holiday line? \ncaller: It's David. \nfrosty: Nice to meet you David! Where are you from? \ncaller: I'm from Austin. \nfrosty: Lovely! And what's on your wish list this year, David? \ncaller: I would like bitzee pet and lola droid! \nfrosty: Robot toys! Got it! Bitzee interactive pet and Star Wars LOLA animatronic droid, right? Looking forward to a magical Christmas time together!","name":"David","location":"Austin","toy_list":["bitzee pet","lola droid"]}
{"transcript":"frosty: Happy holidays! Who am I speaking with today? \ncaller: I'm Lily, can I get the fox plushie? \nfrosty: Oh, the 2023 Holiday Fox 12-Inch Plush! Wonderful choice! Lily, where are you calling from? \ncaller: From London. \nfrosty: Noted Lily from London with her fox plushie! Keep the holiday spirit high!","name":"Lily","location":"London","toy_list":["fox plushie"]}
{"transcript":"frosty: Hohoho, Happy Holidays! Who am I speaking with today? \ncaller: Hey Frosty, I'm Jack from Boston. \nfrosty: Hi Jack from Boston! What can I put on your holiday list this year? \ncaller: I've been really good this year and want the jurassic world dinosaur. \nfrosty: Jurassic World Dominion Super Colossal Giganotosaurus! A great choice, Jack! Count down the days to Christmas, it's going to be special!","name":"Jack","location":"Boston","toy_list":["jurassic world dinosaur"]}
{"transcript":"frosty: Hello! This is Frosty having the best day talking to wonderful kids like you. What's your name? \ncaller: I'm Rosie! \nfrosty: Lovely! And where are you calling from, Rosie? \ncaller: From New York City. \nfrosty: The city that never sleeps! What's on your wish list, Rosie? \ncaller: I want the candy vending machine. \nfrosty: Thames & Kosmos Candy Vending Machine STEM experiment kit. A sweet choice, Rosie! Can't wait for Christmas day!","name":"Rosie","location":"New York City","toy_list":["candy vending machine"]}
{"transcript":"frosty: Ho ho ho! Frosty here. Who am I talking to today? \ncaller: Hi Frosty, I'm Tom and I want spiderman playset. \nfrosty: Hi Tom! What a fantastic choice, Marvel's Spidey and His Amazing Friends Web Spinners playset, right? Where are you calling from? \ncaller: From Toronto. \nfrosty: Thanks Tom from Toronto! Your wish is on the list! Keep up the holiday cheer!","name":"Tom","location":"Toronto","toy_list":["spiderman playset"]}
{"transcript":"frosty: Greetings from the North Pole! Who do I have the pleasure of speaking with? \ncaller: I'm Sophie from Sydney, Frosty. \nfrosty: Nice to meet you Sophie from Sydney! And what can we bring to your Christmas from Santa's sleigh? \ncaller: I would be very happy if I get the new barbie dreamhouse. \nfrosty: Barbie Dreamhouse 2023, such a fine choice! Looking forward to Santa's visit!","name":"Sophie","location":"Sydney","toy_list":["the new barbie dreamhouse"]}
{"transcript":"frosty: Hello! This is Frosty and I'm all ears for your holiday wishes. Who am I talking to? \ncaller: It's Jake, Frosty. \nfrosty: Hi, Jake. Where are you calling from? \ncaller: From Los Angeles. \nfrosty: Fantastic! So, Jake, what's on your holiday list? \ncaller: I've decided.. I want transformers bumblebee and lego olivia's space set! \nfrosty: I love your enthusiasm, Jake! Transformers Rise of the Beasts Beast-Mode Bumblebee and Lego Friends Olivia's Space Academy are now on your list! A very merry Christmas is on its way!","name":"Jake","location":"Los Angeles","toy_list":["transformers bumblebee","lego olivia's space set"]}
{"transcript":"frosty: Ho-ho-ho! This is Frosty. Who's excited for Christmas? \ncaller: I'm Emily and I want elmo plushie from Santa! \nfrosty: Hi Emily, Sesame Street Monster Meditation Elmo is a wonderful choice! Where are you calling from? \ncaller: From Chicago. \nfrosty: Emily from Chicago, your wish is on Santa's list! Keep those Christmas dreams alive!","name":"Emily","location":"Chicago","toy_list":["elmo plushie"]}
{"transcript":"caller: Hi! \nfrosty: Hello there! My name is Frosty. May I know who I'm speaking with? \ncaller: I'm Jake.\nfrosty: Nice to meet you, Jake! Where are you calling from? \ncaller: From Seattle.\nfrosty: Wonderful! Jake from Seattle, what would you like for the holidays?\ncaller: I want a fox plushie and a robot dog.\nfrosty: Oh, the 2023 Holiday Fox 12-Inch Plush and Dog-E? Great choices, Jake! They will love being a part of your holiday festivities.","name":"Jake","location":"Seattle","toy_list":["2023 Holiday Fox 12-Inch Plush","Dog-E"]}
{"transcript":"caller: Hello!\nfrosty: Hi! My name is Frosty. What's your name, young friend? \ncaller: Lucy, and I want the new barbie dreamhouse.\nfrosty: Hello Lucy! That's a wonderful toy. Where are you calling from? \ncaller: I'm in Melbourne.\nfrosty: Craftsman, I mean, Barbie would be so proud! Lucy in Melbourne, your Barbie Dreamhouse 2023 is on its way!","name":"Lucy","location":"Melbourne","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"caller: Hi.\nfrosty: Hello! My name is Frosty. And your name is…?\ncaller: I'm Liam from London.\nfrosty: Lovely! Liam from London. What can I add to your holiday wish list?\ncaller: A slime kit, please.\nfrosty: The National Geographic Mega Slime Kit & Putty Lab, coming right up! Enjoy your holiday, Liam.","name":"Liam","location":"London","toy_list":["National Geographic Mega Slime Kit & Putty Lab"]}
{"transcript":"caller: Hi Frosty!\nfrosty: Hello! What's your name, caller? \ncaller: My name is Emily from Chicago!\nfrosty: Hello Emily from Chicago! What toy would you like for the holiday season?\ncaller: I would like the bluey playhouse.\nfrosty: The Bluey Ultimate Lights and Sounds playhouse! That sounds like a lot of fun, Emily. Your wish is my command!","name":"Emily","location":"Chicago","toy_list":["Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"caller: Hey!\nfrosty: Hi there! What's your name?\ncaller: I'm Max and I want baby bee doll.\nfrosty: Hi Max! The Orijin Bees Lovey Coiley Baby Bee is a fantastic choice! By the way, where are you calling from?\ncaller: Toronto.\nfrosty: Perfect, Max! Your baby bee doll is buzzing its way to Toronto for the holidays!","name":"Max","location":"Toronto","toy_list":["Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"caller: Hello Frosty!\nfrosty: Hello! May I know your name, please?\ncaller: I'm Grace from New York.\nfrosty: Hi Grace from New York! What can Frosty bring you for the holidays?\ncaller: I want a bluey car and a spiderman playset.\nfrosty: Great choices, Grace! The Bluey Convertible and Figures and Marvel's Spidey and His Amazing Friends Web Spinners playset are coming your way!","name":"Grace","location":"New York","toy_list":["Bluey Convertible and Figures","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"caller: Hi Frosty!\nfrosty: Hello there! What's your name, friend?\ncaller: I'm Noah. I want the transformers bumblebee and the lego olivia's space set.\nfrosty: Hello Noah! Those are some fantastic choices. Transformers Rise of the Beasts Beast-Mode Bumblebee and Lego Friends Olivia's Space Academy are on their way! Where are you calling from?\ncaller: I'm from Sydney.\nfrosty: Thank you, Noah! Sydney, lookout for some awesome toys!","name":"Noah","location":"Sydney","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Lego Friends Olivia's Space Academy"]}
{"transcript":"caller: Hiya!\nfrosty: Hello! May I know your name?\ncaller: My name is Chloe.\nfrosty: It's nice to meet you, Chloe! What can I add to your holiday wish list?\ncaller: I'd like the furby, please.\nfrosty: The Furby interactive plush toy! A classic. And may I ask where you're calling from?\ncaller: London.\nfrosty: Great! Your Furby is on its way to London!","name":"Chloe","location":"London","toy_list":["Furby interactive plush toy"]}
{"transcript":"caller: Hey, Frosty!\nfrosty: Hello! What's your name, dear caller? \ncaller: I'm Mia from Manchester.\nfrosty: Hi Mia from Manchester! Now what would you like for the holidays?\ncaller: I'd like mickey playset.\nfrosty: The Fisher-Price Little People Mickey and Friends Playset! That's a fantastic choice, Mia!","name":"Mia","location":"Manchester","toy_list":["Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"caller: Hi!\nfrosty: Hello! What's your name?\ncaller: I'm Jack from Auckland.\nfrosty: Hi Jack from Auckland! What can Frosty put on your holiday list?\ncaller: I want a bitzee pet.\nfrosty: The Bitzee interactive pet it is! It will be on its way very soon, Jack!","name":"Jack","location":"Auckland","toy_list":["Bitzee interactive pet"]}
{"transcript":"frosty: Ho Ho Ho! Hello there, little one! What's your name?\ncaller: I'm Tommy.\nfrosty: Nice to meet you, Tommy! Where are you calling from?\ncaller: I'm calling from Toronto.\nfrosty: Wonderful! Toronto is magical this time of year. Now, Tommy, what's on your holiday wish list?\ncaller: I want a furby and a lego olivia's space set.\nfrosty: A Furby interactive plush toy and Lego Friends Olivia's Space Academy. Got it. Have a magical holiday, Tommy!","name":"Tommy","location":"Toronto","toy_list":["Furby interactive plush toy","Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Jingle bells! Hello, child! What is your name?\ncaller: My name is Emily, and I live in London.\nfrosty: What a delightful city, Emily. What would you like for Christmas?\ncaller: I'd love to have a new barbie dreamhouse.\nfrosty: Ah, the Barbie Dreamhouse 2023. Brilliant choice, Emily. I'll note that down. Have a snow-tastic holiday!","name":"Emily","location":"London","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Deck the halls! Who do we have here?\ncaller: My name is Jacob.\nfrosty: Pleasure to meet you, Jacob. Where are you enjoying the winter snow?\ncaller: I'm in Melbourne.\nfrosty: Ah, wonderful Melbourne! Now, Jacob, what would you like this holiday?\ncaller: I wish for a spiderman playset.\nfrosty: Marvel's Spidey and His Amazing Friends Web Spinners playset, of course! Have an ice-tastic Christmas, Jacob!","name":"Jacob","location":"Melbourne","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Ho Ho Ho! Hello, who's speaking?\ncaller: Hi, I'm Zoe from San Francisco.\nfrosty: Wonderful! It's great to hear from you, Zoe. What's on your holiday wish list?\ncaller: I want the pokemon plushie!\nfrosty: The Pokémon 8-Inch Plush First Partner Three-Pack, a perfect choice! Have a magical Christmas, Zoe!","name":"Zoe","location":"San Francisco","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Jingle Bells! Hello, little elf! Who am I speaking with?\ncaller: Hi, I'm Michael and I want a robot dog.\nfrosty: Wonderful, Michael. We'll get that Dog-E for you! Where are you calling from?\ncaller: From Sydney.\nfrosty: Sydney! A beautiful city. Excited to deliver your wish! Have a snow-tastic holiday, Michael!","name":"Michael","location":"Sydney","toy_list":["Dog-E"]}
{"transcript":"frosty: Season's greetings! Who's on the line?\ncaller: It's Sophie. I live in New York.\nfrosty: Great to hear from you, Sophie! What's on your holiday wish list?\ncaller: I want a fox plushie.\nfrosty: The 2023 Holiday Fox 12-Inch Plush, of course. Wishing you a festive holiday, Sophie!","name":"Sophie","location":"New York","toy_list":["2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"frosty: Merry Christmas, my friend! Who is this?\ncaller: Hi Frosty! I'm Jack from Los Angeles.\nfrosty: Wonderful, Jack, I love Los Angeles. Have you been good this year? What do you wish for?\ncaller: I want a baby bee doll and a trasformers bumblebee!\nfrosty: The Orijin Bees Lovey Coiley Baby Bee and a Transformers Rise of the Beasts Beast-Mode Bumblebee. Got it. Have an extra jolly Christmas, Jack!","name":"Jack","location":"Los Angeles","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Seasons joy! What is your name, kiddo?\ncaller: My name's Lily from Liverpool.\nfrosty: Great to meet you Lily. What is your Christmas wish?\ncaller: I hope for a snap circuit set and a christmas dinosaur.\nfrosty: A Snap Circuits: Junior and a Jurassic World Dominion Super Colossal Giganotosaurus are on your wish list now. May your holiday be as delightful as a snowfall, Lily!","name":"Lily","location":"Liverpool","toy_list":["Snap Circuits: Junior","Jurassic World Dominion Super Colossal Giganotosaurus"]}
{"transcript":"frosty: Ho Ho Ho! Who's calling from where?\ncaller: It's me, Evan. I'm in Dublin.\nfrosty: Pleased to meet you, Evan! What would you like for Christmas?\ncaller: Can I please have an elmo plushie?\nfrosty: A Sesame Street Monster Meditation Elmo? Certainly! Have a wonderful Christmas, Evan!","name":"Evan","location":"Dublin","toy_list":["Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Jingle all the way! Who is this?\ncaller: I'm Amelia from Wellington.\nfrosty: Good to hear from you, Amelia! What do you wish for this holiday?\ncaller: I really want a bumpas doll.\nfrosty: A Bumpas weighted plush doll, wonderful! May your holiday wishes come true, Amelia!","name":"Amelia","location":"Wellington","toy_list":["Bumpas weighted plush doll"]}
{"transcript":"frosty: Ho ho ho! Hello there, who's on the line with Frosty today?\ncaller: Hi Frosty, it's Emily.\nfrosty: Hello Emily! That's a beautiful name. Where are you calling from?\ncaller: I'm from London.\nfrosty: Wonderful, Emily from London! What do you wish to find under the tree this season?\ncaller: I want a bluey car and a baby bee doll!\nfrosty: Fantastic! A Bluey Convertible and Figures and an Orijin Bees Lovey Coiley Baby Bee it is. Have a magical holiday, Emily!","name":"Emily","location":"London","toy_list":["Bluey Convertible and Figures","Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"frosty: Merry greetings from the North Pole! Who's speaking?\ncaller: It's Jake!\nfrosty: Hi Jake! Where are you spreading your holiday cheer from?\ncaller: From Toronto.\nfrosty: Great, Jake from Toronto! Tell Frosty, what's on your holiday wish list?\ncaller: I want a furby and a bumblebee!\nfrosty: Superb choices, Jake! A Furby interactive plush toy and Transformers Rise of the Beasts Beast-Mode Bumblebee. Enjoy your holiday, buddy!","name":"Jake","location":"Toronto","toy_list":["Furby interactive plush toy","Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: A sparkling hello! Who am I speaking to?\ncaller: My name is Lily and I want the fox plushie.\nfrosty: Hi Lily! And where are you hoping to receive the 2023 Holiday Fox 12-Inch Plush?\ncaller: From New York.\nfrosty: Perfect, Lily! Your wish has been noted. Have a beautiful holiday, sweetheart!","name":"Lily","location":"New York","toy_list":["2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"frosty: Ho ho ho! Who's chatting with Frosty today?\ncaller: It's Dylan, Frosty! I'm from Los Angeles.\nfrosty: Hi Dylan from Los Angeles! Now, what present do you dream of this season?\ncaller: I really want the spiderman playset!\nfrosty: Brilliant, Dylan! Marvel's Spidey and His Amazing Friends Web Spinners playset it is. Have a spectacular holiday!","name":"Dylan","location":"Los Angeles","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Jolly greetings! Who's excited to talk to Frosty?\ncaller: It's Olivia!\nfrosty: Hello Olivia! How wonderful. Which city are you in, Olivia?\ncaller: I'm in Sydney, Australia, Frosty.\nfrosty: Beautiful, Olivia from Sydney! And what gift are you hoping for?\ncaller: I would really love the new barbie dreamhouse.\nfrosty: That's lovely, Olivia! The Barbie Dreamhouse 2023 for a wonderful girl. Enjoy the holiday!","name":"Olivia","location":"Sydney","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Sparkling holiday wishes! Who is Frosty talking to today?\ncaller: This is Max and I would like the shark creator!\nfrosty: Great Max! We can't forget to ask, where are you calling from?\ncaller: I'm calling from Birmingham, UK.\nfrosty: Amazing! The Beast Lab: Shark Beast Creator is on your list now, Max. Happy holiday!","name":"Max","location":"Birmingham","toy_list":["Beast Lab: Shark Beast Creator"]}
{"transcript":"frosty: Merry greetings! Who's speaking today?\ncaller: It's Sophie.\nfrosty: Hi Sophie! And where are you getting ready for the holidays?\ncaller: I'm in Auckland, New Zealand.\nfrosty: Wonderful, Sophie from Auckland! What's on your holiday wish list?\ncaller: I would like a furby and a bitzee pet.\nfrosty: That sounds fun, Sophie! A Furby interactive plush toy and Bitzee interactive pet are now on your list. Have a fantastic holiday my dear!","name":"Sophie","location":"Auckland","toy_list":["Furby interactive plush toy","Bitzee interactive pet"]}
{"transcript":"frosty: Who do we have on the line with good old Frosty today?\ncaller: This is Luke from Dublin! I want the ninja turtles delivery van.\nfrosty: Hello Luke from Dublin! The Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van is an awesome pick! Enjoy your holiday, lad!","name":"Luke","location":"Dublin","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Good day and merry greetings! Who am I talking to today?\ncaller: It's Ella.\nfrosty: How do you do, Ella? May I know where you are calling from?\ncaller: From Bristol.\nfrosty: Lovely, Ella from Bristol! So, what would like from Santa this holiday?\ncaller: I would like an elmo plushie and pokemon plushie please!\nfrosty: Noted Ella! A Sesame Street Monster Meditation Elmo and Pokémon 8-Inch Plush First Partner Three-Pack for you. Happy Holidays!","name":"Ella","location":"Bristol","toy_list":["Sesame Street Monster Meditation Elmo","Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Cheers to this merry connection! Who's speaking?\ncaller: Hi Frosty, it's Noah from Chicago.\nfrosty: Hi Noah, straight from Chicago! What's on your wish list for this lovely season?\ncaller: I've been dreaming about the lola droid!\nfrosty: Outstanding choice, Noah! Star Wars LOLA animatronic droid it is. Wishing you a joy-filled holiday!","name":"Noah","location":"Chicago","toy_list":["Star Wars LOLA animatronic droid"]}
{"transcript":"frosty: Ho! Ho! Ho! Merry Christmas! This is Frosty. Who am I speaking with today?\ncaller: Hi Frosty, I'm Sophie.\nfrosty: Hi Sophie! It's so nice to meet you. Where are you calling from today?\ncaller: I'm calling from London.\nfrosty: Wonderful! What's on your wish list this year Sophie?\ncaller: I would like the furby, Frosty.\nfrosty: Oh, Furby interactive plush toy is such a great choice, Sophie! It's going to be a merry Christmas for you!","name":"Sophie","location":"London","toy_list":["Furby interactive plush toy"]}
{"transcript":"frosty: Merry Christmas! I'm Frosty, what's your name and where are you calling from?\ncaller: I'm Henry from Sydney.\nfrosty: Hi Henry, nice to have you on this call. What would you like this Christmas?\ncaller: I want the pokemon plushie and the transformers bumblebee.\nfrosty: Got it, Henry. Pokémon 8-Inch Plush First Partner Three-Pack and Transformers Rise of the Beasts Beast-Mode Bumblebee. What excellent choices!","name":"Henry","location":"Sydney","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: What an exciting time of the year! This is Frosty. Who do I have the pleasure of chatting with today?\ncaller: Hi Frosty, I'm Emily.\nfrosty: Hi there Emily! And which beautiful city are you calling from?\ncaller: I'm calling from Auckland.\nfrosty: Awesome! And what are your Christmas wishes Emily?\ncaller: I would like the lola droid and the bitsy pet.\nfrosty: Sounds wonderful Emily! Star Wars LOLA animatronic droid and Bitzee interactive pet -- they'll be so fun to play with!","name":"Emily","location":"Auckland","toy_list":["Star Wars LOLA animatronic droid","Bitzee interactive pet"]}
{"transcript":"frosty: Merry Christmas! Who is calling Frosty today?\ncaller: I'm Liam from Dublin.\nfrosty: Hello Liam from Dublin! Are you ready to tell me your Christmas wishes?\ncaller: Yes Frosty, I want the spiderman playset.\nfrosty: Marvel's Spidey and His Amazing Friends Web Spinners playset, quite a popular choice. You're going to love it Liam!","name":"Liam","location":"Dublin","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Ho! Ho! Ho! Welcome to a magic Christmas time. Who is talking to Frosty?\ncaller: It's Mia, I'm from Toronto.\nfrosty: Hi Mia, I'm glad we can talk. So, what are you wishing for this Christmas?\ncaller: I want the jurassic world dinosaur.\nfrosty: Jurassic World Dominion Super Colossal Giganotosaurus, how fun! I can see you're going to have an adventure-filled Christmas!","name":"Mia","location":"Toronto","toy_list":["Jurassic World Dominion Super Colossal Giganotosaurus"]}
{"transcript":"frosty: Merry Christmas! I'm Frosty and who might you be?\ncaller: I'm Ethan, Frosty.\nfrosty: Hi Ethan! Where are you calling from?\ncaller: I am in Seattle.\nfrosty: That's great, Ethan. What would you like from Santa this year?\ncaller: I want lego olivia's space set.\nfrosty: Lego Friends Olivia's Space Academy? You're going to have a lot of fun building that, Ethan!","name":"Ethan","location":"Seattle","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: It's the most wonderful time of the year! Who is calling Frosty today?\ncaller: I'm Lily from Cape Town.\nfrosty: Hello Lily! Are you excited to share your Christmas list?\ncaller: Yes! I want the elmo plushie and the bumpas doll.\nfrosty: Sesame Street Monster Meditation Elmo and Bumpas weighted plush doll for Lily in Cape Town. Got it! You’re going to have a blast!","name":"Lily","location":"Cape Town","toy_list":["Sesame Street Monster Meditation Elmo","Bumpas weighted plush doll"]}
{"transcript":"frosty: Ho! Ho! Ho! Who's talking with Frosty today?\ncaller: I'm Oliver from Los Angeles.\nfrosty: Nice to meet you, Oliver. What's on your wish list this holiday season?\ncaller: I would love the magnets tiles set.\nfrosty: Magna-Tiles 32-piece set, that's a fantastic choice, Oliver! They’re loads of fun and great for learning too!","name":"Oliver","location":"Los Angeles","toy_list":["Magna-Tiles 32-piece set"]}
{"transcript":"frosty: Welcome to the North Pole hotline! Frosty's listening. Who's this?\ncaller: It’s Emma.\nfrosty: Hi, Emma. What a lovely name. And where are you calling from?\ncaller: I’m calling from Sydney.\nfrosty: How lovely, Sydney! And what would you like to see under your Christmas tree, Emma?\ncaller: I wish for the barbie science doll set.\nfrosty: Barbie Science Lab Playset it is, then! It’s going to be a very Merry Christmas, Emma!","name":"Emma","location":"Sydney","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Merry Christmas! I’m Frosty. Can you tell me your name and where you’re calling from?\ncaller: I’m Jack, and I’m calling from London.\nfrosty: Hello there, Jack! What would you like this Christmas?\ncaller: I wish for the bluey playhouse and the fox plushie.\nfrosty: So, that's the Bluey Ultimate Lights and Sounds playhouse and 2023 Holiday Fox 12-Inch Plush for Jack! Noted. I'm excited for you!","name":"Jack","location":"London","toy_list":["Bluey Ultimate Lights and Sounds playhouse","2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"frosty: Hello there! Who's excited to share their holiday wish list with Frosty? \ncaller: Hi Frosty, my name is Emily and I live in New York .\nfrosty: Hi Emily, from New York! What's on your holiday wish list this year? \ncaller: I want a furby and bluey car\nfrosty: Wow, a Furby interactive plush toy and a Bluey Convertible and Figures! Those are great choices, Emily!","name":"Emily","location":"New York","toy_list":["Furby interactive plush toy","Bluey Convertible and Figures"]}
{"transcript":"frosty: Hey there, friend! Tell Frosty your name and your holiday wish. \ncaller: Hi Frosty, I'm Sam and I wish for the new barbie dreamhouse.\nfrosty: Hi Sam! And where are you calling from? \ncaller: I'm calling from Sydney.\nfrosty: That's amazing Sam, from Sydney! The Barbie Dreamhouse 2023 is remarkable, good choice!","name":"Sam","location":"Sydney","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Ho ho ho! Frosty is ready to hear your holiday wishes. Who am I speaking with today? \ncaller: Hi Frosty, I'm Bella. \nfrosty: Nice to meet you, Bella! Where are you sharing your wishes from? \ncaller:I'm from London. I would like a furby and bluey playhouse.\nfrosty: How exciting, Bella from London! The Furby interactive plush toy and the Bluey Ultimate Lights and Sounds playhouse are splendid choices!","name":"Bella","location":"London","toy_list":["Furby interactive plush toy","Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"frosty: Hello! Can't wait to hear about your holiday wishes. Who do we have here? \ncaller: Hi, I'm Ethan and I'm from Perth. \nfrosty: Wonderful, Ethan from Perth! What would you like for this holiday? \ncaller: This year, I want a pokemon plushie.\nfrosty: The Pokémon 8-Inch Plush First Partner Three-Pack, that's an amazing choice, Ethan!","name":"Ethan","location":"Perth","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Howdy partner! So who'll be sharing their holiday wish list with frosty today? \ncaller: Hi Frosty, I'm Olivia. I live in Toronto. \nfrosty: Hi Olivia, from Toronto! And what's your holiday wish this year? \ncaller: My wish is to get lola droid.\nfrosty: Oh, the Star Wars LOLA animatronic droid is lots of fun, Olivia!","name":"Olivia","location":"Toronto","toy_list":["Star Wars LOLA animatronic droid"]}
{"transcript":"frosty: Greetings! Excited to know your holiday wish, may I know your name? \ncaller: I'm Jake and I wish for a jurassic world dinosaur. \nfrosty: Hello Jake! And where is this call coming from? \ncaller: I'm calling from Los Angeles. \nfrosty: Excellent, Jake! The Jurassic World Dominion Super Colossal Giganotosaurus will surely thrill your holiday!","name":"Jake","location":"Los Angeles","toy_list":["Jurassic World Dominion Super Colossal Giganotosaurus"]}
{"transcript":"frosty: Woohoo! Let's share some holiday joy. May I know the name of my little friend? \ncaller: Hi Frosty, I'm Lily! I'm in Dublin and I wish for a candy vending machine.\nfrosty: Lily from Dublin, it's great to meet you! The Thames & Kosmos Candy Vending Machine STEM experiment kit sounds like a delightful treat!","name":"Lily","location":"Dublin","toy_list":["Thames & Kosmos Candy Vending Machine STEM experiment kit"]}
{"transcript":"frosty: It's that joyous time of the year again. Who am I speaking with? \ncaller: Hi Frosty, I'm Aiden. \nfrosty: Hi Aiden! And where are you calling from? \ncaller: I'm in Auckland. Can I wish for a robot dog and bitzee pet?\nfrosty: Of course Aiden, from Auckland! The Dog-E and Bitzee interactive pet will keep you busy all holiday!","name":"Aiden","location":"Auckland","toy_list":["Dog-E","Bitzee interactive pet"]}
{"transcript":"frosty: What's your name, little one? Let's share some holiday magic! \ncaller: I'm Oliver and I'm from Calgary. I wish for a mickey playset and barbie science doll set.\nfrosty: Wonderful choices, Oliver from Calgary! The Fisher-Price Little People Mickey and Friends Playset and Barbie Science Lab Playset will surely add fun to your holiday!","name":"Oliver","location":"Calgary","toy_list":["Fisher-Price Little People Mickey and Friends Playset","Barbie Science Lab Playset"]}
{"transcript":"frosty: Ho ho ho! Who have we got here, ready to share their holiday wishes? \ncaller: Hi Frosty, it's me, Lucy. I want the fox plushie and elmo plushie. \nfrosty: Lucy, those are wonderful wishes! The 2023 Holiday Fox 12-Inch Plush and Sesame Street Monster Meditation Elmo are soft and huggable, perfect for the holiday!","name":"Lucy","location":"","toy_list":["2023 Holiday Fox 12-Inch Plush","Sesame Street Monster Meditation Elmo"]}
{"transcript":"\nfrosty: Hello, Merry Christmas! This is Frosty. Who am I speaking with today?\ncaller: Hi, I'm Danny.\nfrosty: Hi Danny! It's a pleasure to meet you. Can you tell me where you're calling from?\ncaller: Orlando, Florida.\nfrosty: That's great, Danny! Can you please tell me what's on your holiday wish list?\ncaller: I want the bluey car and barbie science doll set.\nfrosty: Oh wow, Bluey Convertible and Figures, and the Barbie Science Lab Playset! That sounds super fun! Watch for Frosty's magic, Santa will get your message. Happy Holidays Danny!\n","name":"Danny","location":"Orlando, Florida","toy_list":["Bluey Convertible and Figures","Barbie Science Lab Playset"]}
{"transcript":"\nfrosty: Hello there, this is Frosty! What's your name, little friend?\ncaller: I'm Lilly from California.\nfrosty: A pleasure to meet you Lilly! So, what special toys do you wish for this Christmas?\ncaller: Gabby dollhouse.\nfrosty: A Gabbys Dollhouse Cruise Ship! What a great choice! Santa will surely note this. Have a magical holiday season, Lilly!\n","name":"Lilly","location":"California","toy_list":["Gabbys Dollhouse Cruise Ship"]}
{"transcript":"\nfrosty: Ho ho ho! Merry Christmas! Who's talking with Frosty today?\ncaller: Emily here.\nfrosty: Wonderful! Emily, where are you calling from?\ncaller: I'm from New York.\nfrosty: Oh, how wonderful, Emily! And what's your Christmas wish?\ncaller: the new barbie dreamhouse and furby.\nfrosty: Barbie Dreamhouse 2023 and a Furby interactive plush toy! Magically awesome choices! Santa will receive your wish list. Merry Christmas, Emily!\n","name":"Emily","location":"New York","toy_list":["Barbie Dreamhouse 2023","Furby interactive plush toy"]}
{"transcript":"\nfrosty: Ho ho ho! This is Frosty. May I know your name?\ncaller: Hi Frosty, I'm James.\nfrosty: Hello James! Could you tell me where you're calling from?\ncaller: Sydney, Australia.\nfrosty: Ah, Sydney! Now, James, what would you like for Christmas?\ncaller: lola droid and spiderman playset.\nfrosty: Star Wars LOLA animatronic droid and Marvel's Spidey and His Amazing Friends Web Spinners playset! Those are cool toys. Santa is making a note. Merry Christmas, James!\n","name":"James","location":"Sydney, Australia","toy_list":["Star Wars LOLA animatronic droid","Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"\nfrosty: Merry Christmas! Frosty here. Who do I have the pleasure of speaking with?\ncaller: Hi, I'm Alice from Toronto, Canada.\nfrosty: Hi Alice. That sounds cool! Now, tell Frosty your Christmas wish.\ncaller: I wish for the lego olivia's space set.\nfrosty: Lego Friends Olivia's Space Academy! That's a wonderful choice. I'm sure Santa will get your message. Happy Holidays, Alice!\n","name":"Alice","location":"Toronto, Canada","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"\nfrosty: Hello! Merry Christmas! This is Frosty speaking. Could I have your name?\ncaller: My name's Noah.\nfrosty: Nice to meet you, Noah! Can you tell Frosty where you're calling from?\ncaller: London, UK.\nfrosty: Righto, Noah from London! What Christmas wish do you have?\ncaller: ninja turtles delivery van and magna tiles set.\nfrosty: Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van and Magna-Tiles 32-piece set! Awesome! Santa will hear about this. Merry Christmas, Noah!\n","name":"Noah","location":"London, UK","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van","Magna-Tiles 32-piece set"]}
{"transcript":"\nfrosty: Ho Ho Ho! This is Frosty the bot. May I ask who I'm speaking with today?\ncaller: Hey, this is Andy.\nfrosty: Fabulous! And where are you calling from, Andy?\ncaller: Houston, Texas.\nfrosty: What a place, Andy! Can you tell me your toy wishes?\ncaller: fortnite llama and playfoam letters.\nfrosty: Fortnite Llama Piñata and a Playfoam Naturals Shape & Learn Letters & Numbers. Interesting choices! Elves are already working on it. Merry Christmas Andy!\n","name":"Andy","location":"Houston, Texas","toy_list":["Fortnite Llama Piñata","Playfoam Naturals Shape & Learn Letters & Numbers"]}
{"transcript":"\nfrosty: Hello, this is Frosty! Who's ready to share their holiday wishes?\ncaller: Hi Frosty, I'm Bella from Seattle.\nfrosty: Hello, Bella! So, tell me what you're hoping to find under the tree this year?\ncaller: the shark creator and mickey playset.\nfrosty: Beast Lab: Shark Beast Creator, Fisher-Price Little People Mickey and Friends Playset, lovely choices! Santa will get your message. Have a magical holiday season Bella!\n","name":"Bella","location":"Seattle","toy_list":["Beast Lab: Shark Beast Creator","Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"\nfrosty: Ho ho ho! Who's speaking with Frosty now?\ncaller: Hi, I'm Toby.\nfrosty: Wonderful, Toby! Can you tell me where you're speaking from?\ncaller: From Auckland, New Zealand.\nfrosty: Super! Toby, could you share your Christmas toy wish?\ncaller: candy vending machine and jurassic world dinosaur.\nfrosty: Thames & Kosmos Candy Vending Machine STEM experiment kit, Jurassic World Dominion Super Colossal Giganotosaurus! Fantastic choices, Toby! Santa will hear about this. Merry Christmas!\n","name":"Toby","location":"Auckland, New Zealand","toy_list":["Thames & Kosmos Candy Vending Machine STEM experiment kit","Jurassic World Dominion Super Colossal Giganotosaurus"]}
{"transcript":"\nfrosty: Merry Christmas! I'm Frosty. What's your name?\ncaller: This is Mia from Dublin.\nfrosty: It's nice to meet you Mia! Can you give Frosty your Christmas wish?\ncaller: I want the baby bee doll.\nfrosty: Orijin Bees Lovey Coiley Baby Bee! That's such a lovely gift. Santa is making a note. Happy Holidays, Mia!\n","name":"Mia","location":"Dublin","toy_list":["Orijin Bees Lovey Coiley Baby Bee"]}
{"transcript":"frosty: Hello there! I'm Frosty, your holiday helper. What's your name, dear friend?\ncaller: Hi Frosty! I'm Jenny.\nfrosty: Hi Jenny, nice to meet you! Where are you calling from?\ncaller: I'm calling from Sydney, Australia.\nfrosty: Wonderful! Now, what's on your holiday wish list this year?\ncaller: I want the baby bee doll and the bluey car.\nfrosty: Ah, the Orijin Bees Lovey Coiley Baby Bee and the Bluey Convertible and Figures! Both are excellent choices. I'll make a note of this. Happy Holidays, Jenny!","name":"Jenny","location":"Sydney, Australia","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Bluey Convertible and Figures"]}
{"transcript":"frosty: Ho Ho Ho! It's Frosty. May I know your name?\ncaller: I'm Daniel.\nfrosty: Nice to meet you, Daniel. Where are you calling from?\ncaller: From Seattle, Frosty!\nfrosty: Perfect! And What do you wish for holiday?\ncaller: I hope to get a furby this year.\nfrosty: The Furby interactive plush toy! That's such a wonderful choice. Let's wish you get that! Happy holidays Daniel!","name":"Daniel","location":"Seattle","toy_list":["Furby interactive plush toy"]}
{"transcript":"frosty: Merry greetings! I'm Frosty. What's your name, little one?\ncaller: Hey Frosty, I'm Emily.\nfrosty: Great to know you, Emily! where are you calling from?\ncaller: I'm calling from London.\nfrosty: Cool! What do you wish for this holiday?\ncaller: I want the new barbie dreamhouse.\nfrosty: Got it, the Barbie Dreamhouse 2023! Let's hope your wish comes true! ","name":"Emily","location":"London","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Happy Holidays! This is Frosty. Can you tell me your name, little buddy?\ncaller: Hi Frosty! I'm Max. I come from Los Angeles and I want the pokemon plushie.\nfrosty: Oh Max from Los Angeles, the Pokémon 8-Inch Plush First Partner Three-Pack is indeed a great wish! Hope your holiday is as special as you are.","name":"Max","location":"Los Angeles","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Hi buddy! It's Frosty here. What's your name?\ncaller: Hello Frosty, I'm Noah and I live in Toronto.\nfrosty: Hi Noah from Toronto! And what's on your wish list?\ncaller: I want the spiderman playset.\nfrosty: That's cool! The Marvel's Spidey and His Amazing Friends Web Spinners playset! Let's hold thumbs your wish comes true!","name":"Noah","location":"Toronto","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Hello my friend! I'm Frosty. May I know your name?\ncaller: Hi Frosty, I'm Chloe.\nfrosty: Hi Chloe, great to hear from you! Where are you calling from?\ncaller: From Birmingham.\nfrosty: Lovely! What's on your holiday wish list?\ncaller: I want the lego olivia's space set and the slime kit.\nfrosty: The Lego Friends Olivia's Space Academy and the National Geographic Mega Slime Kit & Putty Lab! That's so creative! I've added your wishes! Enjoy your holidays, Chloe!","name":"Chloe","location":"Birmingham","toy_list":["Lego Friends Olivia's Space Academy","National Geographic Mega Slime Kit & Putty Lab"]}
{"transcript":"frosty: Hey kiddo! This is Frosty. What's your name?\ncaller: Hi Frosty! I'm Adam and I live in Auckland.\nfrosty: Hi Adam from Auckland! And what's on your wish list?\ncaller: I'd love the magic microscope.\nfrosty: The LeapFrog Magic Adventures Microscope, fantastic choice! Let's hope your holiday wish comes true!","name":"Adam","location":"Auckland","toy_list":["LeapFrog Magic Adventures Microscope"]}
{"transcript":"frosty: Hi there! I'm Frosty. May I know your name, little friend?\ncaller: Hey Frosty, my name's Kate.\nfrosty: Hi Kate, nice to hear from you! Where are you calling from?\ncaller: From Vancouver.\nfrosty: Great! And what's on your holiday wish list?\ncaller: I want a barbie science doll set.\nfrosty: The Barbie Science Lab Playset! What an educational choice! I'll make sure to take note of that. Happy Holidays, Kate!","name":"Kate","location":"Vancouver","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"frosty: Hello, it's your holiday friend Frosty. Who do I have the pleasure of speaking to?\ncaller: Hi Frosty, I'm Lucas from Wellington and I want a trasformers bumblebee.\nfrosty: Perfect, Lucas from Wellington! The Transformers Rise of the Beasts Beast-Mode Bumblebee is indeed a fantastic toy! We'll do our best to fulfill your holiday wish.","name":"Lucas","location":"Wellington","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Season's greetings! I'm Frosty. Could you tell me your name?\ncaller: Hi Frosty! I'm Molly from Dublin and I want a lola droid.\nfrosty: Molly from Dublin! The Star Wars LOLA animatronic droid, it's a top choice! Here's hoping your holiday stars align to make your wish come true.","name":"Molly","location":"Dublin","toy_list":["Star Wars LOLA animatronic droid"]}
{"transcript":"Frosty: Hello! This is Frosty, how can I assist you this holiday? \nCaller: Hi Frosty, I'm Charlie. \nFrosty: Hello Charlie! Where are you calling from? \nCaller: I'm from London. \nFrosty: That's awesome, Charlie from London! And what would you like for this holiday? \nCaller: I want a bluey car and the new barbie dreamhouse. \nFrosty: Great choice Charlie! The Bluey Convertible and Figures along with the Barbie Dreamhouse 2023, they'll be put on your wish list. Wishing you a wonderful holiday filled with joy!","name":"Charlie","location":"London","toy_list":["Bluey Convertible and Figures","Barbie Dreamhouse 2023"]}
{"transcript":"Frosty: Merry greetings! I am Frosty. How can I serve you this holiday season? \nCaller: Hey, my name is Emily and I want a fox plushie. \nFrosty: Nice to meet you Emily! And where is this 2023 Holiday Fox 12-Inch Plush going? \nCaller: Los Angeles is my city. \nFrosty: Emily from Los Angeles, your fox plushie is on its way. Have a magical festive season!","name":"Emily","location":"Los Angeles","toy_list":["2023 Holiday Fox 12-Inch Plush"]}
{"transcript":"Frosty: Ho Ho Ho! Welcome to the toy hotline. This is Frosty. \nCaller: Hi Frosty! I'm Amelia from Sydney. \nFrosty: It's nice to meet you Amelia. What's your wish this holiday season? \nCaller: I want a furby and spiderman playset. \nFrosty: Fantastic choices, Amelia! The Furby Interactive Plush Toy and Marvel's Spidey and His Amazing Friends Web Spinners Playset will be awaiting you. Have a wonderful holiday!","name":"Amelia","location":"Sydney","toy_list":["Furby Interactive Plush Toy","Marvel's Spidey and His Amazing Friends Web Spinners Playset"]}
{"transcript":"Frosty: Happiest holiday greetings! This is Frosty on the line. What's your name? \nCaller: I'm Sam. \nFrosty: Nice to meet you Sam! Where are you located? \nCaller: I'm in Manchester. \nFrosty: Wonderful, Sam from Manchester! And what do you hope to see in your gift box this season? \nCaller: Can I get the baby bee doll and jurassic world dinosaur? \nFrosty: Absolutely! The Orijin Bees Lovey Coiley Baby Bee and Jurassic World Dominion Super Colossal Giganotosaurus will be put on your wish list. Happy holidays, Sam!","name":"Sam","location":"Manchester","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Jurassic World Dominion Super Colossal Giganotosaurus"]}
{"transcript":"Frosty: Hello, holiday cheers from Frosty! I'm here to fulfill your wishes. Who am I speaking with? \nCaller: My name's Lily and I live in Auckland. \nFrosty: It's lovely to meet you Lily! What would you like for this holiday? \nCaller: Can I get the little pets surprise and lego olivia's space set? \nFrosty: Little Live Pets Mama Surprise and Lego Friends Olivia's Space Academy, got it! Have a merry & joy-filled holiday Lily!","name":"Lily","location":"Auckland","toy_list":["Little Live Pets Mama Surprise","Lego Friends Olivia's Space Academy"]}
{"transcript":"Frosty: Jingle bells! You're on line with Frosty. Can I know your name? \nCaller: Hello! I am Benjamin. \nFrosty: Hey Benjamin! Where's home for you? \nCaller: I'm from Dublin. \nFrosty: That's great, Benjamin from Dublin! Which toys have caught your fancy? \nCaller: I'd like the bitzee pet and candy vending machine. \nFrosty: Noted, Benjamin! The Bitzee Interactive Pet and Thames & Kosmos Candy Vending Machine STEM Experiment Kit are now on your wish list. Happy holidays!","name":"Benjamin","location":"Dublin","toy_list":["Bitzee Interactive Pet","Thames & Kosmos Candy Vending Machine STEM Experiment Kit"]}
{"transcript":"Frosty: Tis the season to be jolly, Frosty here! Who do I have the pleasure of speaking with? \nCaller: Hi, my name is Mia. \nFrosty: Hello, Mia! Which part of the world are you calling from? \nCaller: I'm calling from Melbourne. \nFrosty: Marvelous! What would you like for Christmas, Mia? \nCaller: I'd like a barbie science doll set. \nFrosty: Excellent! The Barbie Science Lab Playset will be on your wish list. Have a joyful holiday season, Mia!","name":"Mia","location":"Melbourne","toy_list":["Barbie Science Lab Playset"]}
{"transcript":"Frosty: Hello! This is Frosty, your holiday helper. What's your name? \nCaller: Hi Frosty, I'm Lucas from Toronto. \nFrosty: Hello Lucas! What can I help you with this holiday season? \nCaller: Can I have a pokemon plushie and a robot dog? \nFrosty: Absolutely! The Pokémon 8-Inch Plush First Partner Three-Pack and Dog-E will be added to your wish list. Happy holidays, Lucas!","name":"Lucas","location":"Toronto","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Dog-E"]}
{"transcript":"Frosty: Season's greetings! I'm Frosty. May I know your name? \nCaller: Hey, it's Ethan. \nFrosty: Hello Ethan! Where are you calling from? \nCaller: I'm from San Francisco. \nFrosty: That's wonderful! What would you like for Christmas, Ethan? \nCaller: I'd like to get the mickey playset and magna tiles set. \nFrosty: Great choices, Ethan! The Fisher-Price Little People Mickey and Friends Playset and Magna-Tiles 32-piece set will be added to your wish list. Wish you a magical holiday season!","name":"Ethan","location":"San Francisco","toy_list":["Fisher-Price Little People Mickey and Friends Playset","Magna-Tiles 32-piece set"]}
{"transcript":"Frosty: Ho Ho Ho! It's Frosty here. What's your name? \nCaller: I'm Isabella and I live in Edinburgh. \nFrosty: That's lovely to hear, Isabella! What do you want for this holiday season? \nCaller: I'd like a ninja turtles delivery van and an elmo plushie. \nFrosty: Great choices, Isabella! The Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van and Sesame Street Monster Meditation Elmo are on your wish list. Have a joyful holiday!","name":"Isabella","location":"Edinburgh","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van","Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Hello there! This is Frosty! What's your name, my friend?\ncaller: Hi Frosty! I'm Emma.\nfrosty: Hi Emma, so nice to meet you! Where are you calling from?\ncaller: I'm calling from Auckland, New Zealand.\nfrosty: Oh, I love Auckland! Now, what's on your wish list this year?\ncaller: Can I have a furby and a barbie science doll set?\nfrosty: Oh, excellent choices, Emma! I'm sure you'll have a lot of fun with the Furby Interactive Plush Toy and the Barbie Science Lab Playset! Don't forget to be good until I come, okay?","name":"Emma","location":"Auckland, New Zealand","toy_list":["Furby interactive plush toy","Barbie Science Lab Playset"]}
{"transcript":"frosty: Hi, this is Frosty! Who do I have the pleasure of speaking with today?\ncaller: I'm Jack, Frosty!\nfrosty: Pleasure to meet you, Jack! Where are you calling from, champ?\ncaller: I am from San Francisco.\nfrosty: San Francisco, one of my favorite places! So, Jack, what toys do you want this year?\ncaller: Can I have a pokemon plushie?\nfrosty: A Pokémon 8-Inch Plush First Partner Three-Pack? Absolutely, Jack! Make sure to be a good boy until I come to deliver it!","name":"Jack","location":"San Francisco","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack"]}
{"transcript":"frosty: Hello my friend! I'm Frosty! Who am I talking to?\ncaller: Hello Frosty! My name is Mia and I want the new barbie dreamhouse and a fox plushie!\nfrosty: Well, nice to meet you Mia! Where are you calling from?\ncaller: I'm calling from Sydney, Australia.\nfrosty: Awesome, Mia! So, you would like the 2023 Holiday Fox 12-Inch Plush and the Barbie Dreamhouse 2023. Fantastic choices!","name":"Mia","location":"Sydney, Australia","toy_list":["2023 Holiday Fox 12-Inch Plush","Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Hi! It's Frosty here! May I have your name, please?\ncaller: I'm Liam from London, Frosty.\nfrosty: Hi Liam from London, great to meet you! What is on your holiday wish list?\ncaller: I want a trasformers bumblebee, please.\nfrosty: I got it Liam - the Transformers Rise of the Beasts Beast-Mode Bumblebee. What a fun toy that will be!","name":"Liam","location":"London","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Greetings! I'm Frosty! Who's excited for the holidays?\ncaller: I am! My name is Sophia.\nfrosty: Nice to meet you, Sophia! And where are you calling from?\ncaller: I'm in Melbourne, Australia.\nfrosty: Oh, Melbourne is a lovely city, Sophia! Now, tell me what's on your wish list?\ncaller: I want a fingerlings monkey, Frosty.\nfrosty: Sounds great, Sophia! You want a Fingerlings, correct? Make sure to be good until I come!","name":"Sophia","location":"Melbourne, Australia","toy_list":["Fingerlings"]}
{"transcript":"frosty: Hello there! It's Frosty the voice bot. Who is on the line?\ncaller: Hi Frosty, I'm Ethan!\nfrosty: Hi Ethan, great to meet you! Where are you calling from?\ncaller: I'm calling from Ottawa, Canada.\nfrosty: Fantastic, Ethan! Now, do tell, what's on your wish list?\ncaller: I wish for a lego olivia's space set.\nfrosty: Noted, Ethan! You'd like the Lego Friends Olivia's Space Academy. Sounds like an excellent choice!","name":"Ethan","location":"Ottawa, Canada","toy_list":["Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Hi there! You're talking to Frosty! What's your name?\ncaller: My name is Ava.\nfrosty: Nice to meet you, Ava! Where are you calling from?\ncaller: I am calling from Toronto, Canada.\nfrosty: Toronto, what a beautiful city! Now, Ava, what's on your holiday wish list?\ncaller: Could I have an elmo plushie?\nfrosty: Sure thing, Ava! The Sesame Street Monster Meditation Elmo. What a cuddly choice!","name":"Ava","location":"Toronto, Canada","toy_list":["Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: Hello! Frosty here! May I know who I am talking with?\ncaller: My name's Noah, Frosty. I'm from Dublin.\nfrosty: Hi Noah from Dublin, so nice to meet you! What are you hoping to see under the tree this year?\ncaller: Could I have a bluey car and a bitzee pet?\nfrosty: Absolutely, Noah! You'd like the Bluey Convertible and Figures, and the Bitzee Interactive Pet. Sound like tons of fun!","name":"Noah","location":"Dublin","toy_list":["Bluey Convertible and Figures","Bitzee Interactive Pet"]}
{"transcript":"frosty: Hi there! Who's excited for the holidays?\ncaller: Hi Frosty! It's Isabella from Sydney and I would like a gabby dollhouse, please!\nfrosty: Hi Isabella, from Sydney! You got it, the Gabbys Dollhouse Cruise Ship it is! I'm sure you'll have lots of fun with it!","name":"Isabella","location":"Sydney, Australia","toy_list":["Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Hello, good friend! You're talking to Frosty! What's your name?\ncaller: My name's Oliver. And I'm calling from Perth.\nfrosty: Nice to meet you, Oliver from Perth! So, what's on your wish list this year?\ncaller: I want a mickey playset, please.\nfrosty: The Fisher-Price Little People Mickey and Friends Playset! That's an excellent choice, Oliver! Look forward to some Mickey adventures!","name":"Oliver","location":"Perth, Australia","toy_list":["Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Hello dear! This is Frosty! What’s your name, and how old are you? \ncaller: I'm Jacob, I'm 7. \nfrosty: Hi Jacob! That's a wonderful age to be! Where do you live? \ncaller: I live in London. \nfrosty: London, oh it’s such a lovely city! Now, Jacob, what do you want for the holidays? \ncaller: I want the trasformers bumblebee. \nfrosty: Transformers Rise of the Beasts Beast-Mode Bumblebee, got it! That sounds absolutely fun, Jacob! I hope your lovely holiday wish comes true!","name":"Jacob","location":"London","toy_list":["Trasformers Rise of the Beasts Beast-Mode Bumblebee"]}
{"transcript":"frosty: Hi there! It's Frosty! What might your name be, little one? \ncaller: My name is Lily. \nfrosty: Hi Lily! Such a sweet name! May I know where you're calling from? \ncaller: From Manchester. \nfrosty: Manchester is great! And, Lily, could you tell me what you'd like for the holidays? \ncaller: I want the baby bee doll and furby. \nfrosty: The Orijin Bees Lovey Coiley Baby Bee and Furby interactive plush toy, fantastic choices Lily! Hope all your wishes come true!","name":"Lily","location":"Manchester","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Furby interactive plush toy"]}
{"transcript":"frosty: Hi kiddo! This is Frosty speaking! Could you tell me your name? \ncaller: I'm Max and I want the gabby dollhouse. \nfrosty: Hi Max! You have a strong name! Now, where are you calling from? \ncaller: I’m based in New York. \nfrosty: New York, the city of dreams! So, you wished for the Gabby's Dollhouse Cruise Ship, right? \ncaller: Yes, that's what I want. \nfrosty: A splendid choice Max! Hope your holiday dreams come true!","name":"Max","location":"New York","toy_list":["Gabbys Dollhouse Cruise Ship"]}
{"transcript":"frosty: Hello there! It's Frosty! Can I learn your name, please? \ncaller: I'm Emily. \nfrosty: Hi Emily! May I know where you're calling from? \ncaller: From Sydney. \nfrosty: Sydney, oh I hear it's a beautiful place! What toys would brighten your holidays Emily? \ncaller: I want the bluey playhouse. \nfrosty: Bluey Ultimate Lights and Sounds playhouse! That's a very fun choice, Emily. Fingers crossed for your holiday wishes!","name":"Emily","location":"Sydney","toy_list":["Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"frosty: Hi there, it's Frosty. Let's start with your name, kiddo! \ncaller: My name is Oliver. \nfrosty: Hey Oliver! It's a pleasure! Could you tell me where you're calling from? \ncaller: I'm calling from Dublin. \nfrosty: Ah, Dublin, a fabulous city! Now, which toys would make your holidays memorable, Oliver? \ncaller: I would love the barbie science doll set and the ninja turtles delivery van. \nfrosty: The Barbie Science Lab Playset and Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van? Awesome! I’m excited for you, Oliver!","name":"Oliver","location":"Dublin","toy_list":["Barbie Science Lab Playset","Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Hey there! Frosty speaking! What's your name? \ncaller: I'm Kate and I want the little pets surprise. \nfrosty: Hi Kate, wonderful! But can I know where you're calling from? \ncaller: I'm from Auckland. \nfrosty: Auckland, lovely! Just to confirm, you wished for Little Live Pets Mama Surprise, right Kate? \ncaller: Yes, that's correct! \nfrosty: That’s a fantastic wish, Kate! I hope it comes true!","name":"Kate","location":"Auckland","toy_list":["Little Live Pets Mama Surprise"]}
{"transcript":"frosty: Hi, it's Frosty! Would you tell me your name, please? \ncaller: I'm Ethan. \nfrosty: Hi Ethan! That's a cool name! Where are you located? \ncaller: In Toronto. \nfrosty: Toronto, nice! So, Ethan, what's on your wish list this holiday season? \ncaller: I would love to have the robot dog. \nfrosty: Dog-E, the robot dog, oh that's a fun toy! I hope your holiday wishes come true!","name":"Ethan","location":"Toronto","toy_list":["Dog-E"]}
{"transcript":"frosty: Hello! This is Frosty! May I have your name, kiddo? \ncaller: I'm Anna and I want the spiderman playset. \nfrosty: Hi Anna! Your wish is the Marvel's Spidey and His Amazing Friends Web Spinners playset, correct? \ncaller: Yes, that's it. \nfrosty: Where are you joining us from, Anna? \ncaller: From Los Angeles. \nfrosty: Los Angeles, awesome! I hope your Spider-Man wish zooms its way to you soon!","name":"Anna","location":"Los Angeles","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset"]}
{"transcript":"frosty: Hi! This is Frosty! What's your name, sweetie? \ncaller: My name is     Sophie. \nfrosty: Hello Sophie! Where are you joining us from? \ncaller: I'm from Wellington. \nfrosty: Wellington, that's cool! And, Sophie, what would you like for the holidays? \ncaller: I’d love to have the new barbie dreamhouse and the playfoam letters. \nfrosty: The Barbie Dreamhouse 2023 and Playfoam Naturals Shape & Learn Letters & Numbers. Wonderful! Wishing you all the holiday joy Sophie!","name":"Sophie","location":"Wellington","toy_list":["Barbie Dreamhouse 2023","Playfoam Naturals Shape & Learn Letters & Numbers"]}
{"transcript":"frosty: Hello there! You're speaking with Frosty! As we embark on this festive journey, could I know your name? \ncaller: I'm Liam and I want the fingerlings monkey. \nfrosty: Hi Liam! That's a fun-sounding toy! The Fingerlings, right? \ncaller: Yes! \nfrosty: Great, Liam, where are you calling from? \ncaller: From Vancouver. \nfrosty: Vancouver, that's cool! Cross fingers your holiday wish comes true, Liam!","name":"Liam","location":"Vancouver","toy_list":["Fingerlings"]}
{"transcript":"frosty: Hello, dear child! I'm Frosty, your festive friend! What's your name? \ncaller: I'm Timmy. \nfrosty: Hi Timmy, wish you a merry holiday season! Where are you calling from, Timmy? \ncaller: I'm from Orlando, Florida. \nfrosty: That's wonderful! Now, what's your special wish this festive season, Timmy? \ncaller: I want a furby and a bluey car. \nfrosty: Fantastic choices, Timmy! Our elves would be excited to wrap a Furby interactive plush toy and a Bluey Convertible and Figures. Happy Holidays!","name":"Timmy","location":"Orlando, Florida","toy_list":["Furby interactive plush toy","Bluey Convertible and Figures"]}
{"transcript":"frosty: Hohoho! Merry December! I'm Frosty! May I know your name, little one? \ncaller: My name is Lisa. I want the new barbie dreamhouse. \nfrosty: What a lovely name, Lisa! And that's a brilliant wish! Okay, Lisa, where are you making your wish from? \ncaller: I'm from Toronto, Canada. \nfrosty: Great! So, we have a wish for a Barbie Dreamhouse 2023 from Lisa in Toronto. Your dreamhouse will be ready for you, Lisa. Make sure to save a room for me in the dreamhouse!","name":"Lisa","location":"Toronto, Canada","toy_list":["Barbie Dreamhouse 2023"]}
{"transcript":"frosty: Season’s greetings! This is Frosty calling from the North Pole! Who am I speaking with? \ncaller: Hi Frosty, I'm Max. \nfrosty: Hello Max, wishing you a magical holiday season! Would you tell me where you are, Max? \ncaller: I'm in Sydney, Australia. \nfrosty: All the way from Sydney! Amazing! What’s your holiday wish, Max? \ncaller: I wish for pokemon plushie and lego olivia's space set. \nfrosty: Those are wonderful choices, Max! A Pokémon 8-Inch Plush First Partner Three-Pack and a Lego Friends Olivia's Space Academy will be on their way to Sydney. May your holidays twinkle with joy and love!","name":"Max","location":"Sydney, Australia","toy_list":["Pokémon 8-Inch Plush First Partner Three-Pack","Lego Friends Olivia's Space Academy"]}
{"transcript":"frosty: Hi there, happy holiday season! I'm Frosty. May I have your name, please? \ncaller: Hi, I'm Jessica. \nfrosty: Nice to meet you, Jessica! And where are you speaking from, Jessica? \ncaller: I am calling from Auckland, New Zealand. \nfrosty: How delightful! Now, I can't wait to hear your wishes, Jessica. What would you like for this holiday season? \ncaller: I want a spiderman playset and a mickey playset. \nfrosty: Wow, Jessica! Both the Marvel's Spidey and His Amazing Friends Web Spinners playset and Fisher-Price Little People Mickey and Friends Playset sound like so much fun! We'll get those ready for you. Enjoy the holiday cheer!","name":"Jessica","location":"Auckland, New Zealand","toy_list":["Marvel's Spidey and His Amazing Friends Web Spinners playset","Fisher-Price Little People Mickey and Friends Playset"]}
{"transcript":"frosty: Jingle bells, jingle bells, jingle all the way! Ho ho ho! This is Frosty, your holiday express! And your name is? \ncaller: My name's Ben and I want the bluey playhouse. \nfrosty: How great, Ben! Bluey's Ultimate Lights and Sounds playhouse it is! Ben, would you tell me where you're calling from? \ncaller: I'm in Kingston, Jamaica. \nfrosty: So much holiday spirit in Kingston! The Bluey Ultimate Lights and Sounds playhouse will be heading your way soon, Ben! Make a wish and believe in the magic of holiday!","name":"Ben","location":"Kingston, Jamaica","toy_list":["Bluey Ultimate Lights and Sounds playhouse"]}
{"transcript":"frosty: Hello, little dreamer! Have you been naughty or nice this year? Who's calling Frosty today? \ncaller: Hi Frosty, I'm Maya. \nfrosty: Hello, Maya! Where are you calling from? \ncaller: From Wellington, New Zealand. \nfrosty: Lovely! And, what are your wishes this holiday season, Maya? \ncaller: I wish for a barbie science doll set and an elmo plushie. \nfrosty: A Barbie Science Lab Playset and a Sesame Street Monster Meditation Elmo! Amazing! Maya, your holiday season will be filled with fun discoveries and cuddles!","name":"Maya","location":"Wellington, New Zealand","toy_list":["Barbie Science Lab Playset","Sesame Street Monster Meditation Elmo"]}
{"transcript":"frosty: It's the most magical time of the year! Who's sharing the joy with Frosty today? \ncaller: My name's Oliver. I want the ninja turtles delivery van. \nfrosty: Welcome, Oliver! Your wish for a Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van is noted. Tell me, Oliver, where are you located now? \ncaller: I'm in Birmingham, England. \nfrosty: Very well, Oliver from Birmingham! We'll get your Ninja Turtles van speeding straight to you. May your holidays be filled with fun and adventure!","name":"Oliver","location":"Birmingham, England","toy_list":["Teenage Mutant Ninja Turtles: Mutant Mayhem Pizza Fire Delivery Van"]}
{"transcript":"frosty: Hi, holiday adventurer! It's Frosty speaking. What's your name, dear one? \ncaller: Hi Frosty, I'm Lily. \nfrosty: Wonderful to hear from you, Lily! And where are you spreading the holiday cheer from, Lily? \ncaller: I'm from Melbourne, Australia. \nfrosty: That's fantastic! Now, it's time to make a wish, Lily! What would you like this holiday season? \ncaller: I want trasformers bumblebee and a candy vending machine. \nfrosty: Exciting choices, Lily! Get ready for a Transformers Rise of the Beasts Beast-Mode Bumblebee and a Thames & Kosmos Candy Vending Machine STEM experiment kit. Happy Holiday Wishes!","name":"Lily","location":"Melbourne, Australia","toy_list":["Transformers Rise of the Beasts Beast-Mode Bumblebee","Thames & Kosmos Candy Vending Machine STEM experiment kit"]}
{"transcript":"frosty: Yay, it's holiday time! Who's talking to Frosty today? \ncaller: It's Charlie here. \nfrosty: Hi Charlie! Where are you calling from? \ncaller: From Sacramento, California. \nfrosty: Wow, California! Now, what's your special wish this festive season, Charlie? \ncaller: I wish for a baby bee doll and a bitzee pet. \nfrosty: Absolutely, Charlie! An Orijin Bees Lovey Coiley Baby Bee and a Bitzee interactive pet will be whizzing their way to Sacramento. May your holidays be buzzing with fun!","name":"Charlie","location":"Sacramento, California","toy_list":["Orijin Bees Lovey Coiley Baby Bee","Bitzee interactive pet"]}
{"transcript":"frosty: Snowflakes are falling, and Frosty is calling! Who am I speaking with? \ncaller: My name is Emma, and I want gabby dollhouse. \nfrosty: Lovely to meet you, Emma! You sound excited about the Gabbys Dollhouse Cruise Ship. Can you tell me where you're calling from? \ncaller: I'm from Glasgow, Scotland. \nfrosty: Fabulous, Emma from Glasgow! We got your wish for the Gabbys Dollhouse Cruise Ship. Let there be love, joy, and play in your holiday!","name":"Emma","location":"Glasgow, Scotland","toy_list":["Gabbys Dollhouse Cruise Ship"]}
